#loc = loc(unknown)
#loc1 = loc("input_states")
#loc2 = loc("conv_state")
#loc3 = loc("recurrent_state")
module @block_cache_13 attributes {module.FLOPs = 119543952 : i64, module.addr_mode = "io_alone", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.inputs = ["input_states", "conv_state", "recurrent_state"], module.mode = "W4BF16", module.outputs = ["output_states", "model.language_model.layers.13.linear_attn.conv1d.concat"], module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "block_cache_13_tpu_addressed_bm1684x_w4bf16_weight.npz"} {
  module @block_cache_13 attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 30969856 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 30969856 : i64, module.io_addr = 4325937152 : i64, module.io_size = 577536 : i64, module.neuron_addr = 4326514688 : i64, module.neuron_size = 77824 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x1x2048xf32> loc(unknown), %arg1: tensor<1x6144x4xf32> loc(unknown), %arg2: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64>) {
      %0 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16, 4325937152 : i64> loc(#loc1)
      %1 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x6144x4xf32>) -> tensor<1x6144x4xbf16, 4325941248 : i64> loc(#loc2)
      %2 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xbf16, 4325990400 : i64> loc(#loc3)
      %3:2 = call @subfunc_0(%0, %1, %2) : (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64>, tensor<1x16x128x128xbf16, 4325990400 : i64>) -> (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64>) loc(#loc)
      return %3#0, %3#1 : tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x1x2048xbf16, 4325937152 : i64> loc("input_states"), %arg1: tensor<1x6144x4xbf16, 4325941248 : i64> loc("conv_state"), %arg2: tensor<1x16x128x128xbf16, 4325990400 : i64> loc("recurrent_state")) -> (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4294967296 : i64> loc(#loc4)
      %2 = "top.Weight"() {allow_split = [1, 1, 1], path = "tpu.Mul.1"} : () -> tensor<1x1x16xbf16, 4294971392 : i64> loc(#loc5)
      %3 = "top.Weight"() {allow_split = [1, 1, 1], path = "tpu.Mul.1"} : () -> tensor<1x6144x4xbf16, 4294975488 : i64> loc(#loc6)
      %4 = "top.Weight"() {path = "top.Weight.Placeholder", placeholder = true} : () -> tensor<64x64xbf16, 4295024640 : i64> loc(#loc7)
      %5 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1x16xbf16, 4295032832 : i64> loc(#loc8)
      %6 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1x2048x16xbf16, 4295036928 : i64> loc(#loc9)
      %7 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1x2048x16xbf16, 4295102464 : i64> loc(#loc10)
      %8 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4295168000 : i64> loc(#loc11)
      %9 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4295266304 : i64> loc(#loc12)
      %10 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4295462912 : i64> loc(#loc13)
      %11 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4301754368 : i64> loc(#loc14)
      %12 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4301787136 : i64> loc(#loc15)
      %13 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4301852672 : i64> loc(#loc16)
      %14 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x128xbf16, 4303949824 : i64> loc(#loc17)
      %15 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4303953920 : i64> loc(#loc18)
      %16 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4303986688 : i64> loc(#loc19)
      %17 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4304052224 : i64> loc(#loc20)
      %18 = "top.Weight"() {path = "top.Weight.Placeholder", placeholder = true} : () -> tensor<64x64xbf16, 4306149376 : i64> loc(#loc21)
      %19 = "top.Weight"() {path = "top.Weight.Placeholder", placeholder = true} : () -> tensor<64x64xbf16, 4306157568 : i64> loc(#loc22)
      %20 = "top.Weight"() {path = "top.Weight.Placeholder", placeholder = true} : () -> tensor<64x64xbf16, 4306165760 : i64> loc(#loc23)
      %21 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x48xui8, 4306173952 : i64> loc(#loc24)
      %22 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x48xbf16, 4306272256 : i64> loc(#loc25)
      %23 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x3072xui8, 4306468864 : i64> loc(#loc26)
      %24 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4312760320 : i64> loc(#loc27)
      %25 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4312858624 : i64> loc(#loc28)
      %26 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4313055232 : i64> loc(#loc29)
      %27 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4319346688 : i64> loc(#loc30)
      %28 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4319444992 : i64> loc(#loc31)
      %29 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4319641600 : i64> loc(#loc32)
      %30 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4325933056 : i64> loc(#loc33)
      %31 = "top.None"() : () -> none loc(#loc)
      %32 = "tpu.RMSNorm"(%arg0, %1) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x1x2048xbf16, 4294967296 : i64>) -> tensor<1x1x2048xbf16, 4326526976 : i64> loc(#loc34)
      %33 = "tpu.A16MatMul"(%32, %13, %12, %11, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326526976 : i64>, tensor<2048x1024xui8, 4301852672 : i64>, tensor<64x32x16xbf16, 4301787136 : i64>, tensor<64x32x16xui8, 4301754368 : i64>, none) -> tensor<1x1x2048xbf16, 4326514688 : i64> loc(#loc35)
      %34 = "tpu.Cast"(%33) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xbf16, 4326514688 : i64>) -> tensor<1x1x2048xf32, 4326576128 : i64> loc(#loc36)
      %35:2 = "tpu.Group"(%32) ({
        %63 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x16xbf16, 4295032832 : i64>) -> tensor<1x1x16xbf16> loc(#loc39)
        %64 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [2048], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x2048x16xbf16, 4295036928 : i64>) -> tensor<1x2048x16xbf16> loc(#loc40)
        %65 = "tpu.Load"(%32) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326526976 : i64>) -> tensor<1x1x2048xbf16> loc(#loc41)
        %66 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [2048], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x2048x16xbf16, 4295102464 : i64>) -> tensor<1x2048x16xbf16> loc(#loc42)
        %67 = "tpu.MatMul"(%65, %64, %63, %31, %31) {do_relu = false, dq_type = "NONE", fuse_rq = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1x2048xbf16>, tensor<1x2048x16xbf16>, tensor<1x1x16xbf16>, none, none) -> tensor<1x1x16xbf16> loc(#loc43)
        %68 = "tpu.Cast"(%67) {ginfo = #tpu.lg<out_addr = 34816, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xbf16>) -> tensor<1x1x16xf32> loc(#loc37)
        %69 = "tpu.Store"(%68, %0) {ginfo = #tpu.lg<out_addr = 34816, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 6, stage = 1, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x16xf32>, none) -> tensor<1x1x16xf32, 4326588416 : i64> loc(#loc37)
        %70 = "tpu.MatMul"(%65, %66, %31, %31, %31) {do_relu = false, dq_type = "NONE", fuse_rq = false, ginfo = #tpu.lg<out_addr = 49216, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 7, stage = 1, slice_idx = 0, group_type = 4>, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1x2048xbf16>, tensor<1x2048x16xbf16>, none, none, none) -> tensor<1x1x16xbf16> loc(#loc44)
        %71 = "tpu.Cast"(%70) {ginfo = #tpu.lg<out_addr = 18432, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 8, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xbf16>) -> tensor<1x1x16xf32> loc(#loc38)
        %72 = "tpu.Store"(%71, %0) {ginfo = #tpu.lg<out_addr = 18432, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 9, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x16xf32>, none) -> tensor<1x1x16xf32, 4326584320 : i64> loc(#loc38)
        "tpu.Yield"(%69, %72) : (tensor<1x1x16xf32, 4326588416 : i64>, tensor<1x1x16xf32, 4326584320 : i64>) -> () loc(#loc86)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 9, 3, -2, 5, 0, -3, 7, 6, 1, -4, 8, 2], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xbf16, 4326526976 : i64>) -> (tensor<1x1x16xf32, 4326588416 : i64>, tensor<1x1x16xf32, 4326584320 : i64>) loc(#loc86)
      %36 = "tpu.A16MatMul"(%32, %10, %9, %8, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326526976 : i64>, tensor<6144x1024xui8, 4295462912 : i64>, tensor<64x96x16xbf16, 4295266304 : i64>, tensor<64x96x16xui8, 4295168000 : i64>, none) -> tensor<1x1x6144xbf16, 4326514688 : i64> loc(#loc45)
      %37 = "tpu.Reshape"(%36) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x6144xbf16, 4326514688 : i64>) -> tensor<1x6144x1xbf16, 4326514688 : i64> loc(#loc46)
      %38 = "tpu.ConcatSlice"(%arg1, %37) {axis = 2 : i64} : (tensor<1x6144x4xbf16, 4325941248 : i64>, tensor<1x6144x1xbf16, 4326514688 : i64>) -> tensor<1x6144x4xbf16, 4325941248 : i64> loc(#loc47)
      %39 = "tpu.Mul"(%38, %3) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x6144x4xbf16, 4325941248 : i64>, tensor<1x6144x4xbf16, 4294975488 : i64>) -> tensor<1x6144x4xbf16, 4326514688 : i64> loc(#loc48)
      %40 = "tpu.Reduce"(%39, %31, %31) {axes = [2], is_scalar = false, keepdims = false, mode = "ReduceSum"} : (tensor<1x6144x4xbf16, 4326514688 : i64>, none, none) -> tensor<1x6144xbf16, 4326563840 : i64> loc(#loc49)
      %41 = "tpu.Cast"(%40) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144xbf16, 4326563840 : i64>) -> tensor<1x6144xf32, 4326539264 : i64> loc(#loc50)
      %42:2 = "tpu.Group"(%35#1, %35#0) ({
        %63 = "tpu.Load"(%35#1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x16xf32, 4326584320 : i64>) -> tensor<1x1x16xf32> loc(#loc53)
        %64 = "tpu.Load"(%35#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x16xf32, 4326588416 : i64>) -> tensor<1x1x16xf32> loc(#loc54)
        %65 = "tpu.Active"(%63) {bias = 0.000000e+00 : f64, ginfo = #tpu.lg<out_addr = 32768, out_size = 64, buffer_addr = 49152, buffer_size = 256, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc55)
        %66 = "tpu.Cast"(%65) {ginfo = #tpu.lg<out_addr = 128, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xf32>) -> tensor<1x1x16xbf16> loc(#loc51)
        %67 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 64, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x16xbf16, 4294971392 : i64>) -> tensor<1x1x16xbf16> loc(#loc56)
        %68 = "tpu.Store"(%66, %0) {ginfo = #tpu.lg<out_addr = 128, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x16xbf16>, none) -> tensor<1x1x16xbf16, 4326567936 : i64> loc(#loc51)
        %69 = "tpu.Active"(%64) {ginfo = #tpu.lg<out_addr = 49152, out_size = 64, buffer_addr = 32768, buffer_size = 320, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 6, stage = 1, slice_idx = 0, group_type = 4>, mode = #tpu<active_mode SOFT_PLUS>} : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc57)
        %70 = "tpu.Cast"(%69) {ginfo = #tpu.lg<out_addr = 16384, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 7, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xf32>) -> tensor<1x1x16xbf16> loc(#loc58)
        %71 = "tpu.Mul"(%70, %67) {do_relu = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 8, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x16xbf16>, tensor<1x1x16xbf16>) -> tensor<1x1x16xbf16> loc(#loc52)
        %72 = "tpu.Store"(%71, %0) {ginfo = #tpu.lg<out_addr = 65536, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 9, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x16xbf16>, none) -> tensor<1x1x16xbf16, 4326563840 : i64> loc(#loc52)
        "tpu.Yield"(%68, %72) : (tensor<1x1x16xbf16, 4326567936 : i64>, tensor<1x1x16xbf16, 4326563840 : i64>) -> () loc(#loc87)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 2, 9, 1, -2, 3, -3, 6, 4, 5, 0, -4, 7, -5, 8], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x16xf32, 4326584320 : i64>, tensor<1x1x16xf32, 4326588416 : i64>) -> (tensor<1x1x16xbf16, 4326567936 : i64>, tensor<1x1x16xbf16, 4326563840 : i64>) loc(#loc87)
      %43 = "tpu.Active"(%41) {mode = #tpu<active_mode SILU>} : (tensor<1x6144xf32, 4326539264 : i64>) -> tensor<1x6144xf32, 4326514688 : i64> loc(#loc59)
      %44 = "tpu.Cast"(%43) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144xf32, 4326514688 : i64>) -> tensor<1x6144xbf16, 4326539264 : i64> loc(#loc60)
      %45 = "tpu.Slice"(%44, %31, %31, %31, %31) {axes = [], ends = [1, 2048], hasparamConvert_axes = [], offset = [0, 0], steps = [1, 1]} : (tensor<1x6144xbf16, 4326539264 : i64>, none, none, none, none) -> tensor<1x2048xbf16, 4326539264 : i64> loc(#loc61)
      %46 = "tpu.Slice"(%44, %31, %31, %31, %31) {axes = [], ends = [1, 4096], hasparamConvert_axes = [], offset = [0, 2048], steps = [1, 1]} : (tensor<1x6144xbf16, 4326539264 : i64>, none, none, none, none) -> tensor<1x2048xbf16, 4326543360 : i64> loc(#loc62)
      %47 = "tpu.Slice"(%44, %31, %31, %31, %31) {axes = [], ends = [1, 6144], hasparamConvert_axes = [], offset = [0, 4096], steps = [1, 1]} : (tensor<1x6144xbf16, 4326539264 : i64>, none, none, none, none) -> tensor<1x2048xbf16, 4326547456 : i64> loc(#loc63)
      %48 = "tpu.RecurrentGatedDeltaRule"(%45, %46, %47, %42#1, %42#0, %arg2) {d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x2048xbf16, 4326539264 : i64>, tensor<1x2048xbf16, 4326543360 : i64>, tensor<1x2048xbf16, 4326547456 : i64>, tensor<1x1x16xbf16, 4326563840 : i64>, tensor<1x1x16xbf16, 4326567936 : i64>, tensor<1x16x128x128xbf16, 4325990400 : i64>) -> tensor<1x1x16x128xbf16, 4326531072 : i64> loc(#loc64)
      %49 = "tpu.RMSNorm"(%48, %14) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x16x128xbf16, 4326531072 : i64>, tensor<1x1x1x128xbf16, 4303949824 : i64>) -> tensor<1x1x16x128xbf16, 4326526976 : i64> loc(#loc65)
      %50 = "tpu.Reshape"(%49) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x16x128xbf16, 4326526976 : i64>) -> tensor<1x1x2048xbf16, 4326526976 : i64> loc(#loc66)
      %51 = "tpu.Active"(%34) {mode = #tpu<active_mode SILU>} : (tensor<1x1x2048xf32, 4326576128 : i64>) -> tensor<1x1x2048xf32, 4326514688 : i64> loc(#loc67)
      %52 = "tpu.Group"(%51, %50) ({
        %63 = "tpu.Load"(%51) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xf32, 4326514688 : i64>) -> tensor<1x1x2048xf32> loc(#loc69)
        %64 = "tpu.Load"(%50) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326526976 : i64>) -> tensor<1x1x2048xbf16> loc(#loc70)
        %65 = "tpu.Cast"(%63) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16> loc(#loc71)
        %66 = "tpu.Mul"(%64, %65) {do_relu = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc68)
        %67 = "tpu.Store"(%66, %0) {ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 4, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326522880 : i64> loc(#loc68)
        "tpu.Yield"(%67) : (tensor<1x1x2048xbf16, 4326522880 : i64>) -> () loc(#loc68)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 2, 1, 4, -2, 3, 0], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xf32, 4326514688 : i64>, tensor<1x1x2048xbf16, 4326526976 : i64>) -> tensor<1x1x2048xbf16, 4326522880 : i64> loc(#loc68)
      %53 = "tpu.A16MatMul"(%52, %17, %16, %15, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326522880 : i64>, tensor<2048x1024xui8, 4304052224 : i64>, tensor<64x32x16xbf16, 4303986688 : i64>, tensor<64x32x16xui8, 4303953920 : i64>, none) -> tensor<1x1x2048xbf16, 4326514688 : i64> loc(#loc72)
      %54:2 = "tpu.Group"(%arg0, %53) ({
        %63 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4325937152 : i64>) -> tensor<1x1x2048xbf16> loc(#loc75)
        %64 = "tpu.Load"(%53) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326514688 : i64>) -> tensor<1x1x2048xbf16> loc(#loc76)
        %65 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4325933056 : i64>) -> tensor<1x1x2048xbf16> loc(#loc77)
        %66 = "tpu.Add"(%63, %64) {do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc73)
        %67 = "tpu.Store"(%66, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326563840 : i64> loc(#loc73)
        %68 = "tpu.RMSNorm"(%66, %65) {eps = 9.9999999999999995E-7 : f64, ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 65536, buffer_size = 16448, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 4>, weight_keep_f32 = false} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc74)
        %69 = "tpu.Store"(%68, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 6, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326567936 : i64> loc(#loc74)
        "tpu.Yield"(%67, %69) : (tensor<1x1x2048xbf16, 4326563840 : i64>, tensor<1x1x2048xbf16, 4326567936 : i64>) -> () loc(#loc88)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 6, -2, 5, 4, 0, 1], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x1x2048xbf16, 4326514688 : i64>) -> (tensor<1x1x2048xbf16, 4326563840 : i64>, tensor<1x1x2048xbf16, 4326567936 : i64>) loc(#loc88)
      %55 = "tpu.A16MatMul"(%54#1, %26, %25, %24, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326567936 : i64>, tensor<6144x1024xui8, 4313055232 : i64>, tensor<64x96x16xbf16, 4312858624 : i64>, tensor<64x96x16xui8, 4312760320 : i64>, none) -> tensor<1x1x6144xbf16, 4326514688 : i64> loc(#loc78)
      %56 = "tpu.Cast"(%55) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xbf16, 4326514688 : i64>) -> tensor<1x1x6144xf32, 4326539264 : i64> loc(#loc79)
      %57 = "tpu.Active"(%56) {mode = #tpu<active_mode SILU>} : (tensor<1x1x6144xf32, 4326539264 : i64>) -> tensor<1x1x6144xf32, 4326514688 : i64> loc(#loc80)
      %58 = "tpu.Cast"(%57) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xf32, 4326514688 : i64>) -> tensor<1x1x6144xbf16, 4326539264 : i64> loc(#loc81)
      %59 = "tpu.A16MatMul"(%54#1, %29, %28, %27, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326567936 : i64>, tensor<6144x1024xui8, 4319641600 : i64>, tensor<64x96x16xbf16, 4319444992 : i64>, tensor<64x96x16xui8, 4319346688 : i64>, none) -> tensor<1x1x6144xbf16, 4326526976 : i64> loc(#loc82)
      %60 = "tpu.Mul"(%58, %59) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x6144xbf16, 4326539264 : i64>, tensor<1x1x6144xbf16, 4326526976 : i64>) -> tensor<1x1x6144xbf16, 4326514688 : i64> loc(#loc83)
      %61 = "tpu.A16MatMul"(%60, %23, %22, %21, %31) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x6144xbf16, 4326514688 : i64>, tensor<2048x3072xui8, 4306468864 : i64>, tensor<64x32x48xbf16, 4306272256 : i64>, tensor<64x32x48xui8, 4306173952 : i64>, none) -> tensor<1x1x2048xbf16, 4326526976 : i64> loc(#loc84)
      %62 = "tpu.Add"(%54#0, %61) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16, 4326563840 : i64>, tensor<1x1x2048xbf16, 4326526976 : i64>) -> tensor<1x1x2048xbf16, 4325937152 : i64> loc(#loc85)
      return %62, %38 : tensor<1x1x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4325941248 : i64> loc(#loc)
    } loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc4 = loc("model.language_model.layers.13.input_layernorm.weight_bf16")
#loc5 = loc("model.language_model.layers.13.linear_attn.A_log.weight_bf16")
#loc6 = loc("model.language_model.layers.13.linear_attn.conv1d.weight_bf16")
#loc7 = loc("model.language_model.layers.13.linear_attn.eye_bf16")
#loc8 = loc("model.language_model.layers.13.linear_attn.in_proj_a.bias_bf16")
#loc9 = loc("model.language_model.layers.13.linear_attn.in_proj_a.weight_bf16")
#loc10 = loc("model.language_model.layers.13.linear_attn.in_proj_b.weight_bf16")
#loc11 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv_1_reordered")
#loc12 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv_reordered")
#loc13 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv_weight")
#loc14 = loc("model.language_model.layers.13.linear_attn.in_proj_z_1_reordered")
#loc15 = loc("model.language_model.layers.13.linear_attn.in_proj_z_reordered")
#loc16 = loc("model.language_model.layers.13.linear_attn.in_proj_z_weight")
#loc17 = loc("model.language_model.layers.13.linear_attn.norm.weight_bf16")
#loc18 = loc("model.language_model.layers.13.linear_attn.out_proj_1_reordered")
#loc19 = loc("model.language_model.layers.13.linear_attn.out_proj_reordered")
#loc20 = loc("model.language_model.layers.13.linear_attn.out_proj_weight")
#loc21 = loc("model.language_model.layers.13.linear_attn.strict_triu_mask_bf16")
#loc22 = loc("model.language_model.layers.13.linear_attn.tril_mask_bf16")
#loc23 = loc("model.language_model.layers.13.linear_attn.triu_mask_bf16")
#loc24 = loc("model.language_model.layers.13.mlp.down_proj_1_reordered")
#loc25 = loc("model.language_model.layers.13.mlp.down_proj_reordered")
#loc26 = loc("model.language_model.layers.13.mlp.down_proj_weight")
#loc27 = loc("model.language_model.layers.13.mlp.gate_proj_1_reordered")
#loc28 = loc("model.language_model.layers.13.mlp.gate_proj_reordered")
#loc29 = loc("model.language_model.layers.13.mlp.gate_proj_weight")
#loc30 = loc("model.language_model.layers.13.mlp.up_proj_1_reordered")
#loc31 = loc("model.language_model.layers.13.mlp.up_proj_reordered")
#loc32 = loc("model.language_model.layers.13.mlp.up_proj_weight")
#loc33 = loc("model.language_model.layers.13.post_attention_layernorm.weight_bf16")
#loc34 = loc("model.language_model.layers.13.input_layernorm")
#loc35 = loc("model.language_model.layers.13.linear_attn.in_proj_z")
#loc36 = loc("model.language_model.layers.13.linear_attn.in_proj_zmodel.language_model.layers.13.linear_attn.in_proj_z.silu_f32")
#loc37 = loc("model.language_model.layers.13.linear_attn.in_proj_amodel.language_model.layers.13.linear_attn.in_proj_a.softplus_f32")
#loc38 = loc("model.language_model.layers.13.linear_attn.in_proj_bmodel.language_model.layers.13.linear_attn.in_proj_b.sigmoid_f32")
#loc39 = loc("load_model.language_model.layers.13.linear_attn.in_proj_a.bias_bf16")
#loc40 = loc("load_model.language_model.layers.13.linear_attn.in_proj_a.weight_bf16")
#loc41 = loc("load_model.language_model.layers.13.input_layernorm")
#loc42 = loc("load_model.language_model.layers.13.linear_attn.in_proj_b.weight_bf16")
#loc43 = loc("model.language_model.layers.13.linear_attn.in_proj_a")
#loc44 = loc("model.language_model.layers.13.linear_attn.in_proj_b")
#loc45 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv")
#loc46 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.reshape")
#loc47 = loc("model.language_model.layers.13.linear_attn.conv1d.concat")
#loc48 = loc("model.language_model.layers.13.linear_attn.conv1d.mul")
#loc49 = loc("model.language_model.layers.13.linear_attn.conv1d.reduce_sum")
#loc50 = loc("model.language_model.layers.13.linear_attn.conv1d.reduce_summodel.language_model.layers.13.linear_attn.conv1d.silu_f32")
#loc51 = loc("model.language_model.layers.13.linear_attn.in_proj_b.sigmoidmodel.language_model.layers.13.recurrent_gated_delta_rule_bf16")
#loc52 = loc("model.language_model.layers.13.linear_attn.in_proj_a.mul")
#loc53 = loc("load_model.language_model.layers.13.linear_attn.in_proj_bmodel.language_model.layers.13.linear_attn.in_proj_b.sigmoid_f32")
#loc54 = loc("load_model.language_model.layers.13.linear_attn.in_proj_amodel.language_model.layers.13.linear_attn.in_proj_a.softplus_f32")
#loc55 = loc("model.language_model.layers.13.linear_attn.in_proj_b.sigmoid")
#loc56 = loc("load_model.language_model.layers.13.linear_attn.A_log.weight_bf16")
#loc57 = loc("model.language_model.layers.13.linear_attn.in_proj_a.softplus")
#loc58 = loc("model.language_model.layers.13.linear_attn.in_proj_a.softplusmodel.language_model.layers.13.linear_attn.in_proj_a.mul_bf16")
#loc59 = loc("model.language_model.layers.13.linear_attn.conv1d.silu")
#loc60 = loc("model.language_model.layers.13.linear_attn.conv1d.silumodel.language_model.layers.13.linear_attn.in_proj_qkv.q_slice_bf16")
#loc61 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.q_slice")
#loc62 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.k_slice")
#loc63 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.v_slice")
#loc64 = loc("model.language_model.layers.13.recurrent_gated_delta_rule")
#loc65 = loc("model.language_model.layers.13.linear_attn.norm")
#loc66 = loc("model.language_model.layers.13..core_attn_reshape")
#loc67 = loc("model.language_model.layers.13.linear_attn.in_proj_z.silu")
#loc68 = loc("model.language_model.layers.13..core_attn_mul")
#loc69 = loc("load_model.language_model.layers.13.linear_attn.in_proj_z.silu")
#loc70 = loc("load_model.language_model.layers.13..core_attn_reshape")
#loc71 = loc("model.language_model.layers.13.linear_attn.in_proj_z.silumodel.language_model.layers.13..core_attn_mul_bf16")
#loc72 = loc("model.language_model.layers.13.linear_attn.out_proj")
#loc73 = loc("model.language_model.layers.13.linear_attn.out_proj.add")
#loc74 = loc("model.language_model.layers.13.post_attention_layernorm")
#loc75 = loc("load_0")
#loc76 = loc("load_model.language_model.layers.13.linear_attn.out_proj")
#loc77 = loc("load_model.language_model.layers.13.post_attention_layernorm.weight_bf16")
#loc78 = loc("model.language_model.layers.13.mlp.gate_proj")
#loc79 = loc("model.language_model.layers.13.mlp.gate_projmodel.language_model.layers.13.mlp.gate_proj.silu_f32")
#loc80 = loc("model.language_model.layers.13.mlp.gate_proj.silu")
#loc81 = loc("model.language_model.layers.13.mlp.gate_proj.silumodel.language_model.layers.13.mlp.up_proj.mul_bf16")
#loc82 = loc("model.language_model.layers.13.mlp.up_proj")
#loc83 = loc("model.language_model.layers.13.mlp.up_proj.mul")
#loc84 = loc("model.language_model.layers.13.mlp.down_proj")
#loc85 = loc("output_states")
#loc86 = loc(fused[#loc37, #loc38])
#loc87 = loc(fused[#loc51, #loc52])
#loc88 = loc(fused[#loc73, #loc74])

