#loc = loc(unknown)
module @block_cache_13 attributes {module.FLOPs = 119543952 : i64, module.addr_mode = "io_alone", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.mode = "W4BF16", module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "block_cache_13_bm1684x_w4bf16_tpu_weights.npz"} {
  func.func @main(%arg0: tensor<1x1x2048xf32> loc(unknown), %arg1: tensor<1x6144x4xf32> loc(unknown), %arg2: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1x2048xf32>, tensor<1x6144x4xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x6144x4xf32>) -> tensor<1x6144x4xf32> loc(#loc3)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144x4xf32>) -> tensor<1x6144x4xbf16> loc(#loc4)
    %5 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xf32> loc(#loc5)
    %6 = "tpu.Cast"(%5) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xbf16> loc(#loc6)
    %7 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xbf16> loc(#loc7)
    %8 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xbf16> loc(#loc8)
    %9 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xbf16> loc(#loc9)
    %10 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xbf16> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc11)
    %12 = "tpu.RMSNorm"(%2, %11) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc15)
    %16 = "tpu.A16MatMul"(%12, %13, %14, %15, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16>, tensor<2048x1024xui8>, tensor<2048x16xbf16>, tensor<2048x16xui8>, none) -> tensor<1x1x2048xbf16> loc(#loc16)
    %17 = "tpu.Cast"(%16) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xbf16>) -> tensor<1x1x2048xf32> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<1x1x16xbf16> loc(#loc19)
    %20 = "tpu.MatMul"(%12, %18, %19, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1x2048xbf16>, tensor<2048x16xbf16>, tensor<1x1x16xbf16>, none, none) -> tensor<1x1x16xbf16> loc(#loc20)
    %21 = "tpu.Cast"(%20) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xbf16>) -> tensor<1x1x16xf32> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc22)
    %23 = "tpu.MatMul"(%12, %22, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1x2048xbf16>, tensor<2048x16xbf16>, none, none, none) -> tensor<1x1x16xbf16> loc(#loc23)
    %24 = "tpu.Cast"(%23) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xbf16>) -> tensor<1x1x16xf32> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc27)
    %28 = "tpu.A16MatMul"(%12, %25, %26, %27, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xbf16> loc(#loc28)
    %29 = "tpu.Reshape"(%28) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x6144xbf16>) -> tensor<1x6144x1xbf16> loc(#loc29)
    %30 = "tpu.ConcatSlice"(%4, %29) {axis = 2 : i64} : (tensor<1x6144x4xbf16>, tensor<1x6144x1xbf16>) -> tensor<1x6144x4xbf16> loc(#loc30)
    %31 = "tpu.Cast"(%30) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144x4xbf16>) -> tensor<1x6144x4xf32> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<1x6144x4xbf16> loc(#loc32)
    %33 = "tpu.Mul"(%30, %32) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x6144x4xbf16>, tensor<1x6144x4xbf16>) -> tensor<1x6144x4xbf16> loc(#loc33)
    %34 = "tpu.Reduce"(%33, %0, %0) {axes = [2], is_scalar = false, keepdims = false, mode = "ReduceSum"} : (tensor<1x6144x4xbf16>, none, none) -> tensor<1x6144xbf16> loc(#loc34)
    %35 = "tpu.Cast"(%34) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144xbf16>) -> tensor<1x6144xf32> loc(#loc35)
    %36 = "tpu.Active"(%24) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc36)
    %37 = "tpu.Cast"(%36) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xf32>) -> tensor<1x1x16xbf16> loc(#loc37)
    %38 = "tpu.Active"(%21) {mode = #tpu<active_mode SOFT_PLUS>} : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc38)
    %39 = "tpu.Cast"(%38) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x16xf32>) -> tensor<1x1x16xbf16> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<1x1x16xbf16> loc(#loc40)
    %41 = "tpu.Mul"(%39, %40) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x16xbf16>, tensor<1x1x16xbf16>) -> tensor<1x1x16xbf16> loc(#loc41)
    %42 = "tpu.Active"(%35) {mode = #tpu<active_mode SILU>} : (tensor<1x6144xf32>) -> tensor<1x6144xf32> loc(#loc42)
    %43 = "tpu.Cast"(%42) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144xf32>) -> tensor<1x6144xbf16> loc(#loc43)
    %44 = "tpu.Slice"(%43, %0, %0, %0, %0) {axes = [], ends = [1, 2048], hasparamConvert_axes = [], offset = [0, 0], steps = [1, 1]} : (tensor<1x6144xbf16>, none, none, none, none) -> tensor<1x2048xbf16> loc(#loc44)
    %45 = "tpu.Slice"(%43, %0, %0, %0, %0) {axes = [], ends = [1, 4096], hasparamConvert_axes = [], offset = [0, 2048], steps = [1, 1]} : (tensor<1x6144xbf16>, none, none, none, none) -> tensor<1x2048xbf16> loc(#loc45)
    %46 = "tpu.Slice"(%43, %0, %0, %0, %0) {axes = [], ends = [1, 6144], hasparamConvert_axes = [], offset = [0, 4096], steps = [1, 1]} : (tensor<1x6144xbf16>, none, none, none, none) -> tensor<1x2048xbf16> loc(#loc46)
    %47 = "tpu.RecurrentGatedDeltaRule"(%44, %45, %46, %41, %37, %6) {d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x2048xbf16>, tensor<1x2048xbf16>, tensor<1x2048xbf16>, tensor<1x1x16xbf16>, tensor<1x1x16xbf16>, tensor<1x16x128x128xbf16>) -> tensor<1x1x16x128xbf16> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<1x1x1x128xbf16> loc(#loc48)
    %49 = "tpu.RMSNorm"(%47, %48) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x16x128xbf16>, tensor<1x1x1x128xbf16>) -> tensor<1x1x16x128xbf16> loc(#loc49)
    %50 = "tpu.Reshape"(%49) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x16x128xbf16>) -> tensor<1x1x2048xbf16> loc(#loc50)
    %51 = "tpu.Active"(%17) {mode = #tpu<active_mode SILU>} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc51)
    %52 = "tpu.Cast"(%51) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16> loc(#loc52)
    %53 = "tpu.Mul"(%50, %52) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc56)
    %57 = "tpu.A16MatMul"(%53, %54, %55, %56, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16>, tensor<2048x1024xui8>, tensor<2048x16xbf16>, tensor<2048x16xui8>, none) -> tensor<1x1x2048xbf16> loc(#loc57)
    %58 = "tpu.Add"(%2, %57) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc59)
    %60 = "tpu.RMSNorm"(%58, %59) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc63)
    %64 = "tpu.A16MatMul"(%60, %61, %62, %63, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xbf16> loc(#loc64)
    %65 = "tpu.Cast"(%64) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xbf16>) -> tensor<1x1x6144xf32> loc(#loc65)
    %66 = "tpu.Active"(%65) {mode = #tpu<active_mode SILU>} : (tensor<1x1x6144xf32>) -> tensor<1x1x6144xf32> loc(#loc66)
    %67 = "tpu.Cast"(%66) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xf32>) -> tensor<1x1x6144xbf16> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc68)
    %69 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc69)
    %70 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc70)
    %71 = "tpu.A16MatMul"(%60, %68, %69, %70, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xbf16> loc(#loc71)
    %72 = "tpu.Mul"(%67, %71) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x6144xbf16>, tensor<1x1x6144xbf16>) -> tensor<1x1x6144xbf16> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<2048x48xbf16> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc75)
    %76 = "tpu.A16MatMul"(%72, %73, %74, %75, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x6144xbf16>, tensor<2048x3072xui8>, tensor<2048x48xbf16>, tensor<2048x48xui8>, none) -> tensor<1x1x2048xbf16> loc(#loc76)
    %77 = "tpu.Add"(%58, %76) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc77)
    %78 = "tpu.Cast"(%77) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xbf16>) -> tensor<1x1x2048xf32> loc(#loc78)
    return %78, %31 : tensor<1x1x2048xf32>, tensor<1x6144x4xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("input_statesmodel.language_model.layers.13.input_layernorm_bf16")
#loc3 = loc("conv_state")
#loc4 = loc("conv_statemodel.language_model.layers.13.linear_attn.conv1d.concat_bf16")
#loc5 = loc("recurrent_state")
#loc6 = loc("recurrent_statemodel.language_model.layers.13.recurrent_gated_delta_rule_bf16")
#loc7 = loc("model.language_model.layers.13.linear_attn.triu_mask_bf16")
#loc8 = loc("model.language_model.layers.13.linear_attn.strict_triu_mask_bf16")
#loc9 = loc("model.language_model.layers.13.linear_attn.tril_mask_bf16")
#loc10 = loc("model.language_model.layers.13.linear_attn.eye_bf16")
#loc11 = loc("model.language_model.layers.13.input_layernorm.weight_bf16")
#loc12 = loc("model.language_model.layers.13.input_layernorm")
#loc13 = loc("model.language_model.layers.13.linear_attn.in_proj_z_weight")
#loc14 = loc("model.language_model.layers.13.linear_attn.in_proj_z.scales_bf16")
#loc15 = loc("model.language_model.layers.13.linear_attn.in_proj_z_zp")
#loc16 = loc("model.language_model.layers.13.linear_attn.in_proj_z")
#loc17 = loc("model.language_model.layers.13.linear_attn.in_proj_zmodel.language_model.layers.13.linear_attn.in_proj_z.silu_f32")
#loc18 = loc("model.language_model.layers.13.linear_attn.in_proj_a.weight_bf16")
#loc19 = loc("model.language_model.layers.13.linear_attn.in_proj_a.bias_bf16")
#loc20 = loc("model.language_model.layers.13.linear_attn.in_proj_a")
#loc21 = loc("model.language_model.layers.13.linear_attn.in_proj_amodel.language_model.layers.13.linear_attn.in_proj_a.softplus_f32")
#loc22 = loc("model.language_model.layers.13.linear_attn.in_proj_b.weight_bf16")
#loc23 = loc("model.language_model.layers.13.linear_attn.in_proj_b")
#loc24 = loc("model.language_model.layers.13.linear_attn.in_proj_bmodel.language_model.layers.13.linear_attn.in_proj_b.sigmoid_f32")
#loc25 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv_weight")
#loc26 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.scales_bf16")
#loc27 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv_zp")
#loc28 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv")
#loc29 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.reshape")
#loc30 = loc("model.language_model.layers.13.linear_attn.conv1d.concat")
#loc31 = loc("model.language_model.layers.13.linear_attn.conv1d.concat_f32")
#loc32 = loc("model.language_model.layers.13.linear_attn.conv1d.weight_bf16")
#loc33 = loc("model.language_model.layers.13.linear_attn.conv1d.mul")
#loc34 = loc("model.language_model.layers.13.linear_attn.conv1d.reduce_sum")
#loc35 = loc("model.language_model.layers.13.linear_attn.conv1d.reduce_summodel.language_model.layers.13.linear_attn.conv1d.silu_f32")
#loc36 = loc("model.language_model.layers.13.linear_attn.in_proj_b.sigmoid")
#loc37 = loc("model.language_model.layers.13.linear_attn.in_proj_b.sigmoidmodel.language_model.layers.13.recurrent_gated_delta_rule_bf16")
#loc38 = loc("model.language_model.layers.13.linear_attn.in_proj_a.softplus")
#loc39 = loc("model.language_model.layers.13.linear_attn.in_proj_a.softplusmodel.language_model.layers.13.linear_attn.in_proj_a.mul_bf16")
#loc40 = loc("model.language_model.layers.13.linear_attn.A_log.weight_bf16")
#loc41 = loc("model.language_model.layers.13.linear_attn.in_proj_a.mul")
#loc42 = loc("model.language_model.layers.13.linear_attn.conv1d.silu")
#loc43 = loc("model.language_model.layers.13.linear_attn.conv1d.silumodel.language_model.layers.13.linear_attn.in_proj_qkv.q_slice_bf16")
#loc44 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.q_slice")
#loc45 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.k_slice")
#loc46 = loc("model.language_model.layers.13.linear_attn.in_proj_qkv.v_slice")
#loc47 = loc("model.language_model.layers.13.recurrent_gated_delta_rule")
#loc48 = loc("model.language_model.layers.13.linear_attn.norm.weight_bf16")
#loc49 = loc("model.language_model.layers.13.linear_attn.norm")
#loc50 = loc("model.language_model.layers.13..core_attn_reshape")
#loc51 = loc("model.language_model.layers.13.linear_attn.in_proj_z.silu")
#loc52 = loc("model.language_model.layers.13.linear_attn.in_proj_z.silumodel.language_model.layers.13..core_attn_mul_bf16")
#loc53 = loc("model.language_model.layers.13..core_attn_mul")
#loc54 = loc("model.language_model.layers.13.linear_attn.out_proj_weight")
#loc55 = loc("model.language_model.layers.13.linear_attn.out_proj.scales_bf16")
#loc56 = loc("model.language_model.layers.13.linear_attn.out_proj_zp")
#loc57 = loc("model.language_model.layers.13.linear_attn.out_proj")
#loc58 = loc("model.language_model.layers.13.linear_attn.out_proj.add")
#loc59 = loc("model.language_model.layers.13.post_attention_layernorm.weight_bf16")
#loc60 = loc("model.language_model.layers.13.post_attention_layernorm")
#loc61 = loc("model.language_model.layers.13.mlp.gate_proj_weight")
#loc62 = loc("model.language_model.layers.13.mlp.gate_proj.scales_bf16")
#loc63 = loc("model.language_model.layers.13.mlp.gate_proj_zp")
#loc64 = loc("model.language_model.layers.13.mlp.gate_proj")
#loc65 = loc("model.language_model.layers.13.mlp.gate_projmodel.language_model.layers.13.mlp.gate_proj.silu_f32")
#loc66 = loc("model.language_model.layers.13.mlp.gate_proj.silu")
#loc67 = loc("model.language_model.layers.13.mlp.gate_proj.silumodel.language_model.layers.13.mlp.up_proj.mul_bf16")
#loc68 = loc("model.language_model.layers.13.mlp.up_proj_weight")
#loc69 = loc("model.language_model.layers.13.mlp.up_proj.scales_bf16")
#loc70 = loc("model.language_model.layers.13.mlp.up_proj_zp")
#loc71 = loc("model.language_model.layers.13.mlp.up_proj")
#loc72 = loc("model.language_model.layers.13.mlp.up_proj.mul")
#loc73 = loc("model.language_model.layers.13.mlp.down_proj_weight")
#loc74 = loc("model.language_model.layers.13.mlp.down_proj.scales_bf16")
#loc75 = loc("model.language_model.layers.13.mlp.down_proj_zp")
#loc76 = loc("model.language_model.layers.13.mlp.down_proj")
#loc77 = loc("output_states")
#loc78 = loc("output_states_f32")

