#loc = loc(unknown)
module @block_2 attributes {module.FLOPs = 123501428736 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.mode = "W4BF16", module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "block_2_bm1684x_w4bf16_tpu_weights.npz"} {
  func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1024x2048xf32>, tensor<1x6144x4xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xf32> loc(#loc3)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xbf16> loc(#loc4)
    %5 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc5)
    %6 = "tpu.RMSNorm"(%2, %5) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc9)
    %10 = "tpu.A16MatMul"(%6, %7, %8, %9, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xbf16> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc13)
    %14 = "tpu.A16MatMul"(%6, %11, %12, %13, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<2048x1024xui8>, tensor<2048x16xbf16>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xbf16> loc(#loc14)
    %15 = "tpu.Cast"(%14) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xf32> loc(#loc15)
    %16 = "tpu.Active"(%15) {mode = #tpu<active_mode SILU>} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc16)
    %17 = "tpu.Cast"(%16) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc18)
    %19 = "tpu.MatMul"(%6, %18, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1024x2048xbf16>, tensor<2048x16xbf16>, none, none, none) -> tensor<1x1024x16xbf16> loc(#loc19)
    %20 = "tpu.Cast"(%19) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xbf16>) -> tensor<1x1024x16xf32> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<1x1x16xbf16> loc(#loc22)
    %23 = "tpu.MatMul"(%6, %21, %22, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1024x2048xbf16>, tensor<2048x16xbf16>, tensor<1x1x16xbf16>, none, none) -> tensor<1x1024x16xbf16> loc(#loc23)
    %24 = "tpu.Cast"(%23) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xbf16>) -> tensor<1x1024x16xf32> loc(#loc24)
    %25 = "tpu.Permute"(%10, %0) {order = [0, 2, 1]} : (tensor<1x1024x6144xbf16>, none) -> tensor<1x6144x1024xbf16> loc(#loc25)
    %26 = "tpu.Slice"(%25, %0, %0, %0, %0) {axes = [], ends = [1, 6144, 1024], hasparamConvert_axes = [], offset = [0, 0, -4], steps = [1, 1, 1]} : (tensor<1x6144x1024xbf16>, none, none, none, none) -> tensor<1x6144x4xbf16> loc(#loc26)
    %27 = "tpu.Cast"(%26) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144x4xbf16>) -> tensor<1x6144x4xf32> loc(#loc27)
    %28 = "tpu.Reshape"(%25) {flatten_start_dim = -1 : i64, shape = [1, 6144, 1, -1]} : (tensor<1x6144x1024xbf16>) -> tensor<1x6144x1x1024xbf16> loc(#loc28)
    %29 = "top.Weight"() : () -> tensor<6144x1x1x4xbf16> loc(#loc29)
    %30 = "tpu.Conv2D"(%28, %29, %0) {coeff_merged = false, do_relu = false, dynweight_reorderd = false, group = 6144 : i64, kernel_shape = [1, 4], kernel_zp = 0 : i64, pads = [0, 3, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = false} : (tensor<1x6144x1x1024xbf16>, tensor<6144x1x1x4xbf16>, none) -> tensor<1x6144x1x1024xbf16> loc(#loc30)
    %31 = "tpu.Cast"(%30) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144x1x1024xbf16>) -> tensor<1x6144x1x1024xf32> loc(#loc31)
    %32 = "tpu.Active"(%31) {mode = #tpu<active_mode SILU>} : (tensor<1x6144x1x1024xf32>) -> tensor<1x6144x1x1024xf32> loc(#loc32)
    %33 = "tpu.Reshape"(%32) {flatten_start_dim = -1 : i64, shape = [1, 48, 128, -1]} : (tensor<1x6144x1x1024xf32>) -> tensor<1x48x128x1024xf32> loc(#loc33)
    %34 = "tpu.Cast"(%33) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x48x128x1024xf32>) -> tensor<1x48x128x1024xbf16> loc(#loc34)
    %35 = "tpu.Slice"(%34, %0, %0, %0, %0) {axes = [], ends = [1, 16, 128, 1024], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16>, none, none, none, none) -> tensor<1x16x128x1024xbf16> loc(#loc35)
    %36 = "tpu.Slice"(%34, %0, %0, %0, %0) {axes = [], ends = [1, 32, 128, 1024], hasparamConvert_axes = [], offset = [0, 16, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16>, none, none, none, none) -> tensor<1x16x128x1024xbf16> loc(#loc36)
    %37 = "tpu.Slice"(%34, %0, %0, %0, %0) {axes = [], ends = [1, 48, 128, 1024], hasparamConvert_axes = [], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16>, none, none, none, none) -> tensor<1x16x128x1024xbf16> loc(#loc37)
    %38 = "tpu.Permute"(%35, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16>, none) -> tensor<1x1024x16x128xbf16> loc(#loc38)
    %39 = "tpu.Permute"(%36, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16>, none) -> tensor<1x1024x16x128xbf16> loc(#loc39)
    %40 = "tpu.Permute"(%37, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16>, none) -> tensor<1x1024x16x128xbf16> loc(#loc40)
    %41 = "tpu.Active"(%20) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xf32> loc(#loc41)
    %42 = "tpu.Cast"(%41) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xbf16> loc(#loc42)
    %43 = "tpu.Active"(%24) {mode = #tpu<active_mode SOFT_PLUS>} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xf32> loc(#loc43)
    %44 = "tpu.Cast"(%43) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xbf16> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<1x1x16xbf16> loc(#loc45)
    %46 = "tpu.Mul"(%44, %45) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x16xbf16>, tensor<1x1x16xbf16>) -> tensor<1x1024x16xbf16> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<64x64xbf16> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<64x64xbf16> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<64x64xbf16> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<64x64xbf16> loc(#loc50)
    %51 = "tpu.ChunkGatedDeltaRule"(%38, %39, %40, %46, %42, %4, %47, %48, %49, %50) {chunk_size = 64 : i64, d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x1024x16x128xbf16>, tensor<1x1024x16x128xbf16>, tensor<1x1024x16x128xbf16>, tensor<1x1024x16xbf16>, tensor<1x1024x16xbf16>, tensor<1x16x128x128xbf16>, tensor<64x64xbf16>, tensor<64x64xbf16>, tensor<64x64xbf16>, tensor<64x64xbf16>) -> tensor<1x1024x16x128xbf16> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<1x1x1x128xbf16> loc(#loc52)
    %53 = "tpu.RMSNorm"(%51, %52) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x16x128xbf16>, tensor<1x1x1x128xbf16>) -> tensor<1x1024x16x128xbf16> loc(#loc53)
    %54 = "tpu.Reshape"(%53) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x16x128xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc54)
    %55 = "tpu.Mul"(%54, %17) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc58)
    %59 = "tpu.A16MatMul"(%55, %56, %57, %58, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<2048x1024xui8>, tensor<2048x16xbf16>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xbf16> loc(#loc59)
    %60 = "tpu.Add"(%2, %59) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc61)
    %62 = "tpu.RMSNorm"(%60, %61) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc65)
    %66 = "tpu.A16MatMul"(%62, %63, %64, %65, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xbf16> loc(#loc66)
    %67 = "tpu.Cast"(%66) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xf32> loc(#loc67)
    %68 = "tpu.Active"(%67) {mode = #tpu<active_mode SILU>} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc68)
    %69 = "tpu.Cast"(%68) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xbf16> loc(#loc69)
    %70 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc72)
    %73 = "tpu.A16MatMul"(%62, %70, %71, %72, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xbf16> loc(#loc73)
    %74 = "tpu.Mul"(%69, %73) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x6144xbf16>, tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xbf16> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc75)
    %76 = "top.Weight"() : () -> tensor<2048x48xbf16> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc77)
    %78 = "tpu.A16MatMul"(%74, %75, %76, %77, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xbf16>, tensor<2048x3072xui8>, tensor<2048x48xbf16>, tensor<2048x48xui8>, none) -> tensor<1x1024x2048xbf16> loc(#loc78)
    %79 = "tpu.Add"(%60, %78) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc79)
    %80 = "tpu.Cast"(%79) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xf32> loc(#loc80)
    return %80, %27 : tensor<1x1024x2048xf32>, tensor<1x6144x4xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("input_statesmodel.language_model.layers.2.input_layernorm_bf16")
#loc3 = loc("recurrent_states")
#loc4 = loc("recurrent_statesmodel.language_model.layers.2.chunk_gated_delta_rule_bf16")
#loc5 = loc("model.language_model.layers.2.input_layernorm.weight_bf16")
#loc6 = loc("model.language_model.layers.2.input_layernorm")
#loc7 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv_weight")
#loc8 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.scales_bf16")
#loc9 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv_zp")
#loc10 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv")
#loc11 = loc("model.language_model.layers.2.linear_attn.in_proj_z_weight")
#loc12 = loc("model.language_model.layers.2.linear_attn.in_proj_z.scales_bf16")
#loc13 = loc("model.language_model.layers.2.linear_attn.in_proj_z_zp")
#loc14 = loc("model.language_model.layers.2.linear_attn.in_proj_z")
#loc15 = loc("model.language_model.layers.2.linear_attn.in_proj_zmodel.language_model.layers.2.linear_attn.in_proj_z.silu_f32")
#loc16 = loc("model.language_model.layers.2.linear_attn.in_proj_z.silu")
#loc17 = loc("model.language_model.layers.2.linear_attn.in_proj_z.silumodel.language_model.layers.2.linear_attn.in_proj_z.core_attn_mul_bf16")
#loc18 = loc("model.language_model.layers.2.linear_attn.in_proj_b.weight_bf16")
#loc19 = loc("model.language_model.layers.2.linear_attn.in_proj_b")
#loc20 = loc("model.language_model.layers.2.linear_attn.in_proj_bmodel.language_model.layers.2.linear_attn.in_proj_b.sigmoid_f32")
#loc21 = loc("model.language_model.layers.2.linear_attn.in_proj_a.weight_bf16")
#loc22 = loc("model.language_model.layers.2.linear_attn.in_proj_a.bias_bf16")
#loc23 = loc("model.language_model.layers.2.linear_attn.in_proj_a")
#loc24 = loc("model.language_model.layers.2.linear_attn.in_proj_amodel.language_model.layers.2.linear_attn.in_proj_a.softplus_f32")
#loc25 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.permute")
#loc26 = loc("conv_states")
#loc27 = loc("conv_states_f32")
#loc28 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.reshape_to_conv2d")
#loc29 = loc("model.language_model.layers.2.linear_attn.conv1d.weight_bf16")
#loc30 = loc("model.language_model.layers.2.linear_attn.conv1d")
#loc31 = loc("model.language_model.layers.2.linear_attn.conv1dmodel.language_model.layers.2.linear_attn.conv1d.silu_f32")
#loc32 = loc("model.language_model.layers.2.linear_attn.conv1d.silu")
#loc33 = loc("model.language_model.layers.2.linear_attn.conv1d.reshape_after_conv")
#loc34 = loc("model.language_model.layers.2.linear_attn.conv1d.reshape_after_convmodel.language_model.layers.2.linear_attn.in_proj_qkv.q_slice_after_conv_bf16")
#loc35 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.q_slice_after_conv")
#loc36 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.k_slice_after_conv")
#loc37 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.v_slice_after_conv")
#loc38 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.q_permute_after_conv")
#loc39 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.k_permute_after_conv")
#loc40 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.v_permute_after_conv")
#loc41 = loc("model.language_model.layers.2.linear_attn.in_proj_b.sigmoid")
#loc42 = loc("model.language_model.layers.2.linear_attn.in_proj_b.sigmoidmodel.language_model.layers.2.chunk_gated_delta_rule_bf16")
#loc43 = loc("model.language_model.layers.2.linear_attn.in_proj_a.softplus")
#loc44 = loc("model.language_model.layers.2.linear_attn.in_proj_a.softplusmodel.language_model.layers.2.linear_attn.in_proj_a.mul_bf16")
#loc45 = loc("model.language_model.layers.2.linear_attn.A_log.weight_bf16")
#loc46 = loc("model.language_model.layers.2.linear_attn.in_proj_a.mul")
#loc47 = loc("model.language_model.layers.2.linear_attn.triu_mask_bf16")
#loc48 = loc("model.language_model.layers.2.linear_attn.strict_triu_mask_bf16")
#loc49 = loc("model.language_model.layers.2.linear_attn.tril_mask_bf16")
#loc50 = loc("model.language_model.layers.2.linear_attn.eye_bf16")
#loc51 = loc("model.language_model.layers.2.chunk_gated_delta_rule")
#loc52 = loc("model.language_model.layers.2.linear_attn.norm.weight_bf16")
#loc53 = loc("model.language_model.layers.2.linear_attn.norm")
#loc54 = loc("model.language_model.layers.2.linear_attn.in_proj_qkv.core_attn_reshape")
#loc55 = loc("model.language_model.layers.2.linear_attn.in_proj_z.core_attn_mul")
#loc56 = loc("model.language_model.layers.2.linear_attn.out_proj_weight")
#loc57 = loc("model.language_model.layers.2.linear_attn.out_proj.scales_bf16")
#loc58 = loc("model.language_model.layers.2.linear_attn.out_proj_zp")
#loc59 = loc("model.language_model.layers.2.linear_attn.out_proj")
#loc60 = loc("model.language_model.layers.2.linear_attn.out_proj.add")
#loc61 = loc("model.language_model.layers.2.post_attention_layernorm.weight_bf16")
#loc62 = loc("model.language_model.layers.2.post_attention_layernorm")
#loc63 = loc("model.language_model.layers.2.mlp.gate_proj_weight")
#loc64 = loc("model.language_model.layers.2.mlp.gate_proj.scales_bf16")
#loc65 = loc("model.language_model.layers.2.mlp.gate_proj_zp")
#loc66 = loc("model.language_model.layers.2.mlp.gate_proj")
#loc67 = loc("model.language_model.layers.2.mlp.gate_projmodel.language_model.layers.2.mlp.gate_proj.silu_f32")
#loc68 = loc("model.language_model.layers.2.mlp.gate_proj.silu")
#loc69 = loc("model.language_model.layers.2.mlp.gate_proj.silumodel.language_model.layers.2.mlp.up_proj.mul_bf16")
#loc70 = loc("model.language_model.layers.2.mlp.up_proj_weight")
#loc71 = loc("model.language_model.layers.2.mlp.up_proj.scales_bf16")
#loc72 = loc("model.language_model.layers.2.mlp.up_proj_zp")
#loc73 = loc("model.language_model.layers.2.mlp.up_proj")
#loc74 = loc("model.language_model.layers.2.mlp.up_proj.mul")
#loc75 = loc("model.language_model.layers.2.mlp.down_proj_weight")
#loc76 = loc("model.language_model.layers.2.mlp.down_proj.scales_bf16")
#loc77 = loc("model.language_model.layers.2.mlp.down_proj_zp")
#loc78 = loc("model.language_model.layers.2.mlp.down_proj")
#loc79 = loc("output_states")
#loc80 = loc("output_states_f32")

