#loc = loc(unknown)
module @block_7 attributes {module.FLOPs = 116039614464 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "ada300", module.coeff_addr = 0 : i64, module.coeff_size = 27715072 : i64, module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.neuron_addr = 0 : i64, module.neuron_size = 184467456 : i64, module.platform = "LLM_QUANTIZED", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "block_7_tpu_addressed_ada300_f16_weight.npz", tpu.gmem_bytes = 536870912 : i64, tpu.sram_bank_bytes = 262144 : i64, tpu.sram_bank_count = 5 : i64, tpu.target = "ada300", tpu.weight_memory_bytes = 268435456 : i64} {
  func.func @main(%arg0: tensor<1x1024x2048xf32, 0 : i64> loc(unknown), %arg1: tensor<3x1024xsi32, 8388608 : i64> loc(unknown), %arg2: tensor<1x1x1024x1024xf32, 8400896 : i64> loc(unknown)) -> (tensor<1x1024x2048xf32, 176078848 : i64>, tensor<1x1024x2x256xf32, 90095616 : i64>, tensor<1x1024x2x256xf32, 69255168 : i64>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32, 0 : i64>) -> tensor<1x1024x2048xf32, 12595200 : i64> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32, 12595200 : i64>) -> tensor<1x1024x2048xf16, 20983808 : i64> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1024xsi32, 8388608 : i64>) -> tensor<3x1024xsi32, 25178112 : i64> loc(#loc3)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<3x1024xsi32, 25178112 : i64>) -> tensor<3x1024xf32, 25190400 : i64> loc(#loc4)
    %5 = "tpu.Cast"(%4) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<3x1024xf32, 25190400 : i64>) -> tensor<3x1024xi32, 25202688 : i64> loc(#loc5)
    %6 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1024x1024xf32, 8400896 : i64>) -> tensor<1x1x1024x1024xf32, 25214976 : i64> loc(#loc6)
    %7 = "tpu.Cast"(%6) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x1024x1024xf32, 25214976 : i64>) -> tensor<1x1x1024x1024xf16, 29409280 : i64> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<1x1x2048xf16, 0 : i64> loc(#loc8)
    %9 = "tpu.RMSNorm"(%2, %8) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf16, 20983808 : i64>, tensor<1x1x2048xf16, 0 : i64>) -> tensor<1x1024x2048xf16, 31506432 : i64> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<4096x1024xui8, 4096 : i64> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<4096x16xui8, 4198400 : i64> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<4096x16xf16, 4263936 : i64> loc(#loc12)
    %13 = "tpu.A16MatMul"(%9, %10, %12, %11, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 31506432 : i64>, tensor<4096x1024xui8, 4096 : i64>, tensor<4096x16xf16, 4263936 : i64>, tensor<4096x16xui8, 4198400 : i64>, none) -> tensor<1x1024x4096xf16, 35700736 : i64> loc(#loc13)
    %14 = "tpu.Reshape"(%13) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1024x4096xf16, 35700736 : i64>) -> tensor<1x1024x8x512xf16, 44089344 : i64> loc(#loc14)
    %15 = "tpu.Slice"(%14, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xf16, 44089344 : i64>, none, none, none, none) -> tensor<1x1024x8x256xf16, 52477952 : i64> loc(#loc15)
    %16 = "tpu.Slice"(%14, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 512], hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xf16, 44089344 : i64>, none, none, none, none) -> tensor<1x1024x8x256xf16, 56672256 : i64> loc(#loc16)
    %17 = "tpu.Active"(%16) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1024x8x256xf16, 56672256 : i64>) -> tensor<1x1024x8x256xf16, 60866560 : i64> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<512x1024xui8, 4395008 : i64> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<512x16xui8, 4919296 : i64> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<512x16xf16, 4927488 : i64> loc(#loc20)
    %21 = "tpu.A16MatMul"(%9, %18, %20, %19, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 31506432 : i64>, tensor<512x1024xui8, 4395008 : i64>, tensor<512x16xf16, 4927488 : i64>, tensor<512x16xui8, 4919296 : i64>, none) -> tensor<1x1024x512xf16, 65060864 : i64> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<512x1024xui8, 4943872 : i64> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<512x16xui8, 5468160 : i64> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<512x16xf16, 5476352 : i64> loc(#loc24)
    %25 = "tpu.A16MatMul"(%9, %22, %24, %23, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 31506432 : i64>, tensor<512x1024xui8, 4943872 : i64>, tensor<512x16xf16, 5476352 : i64>, tensor<512x16xui8, 5468160 : i64>, none) -> tensor<1x1024x512xf16, 66109440 : i64> loc(#loc25)
    %26 = "tpu.Reshape"(%21) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xf16, 65060864 : i64>) -> tensor<1x1024x2x256xf16, 67158016 : i64> loc(#loc26)
    %27 = "tpu.Reshape"(%25) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xf16, 66109440 : i64>) -> tensor<1x1024x2x256xf16, 68206592 : i64> loc(#loc27)
    %28 = "tpu.Cast"(%27) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2x256xf16, 68206592 : i64>) -> tensor<1x1024x2x256xf32, 69255168 : i64> loc(#loc28)
    %29 = "top.Weight"() : () -> tensor<1x1x1x256xf16, 5492736 : i64> loc(#loc29)
    %30 = "tpu.RMSNorm"(%15, %29) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x8x256xf16, 52477952 : i64>, tensor<1x1x1x256xf16, 5492736 : i64>) -> tensor<1x1024x8x256xf16, 71352320 : i64> loc(#loc30)
    %31 = "top.Weight"() : () -> tensor<1x1x1x256xf16, 5493248 : i64> loc(#loc31)
    %32 = "tpu.RMSNorm"(%26, %31) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2x256xf16, 67158016 : i64>, tensor<1x1x1x256xf16, 5493248 : i64>) -> tensor<1x1024x2x256xf16, 75546624 : i64> loc(#loc32)
    %33 = "top.Weight"() : () -> tensor<2048x1x32xf16, 5493760 : i64> loc(#loc33)
    %34 = "tpu.Gather"(%33, %5, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf16, 5493760 : i64>, tensor<3x1024xi32, 25202688 : i64>, none) -> tensor<3x1024x1x32xf16, 76595200 : i64> loc(#loc34)
    %35 = "tpu.Permute"(%34, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xf16, 76595200 : i64>, none) -> tensor<3x32x1x1024xf16, 76791808 : i64> loc(#loc35)
    %36 = "tpu.Reshape"(%35) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xf16, 76791808 : i64>) -> tensor<96x1x1024xf16, 76988416 : i64> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<1x64xi32, 5624832 : i64> loc(#loc37)
    %38 = "tpu.Gather"(%36, %37, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xf16, 76988416 : i64>, tensor<1x64xi32, 5624832 : i64>, none) -> tensor<1x64x1x1024xf16, 77185024 : i64> loc(#loc38)
    %39 = "tpu.Permute"(%38, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xf16, 77185024 : i64>, none) -> tensor<1x1024x1x64xf16, 77316096 : i64> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<2048x1x32xf16, 5625088 : i64> loc(#loc40)
    %41 = "tpu.Gather"(%40, %5, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf16, 5625088 : i64>, tensor<3x1024xi32, 25202688 : i64>, none) -> tensor<3x1024x1x32xf16, 77447168 : i64> loc(#loc41)
    %42 = "tpu.Permute"(%41, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xf16, 77447168 : i64>, none) -> tensor<3x32x1x1024xf16, 77643776 : i64> loc(#loc42)
    %43 = "tpu.Reshape"(%42) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xf16, 77643776 : i64>) -> tensor<96x1x1024xf16, 77840384 : i64> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<1x64xi32, 5756160 : i64> loc(#loc44)
    %45 = "tpu.Gather"(%43, %44, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xf16, 77840384 : i64>, tensor<1x64xi32, 5756160 : i64>, none) -> tensor<1x64x1x1024xf16, 78036992 : i64> loc(#loc45)
    %46 = "tpu.Permute"(%45, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xf16, 78036992 : i64>, none) -> tensor<1x1024x1x64xf16, 78168064 : i64> loc(#loc46)
    %47 = "tpu.Slice"(%30, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xf16, 71352320 : i64>, none, none, none, none) -> tensor<1x1024x8x64xf16, 78299136 : i64> loc(#loc47)
    %48 = "tpu.Slice"(%30, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xf16, 71352320 : i64>, none, none, none, none) -> tensor<1x1024x8x192xf16, 79347712 : i64> loc(#loc48)
    %49 = "tpu.Rope"(%47, %46, %39) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, freq_base = 1.000000e+04 : f64, freq_scale = 1.000000e+00 : f64, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, n_dims = 0 : si32, operand_segment_sizes = array<i32: 1, 1, 1, 0, 0>, rope_mode = #tpu<rope_mode contiguous_halves>, use_rope_cache = false, xpos_base = 0.000000e+00 : f64, xpos_down = 0 : si32} : (tensor<1x1024x8x64xf16, 78299136 : i64>, tensor<1x1024x1x64xf16, 78168064 : i64>, tensor<1x1024x1x64xf16, 77316096 : i64>) -> tensor<1x1024x8x64xf16, 82493440 : i64> loc(#loc49)
    %50 = "tpu.Concat"(%49, %48) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x8x64xf16, 82493440 : i64>, tensor<1x1024x8x192xf16, 79347712 : i64>) -> tensor<1x1024x8x256xf16, 83542016 : i64> loc(#loc50)
    %51 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xf16, 75546624 : i64>, none, none, none, none) -> tensor<1x1024x2x64xf16, 87736320 : i64> loc(#loc51)
    %52 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xf16, 75546624 : i64>, none, none, none, none) -> tensor<1x1024x2x192xf16, 87998464 : i64> loc(#loc52)
    %53 = "tpu.Rope"(%51, %46, %39) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, freq_base = 1.000000e+04 : f64, freq_scale = 1.000000e+00 : f64, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, n_dims = 0 : si32, operand_segment_sizes = array<i32: 1, 1, 1, 0, 0>, rope_mode = #tpu<rope_mode contiguous_halves>, use_rope_cache = false, xpos_base = 0.000000e+00 : f64, xpos_down = 0 : si32} : (tensor<1x1024x2x64xf16, 87736320 : i64>, tensor<1x1024x1x64xf16, 78168064 : i64>, tensor<1x1024x1x64xf16, 77316096 : i64>) -> tensor<1x1024x2x64xf16, 88784896 : i64> loc(#loc53)
    %54 = "tpu.Concat"(%53, %52) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2x64xf16, 88784896 : i64>, tensor<1x1024x2x192xf16, 87998464 : i64>) -> tensor<1x1024x2x256xf16, 89047040 : i64> loc(#loc54)
    %55 = "tpu.Cast"(%54) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2x256xf16, 89047040 : i64>) -> tensor<1x1024x2x256xf32, 90095616 : i64> loc(#loc55)
    %56 = "tpu.FAttention"(%50, %54, %27, %7, %0) {batch = 1 : i64, block_size = 0 : i64, causal = true, dim = 256 : i64, has_mask = false, keep_dims = false, kv_cache_mode = #tpu<kv_cache_mode paged>, kv_head = 2 : i64, max_blocks_per_seq = 0 : i64, mk = 1024 : i64, mq = 1024 : i64, operand_segment_sizes = array<i32: 1, 1, 1, 1, 1, 0, 0, 0, 0>, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1024x8x256xf16, 83542016 : i64>, tensor<1x1024x2x256xf16, 89047040 : i64>, tensor<1x1024x2x256xf16, 68206592 : i64>, tensor<1x1x1024x1024xf16, 29409280 : i64>, none) -> tensor<1x1024x2048xf16, 92192768 : i64> loc(#loc56)
    %57 = "tpu.Reshape"(%17) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x8x256xf16, 60866560 : i64>) -> tensor<1x1024x2048xf16, 96387072 : i64> loc(#loc57)
    %58 = "tpu.Mul"(%56, %57) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x2048xf16, 92192768 : i64>, tensor<1x1024x2048xf16, 96387072 : i64>) -> tensor<1x1024x2048xf16, 100581376 : i64> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<2048x1024xui8, 5756416 : i64> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<2048x16xui8, 7853568 : i64> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<2048x16xf16, 7886336 : i64> loc(#loc61)
    %62 = "tpu.A16MatMul"(%58, %59, %61, %60, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 100581376 : i64>, tensor<2048x1024xui8, 5756416 : i64>, tensor<2048x16xf16, 7886336 : i64>, tensor<2048x16xui8, 7853568 : i64>, none) -> tensor<1x1024x2048xf16, 104775680 : i64> loc(#loc62)
    %63 = "tpu.Add"(%2, %62) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf16, 20983808 : i64>, tensor<1x1024x2048xf16, 104775680 : i64>) -> tensor<1x1024x2048xf16, 108969984 : i64> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<1x1x2048xf16, 7951872 : i64> loc(#loc64)
    %65 = "tpu.RMSNorm"(%63, %64) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf16, 108969984 : i64>, tensor<1x1x2048xf16, 7951872 : i64>) -> tensor<1x1024x2048xf16, 113164288 : i64> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<6144x1024xui8, 7955968 : i64> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<6144x16xui8, 14247424 : i64> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<6144x16xf16, 14345728 : i64> loc(#loc68)
    %69 = "tpu.A16MatMul"(%65, %66, %68, %67, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 113164288 : i64>, tensor<6144x1024xui8, 7955968 : i64>, tensor<6144x16xf16, 14345728 : i64>, tensor<6144x16xui8, 14247424 : i64>, none) -> tensor<1x1024x6144xf16, 117358592 : i64> loc(#loc69)
    %70 = "tpu.Active"(%69) {mode = #tpu<active_mode SILU>} : (tensor<1x1024x6144xf16, 117358592 : i64>) -> tensor<1x1024x6144xf16, 129941504 : i64> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<6144x1024xui8, 14542336 : i64> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<6144x16xui8, 20833792 : i64> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<6144x16xf16, 20932096 : i64> loc(#loc73)
    %74 = "tpu.A16MatMul"(%65, %71, %73, %72, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x2048xf16, 113164288 : i64>, tensor<6144x1024xui8, 14542336 : i64>, tensor<6144x16xf16, 20932096 : i64>, tensor<6144x16xui8, 20833792 : i64>, none) -> tensor<1x1024x6144xf16, 142524416 : i64> loc(#loc74)
    %75 = "tpu.Mul"(%70, %74) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x6144xf16, 129941504 : i64>, tensor<1x1024x6144xf16, 142524416 : i64>) -> tensor<1x1024x6144xf16, 155107328 : i64> loc(#loc75)
    %76 = "top.Weight"() : () -> tensor<2048x3072xui8, 21128704 : i64> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<2048x48xui8, 27420160 : i64> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<2048x48xf16, 27518464 : i64> loc(#loc78)
    %79 = "tpu.A16MatMul"(%75, %76, %78, %77, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1024x6144xf16, 155107328 : i64>, tensor<2048x3072xui8, 21128704 : i64>, tensor<2048x48xf16, 27518464 : i64>, tensor<2048x48xui8, 27420160 : i64>, none) -> tensor<1x1024x2048xf16, 167690240 : i64> loc(#loc79)
    %80 = "tpu.Add"(%63, %79) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf16, 108969984 : i64>, tensor<1x1024x2048xf16, 167690240 : i64>) -> tensor<1x1024x2048xf16, 171884544 : i64> loc(#loc80)
    %81 = "tpu.Cast"(%80) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf16, 171884544 : i64>) -> tensor<1x1024x2048xf32, 176078848 : i64> loc(#loc81)
    return %81, %55, %28 : tensor<1x1024x2048xf32, 176078848 : i64>, tensor<1x1024x2x256xf32, 90095616 : i64>, tensor<1x1024x2x256xf32, 69255168 : i64> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("input_statesmodel.language_model.layers.7.input_layernorm_f16")
#loc3 = loc("position_ids")
#loc4 = loc("position_ids_f32")
#loc5 = loc("position_ids_f32rotary_cos_si32")
#loc6 = loc("attention_mask")
#loc7 = loc("attention_maskmodel.language_model.layers.7.fattention_f16")
#loc8 = loc("model.language_model.layers.7.input_layernorm.weight_f16")
#loc9 = loc("model.language_model.layers.7.input_layernorm")
#loc10 = loc("model.language_model.layers.7.self_attn.q_proj.qweight")
#loc11 = loc("model.language_model.layers.7.self_attn.q_proj.qzeros")
#loc12 = loc("model.language_model.layers.7.self_attn.q_proj.scales_f16")
#loc13 = loc("model.language_model.layers.7.self_attn.q_proj")
#loc14 = loc("model.language_model.layers.7.self_attn.q_proj.reshape")
#loc15 = loc("model.language_model.layers.7.self_attn.q_proj.q_slice")
#loc16 = loc("model.language_model.layers.7.self_attn.q_proj.gate_slice")
#loc17 = loc("model.language_model.layers.7.mlp.gate_proj.gate_sigmoid")
#loc18 = loc("model.language_model.layers.7.self_attn.k_proj.qweight")
#loc19 = loc("model.language_model.layers.7.self_attn.k_proj.qzeros")
#loc20 = loc("model.language_model.layers.7.self_attn.k_proj.scales_f16")
#loc21 = loc("model.language_model.layers.7.self_attn.k_proj")
#loc22 = loc("model.language_model.layers.7.self_attn.v_proj.qweight")
#loc23 = loc("model.language_model.layers.7.self_attn.v_proj.qzeros")
#loc24 = loc("model.language_model.layers.7.self_attn.v_proj.scales_f16")
#loc25 = loc("model.language_model.layers.7.self_attn.v_proj")
#loc26 = loc("model.language_model.layers.7.self_attn.k_proj.reshape")
#loc27 = loc("v_cache")
#loc28 = loc("v_cache_f32")
#loc29 = loc("model.language_model.layers.7.self_attn.q_norm.weight_f16")
#loc30 = loc("model.language_model.layers.7.self_attn.q_norm")
#loc31 = loc("model.language_model.layers.7.self_attn.k_norm.weight_f16")
#loc32 = loc("model.language_model.layers.7.self_attn.k_norm")
#loc33 = loc("rotary_cos.weight_f16")
#loc34 = loc("rotary_cos")
#loc35 = loc("rotary_cos.permute")
#loc36 = loc("rotary_cos.reshape")
#loc37 = loc("mrope_interleave_idx_int")
#loc38 = loc("rotary_cos.gather")
#loc39 = loc("rotary_cos.permute2")
#loc40 = loc("rotary_sin.weight_f16")
#loc41 = loc("rotary_sin")
#loc42 = loc("rotary_sin.permute")
#loc43 = loc("rotary_sin.reshape")
#loc44 = loc("rotary_sin.gathermrope_interleave_idx_int")
#loc45 = loc("rotary_sin.gather")
#loc46 = loc("rotary_sin.permute2")
#loc47 = loc("q_proj.slice")
#loc48 = loc("q_proj.slice2")
#loc49 = loc("q_proj.rope")
#loc50 = loc("q_proj")
#loc51 = loc("k_proj.slice")
#loc52 = loc("k_proj.slice2")
#loc53 = loc("k_proj.rope")
#loc54 = loc("k_cache")
#loc55 = loc("k_cache_f32")
#loc56 = loc("model.language_model.layers.7.fattention")
#loc57 = loc("model.language_model.layers.7.mlp.gate_proj.gate_reshape")
#loc58 = loc("model.language_model.layers.7.mlp.gate_proj.gate_mul")
#loc59 = loc("model.language_model.layers.7.self_attn.o_proj.qweight")
#loc60 = loc("model.language_model.layers.7.self_attn.o_proj.qzeros")
#loc61 = loc("model.language_model.layers.7.self_attn.o_proj.scales_f16")
#loc62 = loc("model.language_model.layers.7.self_attn.o_proj")
#loc63 = loc("model.language_model.layers.7.self_attn.o_proj.add")
#loc64 = loc("model.language_model.layers.7.post_attention_layernorm.weight_f16")
#loc65 = loc("model.language_model.layers.7.post_attention_layernorm")
#loc66 = loc("model.language_model.layers.7.mlp.gate_proj.qweight")
#loc67 = loc("model.language_model.layers.7.mlp.gate_proj.qzeros")
#loc68 = loc("model.language_model.layers.7.mlp.gate_proj.scales_f16")
#loc69 = loc("model.language_model.layers.7.mlp.gate_proj")
#loc70 = loc("model.language_model.layers.7.mlp.gate_proj.silu")
#loc71 = loc("model.language_model.layers.7.mlp.up_proj.qweight")
#loc72 = loc("model.language_model.layers.7.mlp.up_proj.qzeros")
#loc73 = loc("model.language_model.layers.7.mlp.up_proj.scales_f16")
#loc74 = loc("model.language_model.layers.7.mlp.up_proj")
#loc75 = loc("model.language_model.layers.7.mlp.up_proj.mul")
#loc76 = loc("model.language_model.layers.7.mlp.down_proj.qweight")
#loc77 = loc("model.language_model.layers.7.mlp.down_proj.qzeros")
#loc78 = loc("model.language_model.layers.7.mlp.down_proj.scales_f16")
#loc79 = loc("model.language_model.layers.7.mlp.down_proj")
#loc80 = loc("output_states")
#loc81 = loc("output_states_f32")

