#loc = loc(unknown)
module @block_cache_7 attributes {module.FLOPs = 121716736 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "ada300", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.platform = "LLM_QUANTIZED", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "block_cache_7_tpu_lowered_ada300_f16_weight.npz", tpu.gmem_bytes = 536870912 : i64, tpu.sram_bank_bytes = 262144 : i64, tpu.sram_bank_count = 5 : i64, tpu.target = "ada300", tpu.weight_memory_bytes = 268435456 : i64} {
  func.func @main(%arg0: tensor<1x1x2048xf32> loc(unknown), %arg1: tensor<3x1xsi32> loc(unknown), %arg2: tensor<1x1x1x2049xf32> loc(unknown), %arg3: tensor<1x2048x2x256xf32> loc(unknown), %arg4: tensor<1x2048x2x256xf32> loc(unknown)) -> (tensor<1x1x2048xf32>, tensor<1x1x2x256xf32>, tensor<1x1x2x256xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf16> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1xsi32>) -> tensor<3x1xsi32> loc(#loc3)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<3x1xsi32>) -> tensor<3x1xf32> loc(#loc4)
    %5 = "tpu.Cast"(%4) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<3x1xf32>) -> tensor<3x1xi32> loc(#loc5)
    %6 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1x2049xf32>) -> tensor<1x1x1x2049xf32> loc(#loc6)
    %7 = "tpu.Cast"(%6) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x1x2049xf32>) -> tensor<1x1x1x2049xf16> loc(#loc7)
    %8 = "top.Input"(%arg3) {do_preprocess = false} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xf32> loc(#loc8)
    %9 = "tpu.Cast"(%8) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xf16> loc(#loc9)
    %10 = "top.Input"(%arg4) {do_preprocess = false} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xf32> loc(#loc10)
    %11 = "tpu.Cast"(%10) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xf16> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<1x1x2048xf16> loc(#loc12)
    %13 = "tpu.RMSNorm"(%2, %12) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xf16>, tensor<1x1x2048xf16>) -> tensor<1x1x2048xf16> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<4096x1024xui8> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<4096x16xui8> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<4096x16xf16> loc(#loc16)
    %17 = "tpu.A16MatMul"(%13, %14, %16, %15, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<4096x1024xui8>, tensor<4096x16xf16>, tensor<4096x16xui8>, none) -> tensor<1x1x4096xf16> loc(#loc17)
    %18 = "tpu.Reshape"(%17) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1x4096xf16>) -> tensor<1x1x8x512xf16> loc(#loc18)
    %19 = "tpu.Slice"(%18, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x8x512xf16>, none, none, none, none) -> tensor<1x1x8x256xf16> loc(#loc19)
    %20 = "tpu.Slice"(%18, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 512], hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1x8x512xf16>, none, none, none, none) -> tensor<1x1x8x256xf16> loc(#loc20)
    %21 = "tpu.Active"(%20) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1x8x256xf16>) -> tensor<1x1x8x256xf16> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<512x16xf16> loc(#loc24)
    %25 = "tpu.A16MatMul"(%13, %22, %24, %23, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<512x1024xui8>, tensor<512x16xf16>, tensor<512x16xui8>, none) -> tensor<1x1x512xf16> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<512x16xf16> loc(#loc28)
    %29 = "tpu.A16MatMul"(%13, %26, %28, %27, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<512x1024xui8>, tensor<512x16xf16>, tensor<512x16xui8>, none) -> tensor<1x1x512xf16> loc(#loc29)
    %30 = "tpu.Reshape"(%25) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x512xf16>) -> tensor<1x1x2x256xf16> loc(#loc30)
    %31 = "tpu.Reshape"(%29) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x512xf16>) -> tensor<1x1x2x256xf16> loc(#loc31)
    %32 = "tpu.Cast"(%31) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2x256xf16>) -> tensor<1x1x2x256xf32> loc(#loc32)
    %33 = "top.Weight"() : () -> tensor<1x1x1x256xf16> loc(#loc33)
    %34 = "tpu.RMSNorm"(%19, %33) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x8x256xf16>, tensor<1x1x1x256xf16>) -> tensor<1x1x8x256xf16> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<1x1x1x256xf16> loc(#loc35)
    %36 = "tpu.RMSNorm"(%30, %35) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2x256xf16>, tensor<1x1x1x256xf16>) -> tensor<1x1x2x256xf16> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<2048x1x32xf16> loc(#loc37)
    %38 = "tpu.Gather"(%37, %5, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf16>, tensor<3x1xi32>, none) -> tensor<3x1x1x32xf16> loc(#loc38)
    %39 = "tpu.Permute"(%38, %0) {order = [0, 3, 2, 1]} : (tensor<3x1x1x32xf16>, none) -> tensor<3x32x1x1xf16> loc(#loc39)
    %40 = "tpu.Reshape"(%39) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1xf16>) -> tensor<96x1x1xf16> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<1x64xi32> loc(#loc41)
    %42 = "tpu.Gather"(%40, %41, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1xf16>, tensor<1x64xi32>, none) -> tensor<1x64x1x1xf16> loc(#loc42)
    %43 = "tpu.Permute"(%42, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1xf16>, none) -> tensor<1x1x1x64xf16> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<2048x1x32xf16> loc(#loc44)
    %45 = "tpu.Gather"(%44, %5, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf16>, tensor<3x1xi32>, none) -> tensor<3x1x1x32xf16> loc(#loc45)
    %46 = "tpu.Permute"(%45, %0) {order = [0, 3, 2, 1]} : (tensor<3x1x1x32xf16>, none) -> tensor<3x32x1x1xf16> loc(#loc46)
    %47 = "tpu.Reshape"(%46) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1xf16>) -> tensor<96x1x1xf16> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<1x64xi32> loc(#loc48)
    %49 = "tpu.Gather"(%47, %48, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1xf16>, tensor<1x64xi32>, none) -> tensor<1x64x1x1xf16> loc(#loc49)
    %50 = "tpu.Permute"(%49, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1xf16>, none) -> tensor<1x1x1x64xf16> loc(#loc50)
    %51 = "tpu.Slice"(%34, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x8x256xf16>, none, none, none, none) -> tensor<1x1x8x64xf16> loc(#loc51)
    %52 = "tpu.Slice"(%34, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1x8x256xf16>, none, none, none, none) -> tensor<1x1x8x192xf16> loc(#loc52)
    %53 = "tpu.Rope"(%51, %50, %43) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, freq_base = 1.000000e+04 : f64, freq_scale = 1.000000e+00 : f64, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, n_dims = 0 : si32, operand_segment_sizes = array<i32: 1, 1, 1, 0, 0>, rope_mode = #tpu<rope_mode contiguous_halves>, use_rope_cache = false, xpos_base = 0.000000e+00 : f64, xpos_down = 0 : si32} : (tensor<1x1x8x64xf16>, tensor<1x1x1x64xf16>, tensor<1x1x1x64xf16>) -> tensor<1x1x8x64xf16> loc(#loc53)
    %54 = "tpu.Concat"(%53, %52) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x8x64xf16>, tensor<1x1x8x192xf16>) -> tensor<1x1x8x256xf16> loc(#loc54)
    %55 = "tpu.Slice"(%36, %0, %0, %0, %0) {axes = [], ends = [1, 1, 2, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x2x256xf16>, none, none, none, none) -> tensor<1x1x2x64xf16> loc(#loc55)
    %56 = "tpu.Slice"(%36, %0, %0, %0, %0) {axes = [], ends = [1, 1, 2, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1x2x256xf16>, none, none, none, none) -> tensor<1x1x2x192xf16> loc(#loc56)
    %57 = "tpu.Rope"(%55, %50, %43) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, freq_base = 1.000000e+04 : f64, freq_scale = 1.000000e+00 : f64, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, n_dims = 0 : si32, operand_segment_sizes = array<i32: 1, 1, 1, 0, 0>, rope_mode = #tpu<rope_mode contiguous_halves>, use_rope_cache = false, xpos_base = 0.000000e+00 : f64, xpos_down = 0 : si32} : (tensor<1x1x2x64xf16>, tensor<1x1x1x64xf16>, tensor<1x1x1x64xf16>) -> tensor<1x1x2x64xf16> loc(#loc57)
    %58 = "tpu.Concat"(%57, %56) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2x64xf16>, tensor<1x1x2x192xf16>) -> tensor<1x1x2x256xf16> loc(#loc58)
    %59 = "tpu.Cast"(%58) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2x256xf16>) -> tensor<1x1x2x256xf32> loc(#loc59)
    %60 = "tpu.Concat"(%9, %58) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x2048x2x256xf16>, tensor<1x1x2x256xf16>) -> tensor<1x2049x2x256xf16> loc(#loc60)
    %61 = "tpu.Concat"(%11, %31) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x2048x2x256xf16>, tensor<1x1x2x256xf16>) -> tensor<1x2049x2x256xf16> loc(#loc61)
    %62 = "tpu.FAttention"(%54, %60, %61, %7, %0) {batch = 1 : i64, block_size = 0 : i64, causal = true, dim = 256 : i64, has_mask = false, keep_dims = false, kv_cache_mode = #tpu<kv_cache_mode paged>, kv_head = 2 : i64, max_blocks_per_seq = 0 : i64, mk = 2049 : i64, mq = 1 : i64, operand_segment_sizes = array<i32: 1, 1, 1, 1, 1, 0, 0, 0, 0>, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1x8x256xf16>, tensor<1x2049x2x256xf16>, tensor<1x2049x2x256xf16>, tensor<1x1x1x2049xf16>, none) -> tensor<1x1x2048xf16> loc(#loc62)
    %63 = "tpu.Reshape"(%21) {flatten_start_dim = -1 : i64, shape = [1, 1, 2048]} : (tensor<1x1x8x256xf16>) -> tensor<1x1x2048xf16> loc(#loc63)
    %64 = "tpu.Mul"(%62, %63) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x2048xf16>, tensor<1x1x2048xf16>) -> tensor<1x1x2048xf16> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<2048x16xf16> loc(#loc67)
    %68 = "tpu.A16MatMul"(%64, %65, %67, %66, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<2048x1024xui8>, tensor<2048x16xf16>, tensor<2048x16xui8>, none) -> tensor<1x1x2048xf16> loc(#loc68)
    %69 = "tpu.Add"(%2, %68) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xf16>, tensor<1x1x2048xf16>) -> tensor<1x1x2048xf16> loc(#loc69)
    %70 = "top.Weight"() : () -> tensor<1x1x2048xf16> loc(#loc70)
    %71 = "tpu.RMSNorm"(%69, %70) {accumulate_dtype = "NONE", axis = -1 : i64, eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xf16>, tensor<1x1x2048xf16>) -> tensor<1x1x2048xf16> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<6144x16xf16> loc(#loc74)
    %75 = "tpu.A16MatMul"(%71, %72, %74, %73, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<6144x1024xui8>, tensor<6144x16xf16>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xf16> loc(#loc75)
    %76 = "tpu.Active"(%75) {mode = #tpu<active_mode SILU>} : (tensor<1x1x6144xf16>) -> tensor<1x1x6144xf16> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<6144x16xf16> loc(#loc79)
    %80 = "tpu.A16MatMul"(%71, %77, %79, %78, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x2048xf16>, tensor<6144x1024xui8>, tensor<6144x16xf16>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xf16> loc(#loc80)
    %81 = "tpu.Mul"(%76, %80) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x6144xf16>, tensor<1x1x6144xf16>) -> tensor<1x1x6144xf16> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc82)
    %83 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc83)
    %84 = "top.Weight"() : () -> tensor<2048x48xf16> loc(#loc84)
    %85 = "tpu.A16MatMul"(%81, %82, %84, %83, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, sign = true, w_transpose = false, weight_bits = 4 : i64} : (tensor<1x1x6144xf16>, tensor<2048x3072xui8>, tensor<2048x48xf16>, tensor<2048x48xui8>, none) -> tensor<1x1x2048xf16> loc(#loc85)
    %86 = "tpu.Add"(%69, %85) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xf16>, tensor<1x1x2048xf16>) -> tensor<1x1x2048xf16> loc(#loc86)
    %87 = "tpu.Cast"(%86) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf16>) -> tensor<1x1x2048xf32> loc(#loc87)
    return %87, %59, %32 : tensor<1x1x2048xf32>, tensor<1x1x2x256xf32>, tensor<1x1x2x256xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("input_statesmodel.language_model.layers.7.input_layernorm_f16")
#loc3 = loc("position_ids")
#loc4 = loc("position_ids_f32")
#loc5 = loc("position_ids_f32rotary_cos_si32")
#loc6 = loc("attention_mask")
#loc7 = loc("attention_maskmodel.language_model.layers.7.fattention_f16")
#loc8 = loc("history_k")
#loc9 = loc("history_kmodel.language_model.layers.7.self_attn.k_proj.concat_f16")
#loc10 = loc("history_v")
#loc11 = loc("history_vmodel.language_model.layers.7.self_attn.v_proj.concat_f16")
#loc12 = loc("model.language_model.layers.7.input_layernorm.weight_f16")
#loc13 = loc("model.language_model.layers.7.input_layernorm")
#loc14 = loc("model.language_model.layers.7.self_attn.q_proj.qweight")
#loc15 = loc("model.language_model.layers.7.self_attn.q_proj.qzeros")
#loc16 = loc("model.language_model.layers.7.self_attn.q_proj.scales_f16")
#loc17 = loc("model.language_model.layers.7.self_attn.q_proj")
#loc18 = loc("model.language_model.layers.7.self_attn.q_proj.reshape")
#loc19 = loc("model.language_model.layers.7.self_attn.q_proj.q_slice")
#loc20 = loc("model.language_model.layers.7.self_attn.q_proj.gate_slice")
#loc21 = loc("model.language_model.layers.7.mlp.gate_proj.gate_sigmoid")
#loc22 = loc("model.language_model.layers.7.self_attn.k_proj.qweight")
#loc23 = loc("model.language_model.layers.7.self_attn.k_proj.qzeros")
#loc24 = loc("model.language_model.layers.7.self_attn.k_proj.scales_f16")
#loc25 = loc("model.language_model.layers.7.self_attn.k_proj")
#loc26 = loc("model.language_model.layers.7.self_attn.v_proj.qweight")
#loc27 = loc("model.language_model.layers.7.self_attn.v_proj.qzeros")
#loc28 = loc("model.language_model.layers.7.self_attn.v_proj.scales_f16")
#loc29 = loc("model.language_model.layers.7.self_attn.v_proj")
#loc30 = loc("model.language_model.layers.7.self_attn.k_proj.reshape")
#loc31 = loc("v_cache")
#loc32 = loc("v_cache_f32")
#loc33 = loc("model.language_model.layers.7.self_attn.q_norm.weight_f16")
#loc34 = loc("model.language_model.layers.7.self_attn.q_norm")
#loc35 = loc("model.language_model.layers.7.self_attn.k_norm.weight_f16")
#loc36 = loc("model.language_model.layers.7.self_attn.k_norm")
#loc37 = loc("rotary_cos.weight_f16")
#loc38 = loc("rotary_cos")
#loc39 = loc("rotary_cos.permute")
#loc40 = loc("rotary_cos.reshape")
#loc41 = loc("mrope_interleave_idx_int")
#loc42 = loc("rotary_cos.gather")
#loc43 = loc("rotary_cos.permute2")
#loc44 = loc("rotary_sin.weight_f16")
#loc45 = loc("rotary_sin")
#loc46 = loc("rotary_sin.permute")
#loc47 = loc("rotary_sin.reshape")
#loc48 = loc("rotary_sin.gathermrope_interleave_idx_int")
#loc49 = loc("rotary_sin.gather")
#loc50 = loc("rotary_sin.permute2")
#loc51 = loc("q_proj.slice")
#loc52 = loc("q_proj.slice2")
#loc53 = loc("q_proj.rope")
#loc54 = loc("q_proj")
#loc55 = loc("k_proj.slice")
#loc56 = loc("k_proj.slice2")
#loc57 = loc("k_proj.rope")
#loc58 = loc("k_cache")
#loc59 = loc("k_cache_f32")
#loc60 = loc("model.language_model.layers.7.self_attn.k_proj.concat")
#loc61 = loc("model.language_model.layers.7.self_attn.v_proj.concat")
#loc62 = loc("model.language_model.layers.7.fattention")
#loc63 = loc("model.language_model.layers.7.mlp.gate_proj.gate_reshape")
#loc64 = loc("model.language_model.layers.7.mlp.gate_proj.gate_mul")
#loc65 = loc("model.language_model.layers.7.self_attn.o_proj.qweight")
#loc66 = loc("model.language_model.layers.7.self_attn.o_proj.qzeros")
#loc67 = loc("model.language_model.layers.7.self_attn.o_proj.scales_f16")
#loc68 = loc("model.language_model.layers.7.self_attn.o_proj")
#loc69 = loc("model.language_model.layers.7.self_attn.o_proj.add")
#loc70 = loc("model.language_model.layers.7.post_attention_layernorm.weight_f16")
#loc71 = loc("model.language_model.layers.7.post_attention_layernorm")
#loc72 = loc("model.language_model.layers.7.mlp.gate_proj.qweight")
#loc73 = loc("model.language_model.layers.7.mlp.gate_proj.qzeros")
#loc74 = loc("model.language_model.layers.7.mlp.gate_proj.scales_f16")
#loc75 = loc("model.language_model.layers.7.mlp.gate_proj")
#loc76 = loc("model.language_model.layers.7.mlp.gate_proj.silu")
#loc77 = loc("model.language_model.layers.7.mlp.up_proj.qweight")
#loc78 = loc("model.language_model.layers.7.mlp.up_proj.qzeros")
#loc79 = loc("model.language_model.layers.7.mlp.up_proj.scales_f16")
#loc80 = loc("model.language_model.layers.7.mlp.up_proj")
#loc81 = loc("model.language_model.layers.7.mlp.up_proj.mul")
#loc82 = loc("model.language_model.layers.7.mlp.down_proj.qweight")
#loc83 = loc("model.language_model.layers.7.mlp.down_proj.qzeros")
#loc84 = loc("model.language_model.layers.7.mlp.down_proj.scales_f16")
#loc85 = loc("model.language_model.layers.7.mlp.down_proj")
#loc86 = loc("output_states")
#loc87 = loc("output_states_f32")

