#loc2 = loc("hidden")
#loc3 = loc("block7_w")
module @tiny_block7 attributes {module.FLOPs = 136 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "ada300", module.coeff_addr = 0 : i64, module.coeff_size = 0 : i64, module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.neuron_addr = 0 : i64, module.neuron_size = 1024 : i64, module.platform = "ONNX", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.weight_file = "tiny_block7_tpu_addressed_ada300_f16_weight.npz", tpu.gmem_bytes = 536870912 : i64, tpu.sram_bank_bytes = 262144 : i64, tpu.sram_bank_count = 5 : i64, tpu.target = "ada300", tpu.weight_memory_bytes = 268435456 : i64} {
  func.func @main(%arg0: tensor<1x8xf32, 0 : i64> loc("hidden"), %arg1: tensor<8x8xf32, 64 : i64> loc("block7_w")) -> tensor<1x8xf32, 960 : i64> {
    %0 = "top.None"() : () -> none loc(#loc4)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x8xf32, 0 : i64>) -> tensor<1x8xf32, 320 : i64> loc(#loc5)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x8xf32, 320 : i64>) -> tensor<1x8xf16, 384 : i64> loc(#loc6)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<8x8xf32, 64 : i64>) -> tensor<8x8xf32, 448 : i64> loc(#loc7)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<8x8xf32, 448 : i64>) -> tensor<8x8xf16, 704 : i64> loc(#loc8)
    %5 = "tpu.MatMul"(%2, %4, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x8xf16, 384 : i64>, tensor<8x8xf16, 704 : i64>, none, none, none) -> tensor<1x8xf16, 832 : i64> loc(#loc9)
    %6 = "tpu.Add"(%5, %2) {coeff = [], do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x8xf16, 832 : i64>, tensor<1x8xf16, 384 : i64>) -> tensor<1x8xf16, 896 : i64> loc(#loc10)
    %7 = "tpu.Cast"(%6) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x8xf16, 896 : i64>) -> tensor<1x8xf32, 960 : i64> loc(#loc11)
    return %7 : tensor<1x8xf32, 960 : i64> loc(#loc12)
  } loc(#loc1)
} loc(#loc)
#loc = loc("/workspace/tpu-mlir/examples/tiny_llm/output/block_7_top.mlir":1:1)
#loc1 = loc("/workspace/tpu-mlir/examples/tiny_llm/output/block_7_top.mlir":6:3)
#loc4 = loc("none")
#loc5 = loc("block7.hidden")
#loc6 = loc("block7.hiddenblock7.matmul_f16")
#loc7 = loc("block7.w")
#loc8 = loc("block7.wblock7.matmul_f16")
#loc9 = loc("block7.matmul")
#loc10 = loc("block7.residual")
#loc11 = loc("block7.residual_f32")
#loc12 = loc("/workspace/tpu-mlir/examples/tiny_llm/output/block_7_top.mlir":18:5)

