#loc2 = loc("hidden")
#loc3 = loc("lm_w")
module @tiny_lm_head attributes {module.FLOPs = 16 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "ada300", module.coeff_addr = 0 : i64, module.coeff_size = 0 : i64, module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.neuron_addr = 0 : i64, module.neuron_size = 512 : i64, module.platform = "ONNX", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.weight_file = "tiny_lm_head_tpu_addressed_ada300_f16_weight.npz", tpu.gmem_bytes = 536870912 : i64, tpu.sram_bank_bytes = 262144 : i64, tpu.sram_bank_count = 5 : i64, tpu.target = "ada300", tpu.weight_memory_bytes = 268435456 : i64} {
  func.func @main(%arg0: tensor<1x8xf32, 0 : i64> loc("hidden"), %arg1: tensor<8x1xf32, 64 : i64> loc("lm_w")) -> tensor<1x1xf32, 448 : i64> {
    %0 = "top.None"() : () -> none loc(#loc4)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x8xf32, 0 : i64>) -> tensor<1x8xf32, 128 : i64> loc(#loc5)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x8xf32, 128 : i64>) -> tensor<1x8xf16, 192 : i64> loc(#loc6)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<8x1xf32, 64 : i64>) -> tensor<8x1xf32, 256 : i64> loc(#loc7)
    %4 = "tpu.Cast"(%3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<8x1xf32, 256 : i64>) -> tensor<8x1xf16, 320 : i64> loc(#loc8)
    %5 = "tpu.MatMul"(%2, %4, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x8xf16, 192 : i64>, tensor<8x1xf16, 320 : i64>, none, none, none) -> tensor<1x1xf16, 384 : i64> loc(#loc9)
    %6 = "tpu.Cast"(%5) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1xf16, 384 : i64>) -> tensor<1x1xf32, 448 : i64> loc(#loc10)
    return %6 : tensor<1x1xf32, 448 : i64> loc(#loc11)
  } loc(#loc1)
} loc(#loc)
#loc = loc("/workspace/tpu-mlir/examples/tiny_llm/output/lm_head_top.mlir":1:1)
#loc1 = loc("/workspace/tpu-mlir/examples/tiny_llm/output/lm_head_top.mlir":6:3)
#loc4 = loc("none")
#loc5 = loc("lm.hidden")
#loc6 = loc("lm.hiddenlm.matmul_f16")
#loc7 = loc("lm.w")
#loc8 = loc("lm.wlm.matmul_f16")
#loc9 = loc("lm.matmul")
#loc10 = loc("lm.matmul_f32")
#loc11 = loc("/workspace/tpu-mlir/examples/tiny_llm/output/lm_head_top.mlir":16:5)

