#loc = loc(unknown)
module @lm_head attributes {module.FLOPs = 1017118720 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "ada300", module.coeff_addr = 0 : i64, module.coeff_size = 1017118720 : i64, module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "F16", module.neuron_addr = 0 : i64, module.neuron_size = 2007168 : i64, module.platform = "LLM_QUANTIZED", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "lm_head_tpu_addressed_ada300_f16_weight.npz", tpu.gmem_bytes = 536870912 : i64, tpu.sram_bank_bytes = 262144 : i64, tpu.sram_bank_count = 5 : i64, tpu.target = "ada300", tpu.weight_memory_bytes = 268435456 : i64} {
  func.func @main(%arg0: tensor<1x2048xf32, 0 : i64> loc(unknown)) -> tensor<1x1xi32, 2007104 : i64> {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x2048xf32, 0 : i64>) -> tensor<1x2048xf32, 8192 : i64> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2048xf32, 8192 : i64>) -> tensor<1x2048xf16, 16384 : i64> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<248320x2048xf16, 0 : i64> loc(#loc3)
    %4 = "tpu.MatMul"(%3, %2, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = true, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<248320x2048xf16, 0 : i64>, tensor<1x2048xf16, 16384 : i64>, none, none, none) -> tensor<248320x1xf16, 20480 : i64> loc(#loc4)
    %5 = "tpu.Reshape"(%4) {flatten_start_dim = -1 : i64, shape = []} : (tensor<248320x1xf16, 20480 : i64>) -> tensor<1x248320xf16, 517120 : i64> loc(#loc5)
    %6 = "tpu.Cast"(%5) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x248320xf16, 517120 : i64>) -> tensor<1x248320xf32, 1013760 : i64> loc(#loc6)
    %values, %indices = "tpu.TopK"(%6, %0, %0) {K = 1 : i64, axis = 1 : i64, largest = true, replace_topk_indices = false, sorted = true, values_used_only = false} : (tensor<1x248320xf32, 1013760 : i64>, none, none) -> (tensor<1x1xf32, 2007040 : i64>, tensor<1x1xi32, 2007104 : i64>) loc(#loc9)
    return %indices : tensor<1x1xi32, 2007104 : i64> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("hidden_states")
#loc2 = loc("hidden_stateslm_head_f16")
#loc3 = loc("lm_head.weight_f16")
#loc4 = loc("lm_head")
#loc5 = loc("lm_head.reshape")
#loc6 = loc("lm_head.reshapetoken_value_f32")
#loc7 = loc("token_value")
#loc8 = loc("token_id")
#loc9 = loc(fused[#loc7, #loc8])

