#loc = loc(unknown)
module @block_3 attributes {module.FLOPs = 116039614464 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.mode = "W4BF16", module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "block_3_bm1684x_w4bf16_tpu_weights.npz"} {
  func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<3x1024xsi32> loc(unknown), %arg2: tensor<1x1x1024x1024xf32> loc(unknown)) -> (tensor<1x1024x2048xf32>, tensor<1x1024x2x256xf32>, tensor<1x1024x2x256xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1024xsi32>) -> tensor<3x1024xsi32> loc(#loc3)
    %4 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1024x1024xf32>) -> tensor<1x1x1024x1024xf32> loc(#loc4)
    %5 = "tpu.Cast"(%4) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x1024x1024xf32>) -> tensor<1x1x1024x1024xbf16> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc6)
    %7 = "tpu.RMSNorm"(%2, %6) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<4096x1024xui8> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<4096x16xbf16> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<4096x16xui8> loc(#loc10)
    %11 = "tpu.A16MatMul"(%7, %8, %9, %10, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<4096x1024xui8>, tensor<4096x16xbf16>, tensor<4096x16xui8>, none) -> tensor<1x1024x4096xbf16> loc(#loc11)
    %12 = "tpu.Reshape"(%11) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1024x4096xbf16>) -> tensor<1x1024x8x512xbf16> loc(#loc12)
    %13 = "tpu.Slice"(%12, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xbf16>, none, none, none, none) -> tensor<1x1024x8x256xbf16> loc(#loc13)
    %14 = "tpu.Slice"(%12, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 512], hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xbf16>, none, none, none, none) -> tensor<1x1024x8x256xbf16> loc(#loc14)
    %15 = "tpu.Cast"(%14) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x8x256xbf16>) -> tensor<1x1024x8x256xf32> loc(#loc15)
    %16 = "tpu.Active"(%15) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1024x8x256xf32>) -> tensor<1x1024x8x256xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<512x16xbf16> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc19)
    %20 = "tpu.A16MatMul"(%7, %17, %18, %19, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<512x1024xui8>, tensor<512x16xbf16>, tensor<512x16xui8>, none) -> tensor<1x1024x512xbf16> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<512x16xbf16> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc23)
    %24 = "tpu.A16MatMul"(%7, %21, %22, %23, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<512x1024xui8>, tensor<512x16xbf16>, tensor<512x16xui8>, none) -> tensor<1x1024x512xbf16> loc(#loc24)
    %25 = "tpu.Reshape"(%20) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xbf16>) -> tensor<1x1024x2x256xbf16> loc(#loc25)
    %26 = "tpu.Reshape"(%24) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xbf16>) -> tensor<1x1024x2x256xbf16> loc(#loc26)
    %27 = "tpu.Cast"(%26) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2x256xbf16>) -> tensor<1x1024x2x256xf32> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<1x1x1x256xbf16> loc(#loc28)
    %29 = "tpu.RMSNorm"(%13, %28) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x8x256xbf16>, tensor<1x1x1x256xbf16>) -> tensor<1x1024x8x256xbf16> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<1x1x1x256xbf16> loc(#loc30)
    %31 = "tpu.RMSNorm"(%25, %30) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2x256xbf16>, tensor<1x1x1x256xbf16>) -> tensor<1x1024x2x256xbf16> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<2048x1x32xbf16> loc(#loc32)
    %33 = "tpu.Gather"(%32, %3, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16>, tensor<3x1024xsi32>, none) -> tensor<3x1024x1x32xbf16> loc(#loc33)
    %34 = "tpu.Permute"(%33, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xbf16>, none) -> tensor<3x32x1x1024xbf16> loc(#loc34)
    %35 = "tpu.Reshape"(%34) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xbf16>) -> tensor<96x1x1024xbf16> loc(#loc35)
    %36 = "top.Weight"() : () -> tensor<1x64xi32> loc(#loc36)
    %37 = "tpu.Gather"(%35, %36, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xbf16>, tensor<1x64xi32>, none) -> tensor<1x64x1x1024xbf16> loc(#loc37)
    %38 = "tpu.Permute"(%37, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xbf16>, none) -> tensor<1x1024x1x64xbf16> loc(#loc38)
    %39 = "top.Weight"() : () -> tensor<2048x1x32xbf16> loc(#loc39)
    %40 = "tpu.Gather"(%39, %3, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16>, tensor<3x1024xsi32>, none) -> tensor<3x1024x1x32xbf16> loc(#loc40)
    %41 = "tpu.Permute"(%40, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xbf16>, none) -> tensor<3x32x1x1024xbf16> loc(#loc41)
    %42 = "tpu.Reshape"(%41) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xbf16>) -> tensor<96x1x1024xbf16> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<1x64xi32> loc(#loc43)
    %44 = "tpu.Gather"(%42, %43, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xbf16>, tensor<1x64xi32>, none) -> tensor<1x64x1x1024xbf16> loc(#loc44)
    %45 = "tpu.Permute"(%44, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xbf16>, none) -> tensor<1x1024x1x64xbf16> loc(#loc45)
    %46 = "tpu.Slice"(%29, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xbf16>, none, none, none, none) -> tensor<1x1024x8x64xbf16> loc(#loc46)
    %47 = "tpu.Slice"(%29, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xbf16>, none, none, none, none) -> tensor<1x1024x8x192xbf16> loc(#loc47)
    %48 = "tpu.Rope"(%46, %45, %38) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1024x8x64xbf16>, tensor<1x1024x1x64xbf16>, tensor<1x1024x1x64xbf16>) -> tensor<1x1024x8x64xbf16> loc(#loc48)
    %49 = "tpu.Concat"(%48, %47) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x8x64xbf16>, tensor<1x1024x8x192xbf16>) -> tensor<1x1024x8x256xbf16> loc(#loc49)
    %50 = "tpu.Slice"(%31, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xbf16>, none, none, none, none) -> tensor<1x1024x2x64xbf16> loc(#loc50)
    %51 = "tpu.Slice"(%31, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xbf16>, none, none, none, none) -> tensor<1x1024x2x192xbf16> loc(#loc51)
    %52 = "tpu.Rope"(%50, %45, %38) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1024x2x64xbf16>, tensor<1x1024x1x64xbf16>, tensor<1x1024x1x64xbf16>) -> tensor<1x1024x2x64xbf16> loc(#loc52)
    %53 = "tpu.Concat"(%52, %51) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2x64xbf16>, tensor<1x1024x2x192xbf16>) -> tensor<1x1024x2x256xbf16> loc(#loc53)
    %54 = "tpu.Cast"(%53) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2x256xbf16>) -> tensor<1x1024x2x256xf32> loc(#loc54)
    %55 = "tpu.FAttention"(%49, %53, %26, %5, %0) {batch = 1 : i64, dim = 256 : i64, keep_dims = false, kv_head = 2 : i64, mk = 1024 : i64, mq = 1024 : i64, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1024x8x256xbf16>, tensor<1x1024x2x256xbf16>, tensor<1x1024x2x256xbf16>, tensor<1x1x1024x1024xbf16>, none) -> tensor<1x1024x2048xbf16> loc(#loc55)
    %56 = "tpu.Reshape"(%16) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x8x256xf32>) -> tensor<1x1024x2048xf32> loc(#loc56)
    %57 = "tpu.Cast"(%56) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16> loc(#loc57)
    %58 = "tpu.Mul"(%55, %57) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<2048x16xbf16> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc61)
    %62 = "tpu.A16MatMul"(%58, %59, %60, %61, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<2048x1024xui8>, tensor<2048x16xbf16>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xbf16> loc(#loc62)
    %63 = "tpu.Add"(%2, %62) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<1x1x2048xbf16> loc(#loc64)
    %65 = "tpu.RMSNorm"(%63, %64) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc68)
    %69 = "tpu.A16MatMul"(%65, %66, %67, %68, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xbf16> loc(#loc69)
    %70 = "tpu.Cast"(%69) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xf32> loc(#loc70)
    %71 = "tpu.Active"(%70) {mode = #tpu<active_mode SILU>} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc71)
    %72 = "tpu.Cast"(%71) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xbf16> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<6144x16xbf16> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc75)
    %76 = "tpu.A16MatMul"(%65, %73, %74, %75, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16>, tensor<6144x1024xui8>, tensor<6144x16xbf16>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xbf16> loc(#loc76)
    %77 = "tpu.Mul"(%72, %76) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x6144xbf16>, tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xbf16> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<2048x48xbf16> loc(#loc79)
    %80 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc80)
    %81 = "tpu.A16MatMul"(%77, %78, %79, %80, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xbf16>, tensor<2048x3072xui8>, tensor<2048x48xbf16>, tensor<2048x48xui8>, none) -> tensor<1x1024x2048xbf16> loc(#loc81)
    %82 = "tpu.Add"(%63, %81) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16>, tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xbf16> loc(#loc82)
    %83 = "tpu.Cast"(%82) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xf32> loc(#loc83)
    return %83, %54, %27 : tensor<1x1024x2048xf32>, tensor<1x1024x2x256xf32>, tensor<1x1024x2x256xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("input_statesmodel.language_model.layers.3.input_layernorm_bf16")
#loc3 = loc("position_ids")
#loc4 = loc("attention_mask")
#loc5 = loc("attention_maskmodel.language_model.layers.3.fattention_bf16")
#loc6 = loc("model.language_model.layers.3.input_layernorm.weight_bf16")
#loc7 = loc("model.language_model.layers.3.input_layernorm")
#loc8 = loc("model.language_model.layers.3.self_attn.q_proj_weight")
#loc9 = loc("model.language_model.layers.3.self_attn.q_proj.scales_bf16")
#loc10 = loc("model.language_model.layers.3.self_attn.q_proj_zp")
#loc11 = loc("model.language_model.layers.3.self_attn.q_proj")
#loc12 = loc("model.language_model.layers.3.self_attn.q_proj.reshape")
#loc13 = loc("model.language_model.layers.3.self_attn.q_proj.q_slice")
#loc14 = loc("model.language_model.layers.3.self_attn.q_proj.gate_slice")
#loc15 = loc("model.language_model.layers.3.self_attn.q_proj.gate_slicemodel.language_model.layers.3.mlp.gate_proj.gate_sigmoid_f32")
#loc16 = loc("model.language_model.layers.3.mlp.gate_proj.gate_sigmoid")
#loc17 = loc("model.language_model.layers.3.self_attn.k_proj_weight")
#loc18 = loc("model.language_model.layers.3.self_attn.k_proj.scales_bf16")
#loc19 = loc("model.language_model.layers.3.self_attn.k_proj_zp")
#loc20 = loc("model.language_model.layers.3.self_attn.k_proj")
#loc21 = loc("model.language_model.layers.3.self_attn.v_proj_weight")
#loc22 = loc("model.language_model.layers.3.self_attn.v_proj.scales_bf16")
#loc23 = loc("model.language_model.layers.3.self_attn.v_proj_zp")
#loc24 = loc("model.language_model.layers.3.self_attn.v_proj")
#loc25 = loc("model.language_model.layers.3.self_attn.k_proj.reshape")
#loc26 = loc("v_cache")
#loc27 = loc("v_cache_f32")
#loc28 = loc("model.language_model.layers.3.self_attn.q_norm.weight_bf16")
#loc29 = loc("model.language_model.layers.3.self_attn.q_norm")
#loc30 = loc("model.language_model.layers.3.self_attn.k_norm.weight_bf16")
#loc31 = loc("model.language_model.layers.3.self_attn.k_norm")
#loc32 = loc("rotary_cos.weight_bf16")
#loc33 = loc("rotary_cos")
#loc34 = loc("rotary_cos.permute")
#loc35 = loc("rotary_cos.reshape")
#loc36 = loc("mrope_interleave_idx_int")
#loc37 = loc("rotary_cos.gather")
#loc38 = loc("rotary_cos.permute2")
#loc39 = loc("rotary_sin.weight_bf16")
#loc40 = loc("rotary_sin")
#loc41 = loc("rotary_sin.permute")
#loc42 = loc("rotary_sin.reshape")
#loc43 = loc("rotary_sin.gathermrope_interleave_idx_int")
#loc44 = loc("rotary_sin.gather")
#loc45 = loc("rotary_sin.permute2")
#loc46 = loc("q_proj.slice")
#loc47 = loc("q_proj.slice2")
#loc48 = loc("q_proj.rope")
#loc49 = loc("q_proj")
#loc50 = loc("k_proj.slice")
#loc51 = loc("k_proj.slice2")
#loc52 = loc("k_proj.rope")
#loc53 = loc("k_cache")
#loc54 = loc("k_cache_f32")
#loc55 = loc("model.language_model.layers.3.fattention")
#loc56 = loc("model.language_model.layers.3.mlp.gate_proj.gate_reshape")
#loc57 = loc("model.language_model.layers.3.mlp.gate_proj.gate_reshapemodel.language_model.layers.3.mlp.gate_proj.gate_mul_bf16")
#loc58 = loc("model.language_model.layers.3.mlp.gate_proj.gate_mul")
#loc59 = loc("model.language_model.layers.3.self_attn.o_proj_weight")
#loc60 = loc("model.language_model.layers.3.self_attn.o_proj.scales_bf16")
#loc61 = loc("model.language_model.layers.3.self_attn.o_proj_zp")
#loc62 = loc("model.language_model.layers.3.self_attn.o_proj")
#loc63 = loc("model.language_model.layers.3.self_attn.o_proj.add")
#loc64 = loc("model.language_model.layers.3.post_attention_layernorm.weight_bf16")
#loc65 = loc("model.language_model.layers.3.post_attention_layernorm")
#loc66 = loc("model.language_model.layers.3.mlp.gate_proj_weight")
#loc67 = loc("model.language_model.layers.3.mlp.gate_proj.scales_bf16")
#loc68 = loc("model.language_model.layers.3.mlp.gate_proj_zp")
#loc69 = loc("model.language_model.layers.3.mlp.gate_proj")
#loc70 = loc("model.language_model.layers.3.mlp.gate_projmodel.language_model.layers.3.mlp.gate_proj.silu_f32")
#loc71 = loc("model.language_model.layers.3.mlp.gate_proj.silu")
#loc72 = loc("model.language_model.layers.3.mlp.gate_proj.silumodel.language_model.layers.3.mlp.up_proj.mul_bf16")
#loc73 = loc("model.language_model.layers.3.mlp.up_proj_weight")
#loc74 = loc("model.language_model.layers.3.mlp.up_proj.scales_bf16")
#loc75 = loc("model.language_model.layers.3.mlp.up_proj_zp")
#loc76 = loc("model.language_model.layers.3.mlp.up_proj")
#loc77 = loc("model.language_model.layers.3.mlp.up_proj.mul")
#loc78 = loc("model.language_model.layers.3.mlp.down_proj_weight")
#loc79 = loc("model.language_model.layers.3.mlp.down_proj.scales_bf16")
#loc80 = loc("model.language_model.layers.3.mlp.down_proj_zp")
#loc81 = loc("model.language_model.layers.3.mlp.down_proj")
#loc82 = loc("output_states")
#loc83 = loc("output_states_f32")

