#loc = loc(unknown)
module @block_23 attributes {module.chip = "ALL", module.platform = "LLM_QUANTIZED", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "../block_23_top_weights.npz"} {
  func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<3x1024xsi32> loc(unknown), %arg2: tensor<1x1x1024x1024xf32> loc(unknown)) -> (tensor<1x1024x2048xf32>, tensor<1x1024x2x256xf32>, tensor<1x1024x2x256xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc1)
    %2 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1024xsi32>) -> tensor<3x1024xf32> loc(#loc2)
    %3 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1024x1024xf32>) -> tensor<1x1x1024x1024xf32> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc4)
    %5 = "top.RMSNorm"(%1, %4) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<4096x1024xui8> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<4096x16xf32> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<4096x16xui8> loc(#loc8)
    %9 = "top.A16MatMul"(%5, %6, %7, %8, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<4096x1024xui8>, tensor<4096x16xf32>, tensor<4096x16xui8>, none) -> tensor<1x1024x4096xf32> loc(#loc9)
    %10 = "top.Reshape"(%9) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1024x4096xf32>) -> tensor<1x1024x8x512xf32> loc(#loc10)
    %11 = "top.Slice"(%10, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xf32>, none, none, none) -> tensor<1x1024x8x256xf32> loc(#loc11)
    %12 = "top.Slice"(%10, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 512], hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xf32>, none, none, none) -> tensor<1x1024x8x256xf32> loc(#loc12)
    %13 = "top.Sigmoid"(%12) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<1x1024x8x256xf32>) -> tensor<1x1024x8x256xf32> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<512x16xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc16)
    %17 = "top.A16MatMul"(%5, %14, %15, %16, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<512x1024xui8>, tensor<512x16xf32>, tensor<512x16xui8>, none) -> tensor<1x1024x512xf32> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<512x1024xui8> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<512x16xf32> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<512x16xui8> loc(#loc20)
    %21 = "top.A16MatMul"(%5, %18, %19, %20, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<512x1024xui8>, tensor<512x16xf32>, tensor<512x16xui8>, none) -> tensor<1x1024x512xf32> loc(#loc21)
    %22 = "top.Reshape"(%17) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xf32>) -> tensor<1x1024x2x256xf32> loc(#loc22)
    %23 = "top.Reshape"(%21) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xf32>) -> tensor<1x1024x2x256xf32> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<1x1x1x256xf32> loc(#loc24)
    %25 = "top.RMSNorm"(%11, %24) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x8x256xf32>, tensor<1x1x1x256xf32>) -> tensor<1x1024x8x256xf32> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x1x1x256xf32> loc(#loc26)
    %27 = "top.RMSNorm"(%22, %26) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2x256xf32>, tensor<1x1x1x256xf32>) -> tensor<1x1024x2x256xf32> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<2048x1x32xf32> loc(#loc28)
    %29 = "top.Gather"(%28, %2) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf32>, tensor<3x1024xf32>) -> tensor<3x1024x1x32xf32> loc(#loc29)
    %30 = "top.Permute"(%29) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xf32>) -> tensor<3x32x1x1024xf32> loc(#loc30)
    %31 = "top.Reshape"(%30) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xf32>) -> tensor<96x1x1024xf32> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<1x64xf32> loc(#loc32)
    %33 = "top.Gather"(%31, %32) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xf32>, tensor<1x64xf32>) -> tensor<1x64x1x1024xf32> loc(#loc33)
    %34 = "top.Permute"(%33) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xf32>) -> tensor<1x1024x1x64xf32> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<2048x1x32xf32> loc(#loc35)
    %36 = "top.Gather"(%35, %2) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xf32>, tensor<3x1024xf32>) -> tensor<3x1024x1x32xf32> loc(#loc36)
    %37 = "top.Permute"(%36) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xf32>) -> tensor<3x32x1x1024xf32> loc(#loc37)
    %38 = "top.Reshape"(%37) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xf32>) -> tensor<96x1x1024xf32> loc(#loc38)
    %39 = "top.Gather"(%38, %32) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xf32>, tensor<1x64xf32>) -> tensor<1x64x1x1024xf32> loc(#loc39)
    %40 = "top.Permute"(%39) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xf32>) -> tensor<1x1024x1x64xf32> loc(#loc40)
    %41 = "top.Slice"(%25, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xf32>, none, none, none) -> tensor<1x1024x8x64xf32> loc(#loc41)
    %42 = "top.Slice"(%25, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xf32>, none, none, none) -> tensor<1x1024x8x192xf32> loc(#loc42)
    %43 = "top.Rope"(%41, %40, %34) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = false, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x1024x8x64xf32>, tensor<1x1024x1x64xf32>, tensor<1x1024x1x64xf32>) -> tensor<1x1024x8x64xf32> loc(#loc43)
    %44 = "top.Concat"(%43, %42) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x1024x8x64xf32>, tensor<1x1024x8x192xf32>) -> tensor<1x1024x8x256xf32> loc(#loc44)
    %45 = "top.Slice"(%27, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xf32>, none, none, none) -> tensor<1x1024x2x64xf32> loc(#loc45)
    %46 = "top.Slice"(%27, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xf32>, none, none, none) -> tensor<1x1024x2x192xf32> loc(#loc46)
    %47 = "top.Rope"(%45, %40, %34) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = false, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x1024x2x64xf32>, tensor<1x1024x1x64xf32>, tensor<1x1024x1x64xf32>) -> tensor<1x1024x2x64xf32> loc(#loc47)
    %48 = "top.Concat"(%47, %46) {axis = 3 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x1024x2x64xf32>, tensor<1x1024x2x192xf32>) -> tensor<1x1024x2x256xf32> loc(#loc48)
    %49 = "top.FAttention"(%44, %48, %23, %3, %0) {batch = 1 : i64, dim = 256 : i64, keep_dims = false, kv_head = 2 : i64, mk = 1024 : i64, mq = 1024 : i64, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1024x8x256xf32>, tensor<1x1024x2x256xf32>, tensor<1x1024x2x256xf32>, tensor<1x1x1024x1024xf32>, none) -> tensor<1x1024x2048xf32> loc(#loc49)
    %50 = "top.Reshape"(%13) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x8x256xf32>) -> tensor<1x1024x2048xf32> loc(#loc50)
    %51 = "top.Mul"(%49, %50) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc54)
    %55 = "top.A16MatMul"(%51, %52, %53, %54, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<2048x1024xui8>, tensor<2048x16xf32>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xf32> loc(#loc55)
    %56 = "top.Add"(%1, %55) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc57)
    %58 = "top.RMSNorm"(%56, %57) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc61)
    %62 = "top.A16MatMul"(%58, %59, %60, %61, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xf32> loc(#loc62)
    %63 = "top.SiLU"(%62) : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc66)
    %67 = "top.A16MatMul"(%58, %64, %65, %66, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xf32> loc(#loc67)
    %68 = "top.Mul"(%63, %67) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x6144xf32>, tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc68)
    %69 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc69)
    %70 = "top.Weight"() : () -> tensor<2048x48xf32> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc71)
    %72 = "top.A16MatMul"(%68, %69, %70, %71, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xf32>, tensor<2048x3072xui8>, tensor<2048x48xf32>, tensor<2048x48xui8>, none) -> tensor<1x1024x2048xf32> loc(#loc72)
    %73 = "top.Add"(%56, %72) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc74)
    %75 = "top.RMSNorm"(%73, %74) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc75)
    return %75, %48, %23 : tensor<1x1024x2048xf32>, tensor<1x1024x2x256xf32>, tensor<1x1024x2x256xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("position_ids")
#loc3 = loc("attention_mask")
#loc4 = loc("model.language_model.layers.23.input_layernorm.weight")
#loc5 = loc("model.language_model.layers.23.input_layernorm")
#loc6 = loc("model.language_model.layers.23.self_attn.q_proj.qweight")
#loc7 = loc("model.language_model.layers.23.self_attn.q_proj.scales")
#loc8 = loc("model.language_model.layers.23.self_attn.q_proj.qzeros")
#loc9 = loc("model.language_model.layers.23.self_attn.q_proj")
#loc10 = loc("model.language_model.layers.23.self_attn.q_proj.reshape")
#loc11 = loc("model.language_model.layers.23.self_attn.q_proj.q_slice")
#loc12 = loc("model.language_model.layers.23.self_attn.q_proj.gate_slice")
#loc13 = loc("model.language_model.layers.23.mlp.gate_proj.gate_sigmoid")
#loc14 = loc("model.language_model.layers.23.self_attn.k_proj.qweight")
#loc15 = loc("model.language_model.layers.23.self_attn.k_proj.scales")
#loc16 = loc("model.language_model.layers.23.self_attn.k_proj.qzeros")
#loc17 = loc("model.language_model.layers.23.self_attn.k_proj")
#loc18 = loc("model.language_model.layers.23.self_attn.v_proj.qweight")
#loc19 = loc("model.language_model.layers.23.self_attn.v_proj.scales")
#loc20 = loc("model.language_model.layers.23.self_attn.v_proj.qzeros")
#loc21 = loc("model.language_model.layers.23.self_attn.v_proj")
#loc22 = loc("model.language_model.layers.23.self_attn.k_proj.reshape")
#loc23 = loc("v_cache")
#loc24 = loc("model.language_model.layers.23.self_attn.q_norm.weight")
#loc25 = loc("model.language_model.layers.23.self_attn.q_norm")
#loc26 = loc("model.language_model.layers.23.self_attn.k_norm.weight")
#loc27 = loc("model.language_model.layers.23.self_attn.k_norm")
#loc28 = loc("rotary_cos.weight")
#loc29 = loc("rotary_cos")
#loc30 = loc("rotary_cos.permute")
#loc31 = loc("rotary_cos.reshape")
#loc32 = loc("mrope_interleave_idx")
#loc33 = loc("rotary_cos.gather")
#loc34 = loc("rotary_cos.permute2")
#loc35 = loc("rotary_sin.weight")
#loc36 = loc("rotary_sin")
#loc37 = loc("rotary_sin.permute")
#loc38 = loc("rotary_sin.reshape")
#loc39 = loc("rotary_sin.gather")
#loc40 = loc("rotary_sin.permute2")
#loc41 = loc("q_proj.slice")
#loc42 = loc("q_proj.slice2")
#loc43 = loc("q_proj.rope")
#loc44 = loc("q_proj")
#loc45 = loc("k_proj.slice")
#loc46 = loc("k_proj.slice2")
#loc47 = loc("k_proj.rope")
#loc48 = loc("k_cache")
#loc49 = loc("model.language_model.layers.23.fattention")
#loc50 = loc("model.language_model.layers.23.mlp.gate_proj.gate_reshape")
#loc51 = loc("model.language_model.layers.23.mlp.gate_proj.gate_mul")
#loc52 = loc("model.language_model.layers.23.self_attn.o_proj.qweight")
#loc53 = loc("model.language_model.layers.23.self_attn.o_proj.scales")
#loc54 = loc("model.language_model.layers.23.self_attn.o_proj.qzeros")
#loc55 = loc("model.language_model.layers.23.self_attn.o_proj")
#loc56 = loc("model.language_model.layers.23.self_attn.o_proj.add")
#loc57 = loc("model.language_model.layers.23.post_attention_layernorm.weight")
#loc58 = loc("model.language_model.layers.23.post_attention_layernorm")
#loc59 = loc("model.language_model.layers.23.mlp.gate_proj.qweight")
#loc60 = loc("model.language_model.layers.23.mlp.gate_proj.scales")
#loc61 = loc("model.language_model.layers.23.mlp.gate_proj.qzeros")
#loc62 = loc("model.language_model.layers.23.mlp.gate_proj")
#loc63 = loc("model.language_model.layers.23.mlp.gate_proj.silu")
#loc64 = loc("model.language_model.layers.23.mlp.up_proj.qweight")
#loc65 = loc("model.language_model.layers.23.mlp.up_proj.scales")
#loc66 = loc("model.language_model.layers.23.mlp.up_proj.qzeros")
#loc67 = loc("model.language_model.layers.23.mlp.up_proj")
#loc68 = loc("model.language_model.layers.23.mlp.up_proj.mul")
#loc69 = loc("model.language_model.layers.23.mlp.down_proj.qweight")
#loc70 = loc("model.language_model.layers.23.mlp.down_proj.scales")
#loc71 = loc("model.language_model.layers.23.mlp.down_proj.qzeros")
#loc72 = loc("model.language_model.layers.23.mlp.down_proj")
#loc73 = loc("model.language_model.layers.23.mlp.down_proj.add")
#loc74 = loc("model.language_model.norm.weight")
#loc75 = loc("output_states")
