#loc = loc(unknown)
module @vit attributes {module.chip = "ALL", module.platform = "LLM_QUANTIZED", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "../vit_top_weights.npz"} {
  func.func @main(%arg0: tensor<2304x1536xf32> loc(unknown), %arg1: tensor<2304x2xsi32> loc(unknown), %arg2: tensor<2304x4xsi32> loc(unknown), %arg3: tensor<2304x4x1xf32> loc(unknown)) -> tensor<576x2048xf32> {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<2304x1536xf32>) -> tensor<2304x1536xf32> loc(#loc1)
    %2 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<2304x2xsi32>) -> tensor<2304x2xf32> loc(#loc2)
    %3 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<2304x4xsi32>) -> tensor<2304x4xf32> loc(#loc3)
    %4 = "top.Input"(%arg3) {do_preprocess = false} : (tensor<2304x4x1xf32>) -> tensor<2304x4x1xf32> loc(#loc4)
    %5 = "top.Weight"() : () -> tensor<1536x1024xf32> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc6)
    %7 = "top.MatMul"(%1, %5, %6) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1536xf32>, tensor<1536x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<2304x1024xf32> loc(#loc8)
    %9 = "top.Gather"(%8, %3) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x1024xf32>, tensor<2304x4xf32>) -> tensor<2304x4x1024xf32> loc(#loc9)
    %10 = "top.Mul"(%9, %4) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x4x1024xf32>, tensor<2304x4x1xf32>) -> tensor<2304x4x1024xf32> loc(#loc10)
    %11 = "top.Reduce"(%10) {axes = [1], is_scalar = false, keepdims = false, mode = "ReduceSum"} : (tensor<2304x4x1024xf32>) -> tensor<2304x1024xf32> loc(#loc11)
    %12 = "top.Add"(%7, %11) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<2304x16xf32> loc(#loc13)
    %14 = "top.Gather"(%13, %2) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x16xf32>, tensor<2304x2xf32>) -> tensor<2304x2x16xf32> loc(#loc14)
    %15 = "top.Reshape"(%14) {flatten_start_dim = -1 : i64, shape = [1, -1, 1, 32]} : (tensor<2304x2x16xf32>) -> tensor<1x2304x1x32xf32> loc(#loc15)
    %16 = "top.Tile"(%15) {tile = [1, 1, 1, 2]} : (tensor<1x2304x1x32xf32>) -> tensor<1x2304x1x64xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<2304x16xf32> loc(#loc17)
    %18 = "top.Gather"(%17, %2) {axis = 0 : si32, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x16xf32>, tensor<2304x2xf32>) -> tensor<2304x2x16xf32> loc(#loc18)
    %19 = "top.Reshape"(%18) {flatten_start_dim = -1 : i64, shape = [1, -1, 1, 32]} : (tensor<2304x2x16xf32>) -> tensor<1x2304x1x32xf32> loc(#loc19)
    %20 = "top.Tile"(%19) {tile = [1, 1, 1, 2]} : (tensor<1x2304x1x32xf32>) -> tensor<1x2304x1x64xf32> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc22)
    %23 = "top.LayerNorm"(%12, %21, %22) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc25)
    %26 = "top.MatMul"(%23, %25, %24) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc28)
    %29 = "top.MatMul"(%23, %28, %27) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc30)
    %31 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc31)
    %32 = "top.MatMul"(%23, %31, %30) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc32)
    %33 = "top.Reshape"(%26) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc33)
    %34 = "top.Reshape"(%29) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc34)
    %35 = "top.Reshape"(%32) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc35)
    %36 = "top.Rope"(%33, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc36)
    %37 = "top.Rope"(%34, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc37)
    %38 = "top.FAttention"(%36, %37, %35, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc38)
    %39 = "top.Reshape"(%38) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc41)
    %42 = "top.MatMul"(%39, %41, %40) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc42)
    %43 = "top.Add"(%12, %42) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc45)
    %46 = "top.LayerNorm"(%43, %44, %45) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc48)
    %49 = "top.MatMul"(%46, %48, %47) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc49)
    %50 = "top.GELU"(%49) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc50)
    %51 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc52)
    %53 = "top.MatMul"(%50, %52, %51) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc53)
    %54 = "top.Add"(%43, %53) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc56)
    %57 = "top.LayerNorm"(%54, %55, %56) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc59)
    %60 = "top.MatMul"(%57, %59, %58) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc62)
    %63 = "top.MatMul"(%57, %62, %61) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc65)
    %66 = "top.MatMul"(%57, %65, %64) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc66)
    %67 = "top.Reshape"(%60) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc67)
    %68 = "top.Reshape"(%63) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc68)
    %69 = "top.Reshape"(%66) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc69)
    %70 = "top.Rope"(%67, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc70)
    %71 = "top.Rope"(%68, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc71)
    %72 = "top.FAttention"(%70, %71, %69, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc72)
    %73 = "top.Reshape"(%72) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc75)
    %76 = "top.MatMul"(%73, %75, %74) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc76)
    %77 = "top.Add"(%54, %76) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc79)
    %80 = "top.LayerNorm"(%77, %78, %79) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc80)
    %81 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc82)
    %83 = "top.MatMul"(%80, %82, %81) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc83)
    %84 = "top.GELU"(%83) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc84)
    %85 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc86)
    %87 = "top.MatMul"(%84, %86, %85) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc87)
    %88 = "top.Add"(%77, %87) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc88)
    %89 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc89)
    %90 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc90)
    %91 = "top.LayerNorm"(%88, %89, %90) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc93)
    %94 = "top.MatMul"(%91, %93, %92) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc94)
    %95 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc96)
    %97 = "top.MatMul"(%91, %96, %95) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc97)
    %98 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc98)
    %99 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc99)
    %100 = "top.MatMul"(%91, %99, %98) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc100)
    %101 = "top.Reshape"(%94) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc101)
    %102 = "top.Reshape"(%97) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc102)
    %103 = "top.Reshape"(%100) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc103)
    %104 = "top.Rope"(%101, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc104)
    %105 = "top.Rope"(%102, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc105)
    %106 = "top.FAttention"(%104, %105, %103, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc106)
    %107 = "top.Reshape"(%106) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc107)
    %108 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc108)
    %109 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc109)
    %110 = "top.MatMul"(%107, %109, %108) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc110)
    %111 = "top.Add"(%88, %110) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc111)
    %112 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc112)
    %113 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc113)
    %114 = "top.LayerNorm"(%111, %112, %113) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc114)
    %115 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc115)
    %116 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc116)
    %117 = "top.MatMul"(%114, %116, %115) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc117)
    %118 = "top.GELU"(%117) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc118)
    %119 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc119)
    %120 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc120)
    %121 = "top.MatMul"(%118, %120, %119) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc121)
    %122 = "top.Add"(%111, %121) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc122)
    %123 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc123)
    %124 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc124)
    %125 = "top.LayerNorm"(%122, %123, %124) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc125)
    %126 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc126)
    %127 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc127)
    %128 = "top.MatMul"(%125, %127, %126) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc128)
    %129 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc129)
    %130 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc130)
    %131 = "top.MatMul"(%125, %130, %129) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc131)
    %132 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc132)
    %133 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc133)
    %134 = "top.MatMul"(%125, %133, %132) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc134)
    %135 = "top.Reshape"(%128) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc135)
    %136 = "top.Reshape"(%131) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc136)
    %137 = "top.Reshape"(%134) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc137)
    %138 = "top.Rope"(%135, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc138)
    %139 = "top.Rope"(%136, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc139)
    %140 = "top.FAttention"(%138, %139, %137, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc140)
    %141 = "top.Reshape"(%140) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc141)
    %142 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc142)
    %143 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc143)
    %144 = "top.MatMul"(%141, %143, %142) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc144)
    %145 = "top.Add"(%122, %144) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc145)
    %146 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc146)
    %147 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc147)
    %148 = "top.LayerNorm"(%145, %146, %147) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc148)
    %149 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc149)
    %150 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc150)
    %151 = "top.MatMul"(%148, %150, %149) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc151)
    %152 = "top.GELU"(%151) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc152)
    %153 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc153)
    %154 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc154)
    %155 = "top.MatMul"(%152, %154, %153) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc155)
    %156 = "top.Add"(%145, %155) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc156)
    %157 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc157)
    %158 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc158)
    %159 = "top.LayerNorm"(%156, %157, %158) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc159)
    %160 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc160)
    %161 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc161)
    %162 = "top.MatMul"(%159, %161, %160) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc162)
    %163 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc163)
    %164 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc164)
    %165 = "top.MatMul"(%159, %164, %163) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc165)
    %166 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc166)
    %167 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc167)
    %168 = "top.MatMul"(%159, %167, %166) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc168)
    %169 = "top.Reshape"(%162) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc169)
    %170 = "top.Reshape"(%165) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc170)
    %171 = "top.Reshape"(%168) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc171)
    %172 = "top.Rope"(%169, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc172)
    %173 = "top.Rope"(%170, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc173)
    %174 = "top.FAttention"(%172, %173, %171, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc174)
    %175 = "top.Reshape"(%174) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc175)
    %176 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc176)
    %177 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc177)
    %178 = "top.MatMul"(%175, %177, %176) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc178)
    %179 = "top.Add"(%156, %178) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc179)
    %180 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc180)
    %181 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc181)
    %182 = "top.LayerNorm"(%179, %180, %181) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc182)
    %183 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc183)
    %184 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc184)
    %185 = "top.MatMul"(%182, %184, %183) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc185)
    %186 = "top.GELU"(%185) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc186)
    %187 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc188)
    %189 = "top.MatMul"(%186, %188, %187) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc189)
    %190 = "top.Add"(%179, %189) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc190)
    %191 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc191)
    %192 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc192)
    %193 = "top.LayerNorm"(%190, %191, %192) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc193)
    %194 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc194)
    %195 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc195)
    %196 = "top.MatMul"(%193, %195, %194) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc196)
    %197 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc197)
    %198 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc198)
    %199 = "top.MatMul"(%193, %198, %197) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc199)
    %200 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc200)
    %201 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc201)
    %202 = "top.MatMul"(%193, %201, %200) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc202)
    %203 = "top.Reshape"(%196) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc203)
    %204 = "top.Reshape"(%199) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc204)
    %205 = "top.Reshape"(%202) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc205)
    %206 = "top.Rope"(%203, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc206)
    %207 = "top.Rope"(%204, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc207)
    %208 = "top.FAttention"(%206, %207, %205, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc208)
    %209 = "top.Reshape"(%208) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc209)
    %210 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc210)
    %211 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc211)
    %212 = "top.MatMul"(%209, %211, %210) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc212)
    %213 = "top.Add"(%190, %212) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc213)
    %214 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc214)
    %215 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc215)
    %216 = "top.LayerNorm"(%213, %214, %215) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc216)
    %217 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc217)
    %218 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc218)
    %219 = "top.MatMul"(%216, %218, %217) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc219)
    %220 = "top.GELU"(%219) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc220)
    %221 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc221)
    %222 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc222)
    %223 = "top.MatMul"(%220, %222, %221) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc223)
    %224 = "top.Add"(%213, %223) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc225)
    %226 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc226)
    %227 = "top.LayerNorm"(%224, %225, %226) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc227)
    %228 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc228)
    %229 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc229)
    %230 = "top.MatMul"(%227, %229, %228) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc230)
    %231 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc231)
    %232 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc232)
    %233 = "top.MatMul"(%227, %232, %231) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc233)
    %234 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc234)
    %235 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc235)
    %236 = "top.MatMul"(%227, %235, %234) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc236)
    %237 = "top.Reshape"(%230) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc237)
    %238 = "top.Reshape"(%233) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc238)
    %239 = "top.Reshape"(%236) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc239)
    %240 = "top.Rope"(%237, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc240)
    %241 = "top.Rope"(%238, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc241)
    %242 = "top.FAttention"(%240, %241, %239, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, tensor<1x2304x16x64xf32>, none, none) -> tensor<1x2304x16x64xf32> loc(#loc242)
    %243 = "top.Reshape"(%242) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xf32>) -> tensor<2304x1024xf32> loc(#loc243)
    %244 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc244)
    %245 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc245)
    %246 = "top.MatMul"(%243, %245, %244) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc246)
    %247 = "top.Add"(%224, %246) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc247)
    %248 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc248)
    %249 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc249)
    %250 = "top.LayerNorm"(%247, %248, %249) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc250)
    %251 = "top.Weight"() : () -> tensor<1x4096xf32> loc(#loc251)
    %252 = "top.Weight"() : () -> tensor<1024x4096xf32> loc(#loc252)
    %253 = "top.MatMul"(%250, %252, %251) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x4096xf32>, tensor<1x4096xf32>) -> tensor<2304x4096xf32> loc(#loc253)
    %254 = "top.GELU"(%253) {approx_mode = "tanh", round_mode = "HalfAwayFromZero"} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc254)
    %255 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc255)
    %256 = "top.Weight"() : () -> tensor<4096x1024xf32> loc(#loc256)
    %257 = "top.MatMul"(%254, %256, %255) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x4096xf32>, tensor<4096x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc257)
    %258 = "top.Add"(%247, %257) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xf32>, tensor<2304x1024xf32>) -> tensor<2304x1024xf32> loc(#loc258)
    %259 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc259)
    %260 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc260)
    %261 = "top.LayerNorm"(%258, %259, %260) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xf32>, tensor<1x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc261)
    %262 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc262)
    %263 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc263)
    %264 = "top.MatMul"(%261, %263, %262) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc264)
    %265 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc265)
    %266 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc266)
    %267 = "top.MatMul"(%261, %266, %265) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc267)
    %268 = "top.Weight"() : () -> tensor<1x1024xf32> loc(#loc268)
    %269 = "top.Weight"() : () -> tensor<1024x1024xf32> loc(#loc269)
    %270 = "top.MatMul"(%261, %269, %268) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<2304x1024xf32>, tensor<1024x1024xf32>, tensor<1x1024xf32>) -> tensor<2304x1024xf32> loc(#loc270)
    %271 = "top.Reshape"(%264) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc271)
    %272 = "top.Reshape"(%267) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc272)
    %273 = "top.Reshape"(%270) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xf32>) -> tensor<1x2304x16x64xf32> loc(#loc273)
    %274 = "top.Rope"(%271, %20, %16) {add_round_mode = "HalfAwayFromZero", add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = "HalfAwayFromZero", mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = "HalfAwayFromZero", mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = "contiguous_halves"} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc274)
