#loc = loc(unknown)
module @vit attributes {module.FLOPs = 1953274134528 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.mode = "BF16", module.platform = "LLM_QUANTIZED", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "vit_bm1684x_bf16_tpu_weights.npz"} {
  func.func @main(%arg0: tensor<2304x1536xf32> loc(unknown), %arg1: tensor<2304x2xsi32> loc(unknown), %arg2: tensor<2304x4xsi32> loc(unknown), %arg3: tensor<2304x4x1xf32> loc(unknown)) -> tensor<576x2048xf32> {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<2304x1536xf32>) -> tensor<2304x1536xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x1536xf32>) -> tensor<2304x1536xbf16> loc(#loc2)
    %3 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<2304x2xsi32>) -> tensor<2304x2xsi32> loc(#loc3)
    %4 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<2304x4xsi32>) -> tensor<2304x4xsi32> loc(#loc4)
    %5 = "top.Input"(%arg3) {do_preprocess = false} : (tensor<2304x4x1xf32>) -> tensor<2304x4x1xf32> loc(#loc5)
    %6 = "tpu.Cast"(%5) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4x1xf32>) -> tensor<2304x4x1xbf16> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<1536x1024xbf16> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc8)
    %9 = "tpu.MatMul"(%2, %7, %8, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1536xbf16>, tensor<1536x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<2304x1024xbf16> loc(#loc10)
    %11 = "tpu.Gather"(%10, %4, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x1024xbf16>, tensor<2304x4xsi32>, none) -> tensor<2304x4x1024xbf16> loc(#loc11)
    %12 = "tpu.Mul"(%11, %6) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<2304x4x1024xbf16>, tensor<2304x4x1xbf16>) -> tensor<2304x4x1024xbf16> loc(#loc12)
    %13 = "tpu.Reduce"(%12, %0, %0) {axes = [1], is_scalar = false, keepdims = false, mode = "ReduceSum"} : (tensor<2304x4x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc13)
    %14 = "tpu.Add"(%9, %13) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<2304x16xbf16> loc(#loc15)
    %16 = "tpu.Gather"(%15, %3, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x16xbf16>, tensor<2304x2xsi32>, none) -> tensor<2304x2x16xbf16> loc(#loc16)
    %17 = "tpu.Reshape"(%16) {flatten_start_dim = -1 : i64, shape = [1, -1, 1, 32]} : (tensor<2304x2x16xbf16>) -> tensor<1x2304x1x32xbf16> loc(#loc17)
    %18 = "tpu.Tile"(%17, %0) {tile = [1, 1, 1, 2]} : (tensor<1x2304x1x32xbf16>, none) -> tensor<1x2304x1x64xbf16> loc(#loc18)
    %19 = "tpu.Cast"(%18) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x1x64xbf16>) -> tensor<1x2304x1x64xf32> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<2304x16xbf16> loc(#loc20)
    %21 = "tpu.Gather"(%20, %3, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x16xbf16>, tensor<2304x2xsi32>, none) -> tensor<2304x2x16xbf16> loc(#loc21)
    %22 = "tpu.Reshape"(%21) {flatten_start_dim = -1 : i64, shape = [1, -1, 1, 32]} : (tensor<2304x2x16xbf16>) -> tensor<1x2304x1x32xbf16> loc(#loc22)
    %23 = "tpu.Tile"(%22, %0) {tile = [1, 1, 1, 2]} : (tensor<1x2304x1x32xbf16>, none) -> tensor<1x2304x1x64xbf16> loc(#loc23)
    %24 = "tpu.Cast"(%23) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x1x64xbf16>) -> tensor<1x2304x1x64xf32> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc26)
    %27 = "tpu.LayerNorm"(%14, %25, %26, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc28)
    %29 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc29)
    %30 = "tpu.MatMul"(%27, %28, %29, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc30)
    %31 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc32)
    %33 = "tpu.MatMul"(%27, %31, %32, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc33)
    %34 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc35)
    %36 = "tpu.MatMul"(%27, %34, %35, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc36)
    %37 = "tpu.Reshape"(%30) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc37)
    %38 = "tpu.Cast"(%37) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc38)
    %39 = "tpu.Reshape"(%33) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc39)
    %40 = "tpu.Cast"(%39) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc40)
    %41 = "tpu.Reshape"(%36) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc41)
    %42 = "tpu.Rope"(%38, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc42)
    %43 = "tpu.Cast"(%42) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc43)
    %44 = "tpu.Rope"(%40, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc44)
    %45 = "tpu.Cast"(%44) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc45)
    %46 = "tpu.FAttention"(%43, %45, %41, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, none, none) -> tensor<1x2304x16x64xbf16> loc(#loc46)
    %47 = "tpu.Reshape"(%46) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xbf16>) -> tensor<2304x1024xbf16> loc(#loc47)
    %48 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc49)
    %50 = "tpu.MatMul"(%47, %48, %49, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc50)
    %51 = "tpu.Add"(%14, %50) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc53)
    %54 = "tpu.LayerNorm"(%51, %52, %53, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<1024x4096xbf16> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<1x4096xbf16> loc(#loc56)
    %57 = "tpu.MatMul"(%54, %55, %56, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x4096xbf16>, tensor<1x4096xbf16>, none, none) -> tensor<2304x4096xbf16> loc(#loc57)
    %58 = "tpu.Cast"(%57) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xbf16>) -> tensor<2304x4096xf32> loc(#loc58)
    %59 = "tpu.Active"(%58) {mode = #tpu<active_mode TGELU>} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc59)
    %60 = "tpu.Cast"(%59) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xf32>) -> tensor<2304x4096xbf16> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<4096x1024xbf16> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc62)
    %63 = "tpu.MatMul"(%60, %61, %62, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x4096xbf16>, tensor<4096x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc63)
    %64 = "tpu.Add"(%51, %63) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc66)
    %67 = "tpu.LayerNorm"(%64, %65, %66, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc68)
    %69 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc69)
    %70 = "tpu.MatMul"(%67, %68, %69, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc72)
    %73 = "tpu.MatMul"(%67, %71, %72, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc75)
    %76 = "tpu.MatMul"(%67, %74, %75, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc76)
    %77 = "tpu.Reshape"(%70) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc77)
    %78 = "tpu.Cast"(%77) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc78)
    %79 = "tpu.Reshape"(%73) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc79)
    %80 = "tpu.Cast"(%79) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc80)
    %81 = "tpu.Reshape"(%76) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc81)
    %82 = "tpu.Rope"(%78, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc82)
    %83 = "tpu.Cast"(%82) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc83)
    %84 = "tpu.Rope"(%80, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc84)
    %85 = "tpu.Cast"(%84) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc85)
    %86 = "tpu.FAttention"(%83, %85, %81, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, none, none) -> tensor<1x2304x16x64xbf16> loc(#loc86)
    %87 = "tpu.Reshape"(%86) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xbf16>) -> tensor<2304x1024xbf16> loc(#loc87)
    %88 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc88)
    %89 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc89)
    %90 = "tpu.MatMul"(%87, %88, %89, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc90)
    %91 = "tpu.Add"(%64, %90) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc93)
    %94 = "tpu.LayerNorm"(%91, %92, %93, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc94)
    %95 = "top.Weight"() : () -> tensor<1024x4096xbf16> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<1x4096xbf16> loc(#loc96)
    %97 = "tpu.MatMul"(%94, %95, %96, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x4096xbf16>, tensor<1x4096xbf16>, none, none) -> tensor<2304x4096xbf16> loc(#loc97)
    %98 = "tpu.Cast"(%97) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xbf16>) -> tensor<2304x4096xf32> loc(#loc98)
    %99 = "tpu.Active"(%98) {mode = #tpu<active_mode TGELU>} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc99)
    %100 = "tpu.Cast"(%99) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xf32>) -> tensor<2304x4096xbf16> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<4096x1024xbf16> loc(#loc101)
    %102 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc102)
    %103 = "tpu.MatMul"(%100, %101, %102, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x4096xbf16>, tensor<4096x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc103)
    %104 = "tpu.Add"(%91, %103) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc104)
    %105 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc105)
    %106 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc106)
    %107 = "tpu.LayerNorm"(%104, %105, %106, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc107)
    %108 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc108)
    %109 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc109)
    %110 = "tpu.MatMul"(%107, %108, %109, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc110)
    %111 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc111)
    %112 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc112)
    %113 = "tpu.MatMul"(%107, %111, %112, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc113)
    %114 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc114)
    %115 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc115)
    %116 = "tpu.MatMul"(%107, %114, %115, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc116)
    %117 = "tpu.Reshape"(%110) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc117)
    %118 = "tpu.Cast"(%117) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc118)
    %119 = "tpu.Reshape"(%113) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc119)
    %120 = "tpu.Cast"(%119) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc120)
    %121 = "tpu.Reshape"(%116) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc121)
    %122 = "tpu.Rope"(%118, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc122)
    %123 = "tpu.Cast"(%122) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc123)
    %124 = "tpu.Rope"(%120, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc124)
    %125 = "tpu.Cast"(%124) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc125)
    %126 = "tpu.FAttention"(%123, %125, %121, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, none, none) -> tensor<1x2304x16x64xbf16> loc(#loc126)
    %127 = "tpu.Reshape"(%126) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xbf16>) -> tensor<2304x1024xbf16> loc(#loc127)
    %128 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc128)
    %129 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc129)
    %130 = "tpu.MatMul"(%127, %128, %129, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc130)
    %131 = "tpu.Add"(%104, %130) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc131)
    %132 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc132)
    %133 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc133)
    %134 = "tpu.LayerNorm"(%131, %132, %133, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc134)
    %135 = "top.Weight"() : () -> tensor<1024x4096xbf16> loc(#loc135)
    %136 = "top.Weight"() : () -> tensor<1x4096xbf16> loc(#loc136)
    %137 = "tpu.MatMul"(%134, %135, %136, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x4096xbf16>, tensor<1x4096xbf16>, none, none) -> tensor<2304x4096xbf16> loc(#loc137)
    %138 = "tpu.Cast"(%137) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xbf16>) -> tensor<2304x4096xf32> loc(#loc138)
    %139 = "tpu.Active"(%138) {mode = #tpu<active_mode TGELU>} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc139)
    %140 = "tpu.Cast"(%139) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xf32>) -> tensor<2304x4096xbf16> loc(#loc140)
    %141 = "top.Weight"() : () -> tensor<4096x1024xbf16> loc(#loc141)
    %142 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc142)
    %143 = "tpu.MatMul"(%140, %141, %142, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x4096xbf16>, tensor<4096x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc143)
    %144 = "tpu.Add"(%131, %143) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc144)
    %145 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc145)
    %146 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc146)
    %147 = "tpu.LayerNorm"(%144, %145, %146, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc147)
    %148 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc148)
    %149 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc149)
    %150 = "tpu.MatMul"(%147, %148, %149, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc150)
    %151 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc151)
    %152 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc152)
    %153 = "tpu.MatMul"(%147, %151, %152, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc153)
    %154 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc154)
    %155 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc155)
    %156 = "tpu.MatMul"(%147, %154, %155, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc156)
    %157 = "tpu.Reshape"(%150) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc157)
    %158 = "tpu.Cast"(%157) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc158)
    %159 = "tpu.Reshape"(%153) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc159)
    %160 = "tpu.Cast"(%159) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc160)
    %161 = "tpu.Reshape"(%156) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc161)
    %162 = "tpu.Rope"(%158, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc162)
    %163 = "tpu.Cast"(%162) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc163)
    %164 = "tpu.Rope"(%160, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc164)
    %165 = "tpu.Cast"(%164) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc165)
    %166 = "tpu.FAttention"(%163, %165, %161, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, none, none) -> tensor<1x2304x16x64xbf16> loc(#loc166)
    %167 = "tpu.Reshape"(%166) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xbf16>) -> tensor<2304x1024xbf16> loc(#loc167)
    %168 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc168)
    %169 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc169)
    %170 = "tpu.MatMul"(%167, %168, %169, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc170)
    %171 = "tpu.Add"(%144, %170) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc171)
    %172 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc172)
    %173 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc173)
    %174 = "tpu.LayerNorm"(%171, %172, %173, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc174)
    %175 = "top.Weight"() : () -> tensor<1024x4096xbf16> loc(#loc175)
    %176 = "top.Weight"() : () -> tensor<1x4096xbf16> loc(#loc176)
    %177 = "tpu.MatMul"(%174, %175, %176, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x4096xbf16>, tensor<1x4096xbf16>, none, none) -> tensor<2304x4096xbf16> loc(#loc177)
    %178 = "tpu.Cast"(%177) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xbf16>) -> tensor<2304x4096xf32> loc(#loc178)
    %179 = "tpu.Active"(%178) {mode = #tpu<active_mode TGELU>} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc179)
    %180 = "tpu.Cast"(%179) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xf32>) -> tensor<2304x4096xbf16> loc(#loc180)
    %181 = "top.Weight"() : () -> tensor<4096x1024xbf16> loc(#loc181)
    %182 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc182)
    %183 = "tpu.MatMul"(%180, %181, %182, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x4096xbf16>, tensor<4096x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc183)
    %184 = "tpu.Add"(%171, %183) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc184)
    %185 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc185)
    %186 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc186)
    %187 = "tpu.LayerNorm"(%184, %185, %186, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc188)
    %189 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc189)
    %190 = "tpu.MatMul"(%187, %188, %189, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc190)
    %191 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc191)
    %192 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc192)
    %193 = "tpu.MatMul"(%187, %191, %192, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc193)
    %194 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc194)
    %195 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc195)
    %196 = "tpu.MatMul"(%187, %194, %195, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc196)
    %197 = "tpu.Reshape"(%190) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc197)
    %198 = "tpu.Cast"(%197) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc198)
    %199 = "tpu.Reshape"(%193) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc199)
    %200 = "tpu.Cast"(%199) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xbf16>) -> tensor<1x2304x16x64xf32> loc(#loc200)
    %201 = "tpu.Reshape"(%196) {flatten_start_dim = -1 : i64, shape = [1, -1, 16, 64]} : (tensor<2304x1024xbf16>) -> tensor<1x2304x16x64xbf16> loc(#loc201)
    %202 = "tpu.Rope"(%198, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc202)
    %203 = "tpu.Cast"(%202) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc203)
    %204 = "tpu.Rope"(%200, %24, %19) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = true, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x2304x16x64xf32>, tensor<1x2304x1x64xf32>, tensor<1x2304x1x64xf32>) -> tensor<1x2304x16x64xf32> loc(#loc204)
    %205 = "tpu.Cast"(%204) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x2304x16x64xf32>) -> tensor<1x2304x16x64xbf16> loc(#loc205)
    %206 = "tpu.FAttention"(%203, %205, %201, %0, %0) {batch = 1 : i64, dim = 64 : i64, keep_dims = true, kv_head = 16 : i64, mk = 2304 : i64, mq = 2304 : i64, q_head = 16 : i64, scale = 1.250000e-01 : f64} : (tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, tensor<1x2304x16x64xbf16>, none, none) -> tensor<1x2304x16x64xbf16> loc(#loc206)
    %207 = "tpu.Reshape"(%206) {flatten_start_dim = -1 : i64, shape = [-1, 1024]} : (tensor<1x2304x16x64xbf16>) -> tensor<2304x1024xbf16> loc(#loc207)
    %208 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc208)
    %209 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc209)
    %210 = "tpu.MatMul"(%207, %208, %209, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc210)
    %211 = "tpu.Add"(%184, %210) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc211)
    %212 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc212)
    %213 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc213)
    %214 = "tpu.LayerNorm"(%211, %212, %213, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc214)
    %215 = "top.Weight"() : () -> tensor<1024x4096xbf16> loc(#loc215)
    %216 = "top.Weight"() : () -> tensor<1x4096xbf16> loc(#loc216)
    %217 = "tpu.MatMul"(%214, %215, %216, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x4096xbf16>, tensor<1x4096xbf16>, none, none) -> tensor<2304x4096xbf16> loc(#loc217)
    %218 = "tpu.Cast"(%217) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xbf16>) -> tensor<2304x4096xf32> loc(#loc218)
    %219 = "tpu.Active"(%218) {mode = #tpu<active_mode TGELU>} : (tensor<2304x4096xf32>) -> tensor<2304x4096xf32> loc(#loc219)
    %220 = "tpu.Cast"(%219) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4096xf32>) -> tensor<2304x4096xbf16> loc(#loc220)
    %221 = "top.Weight"() : () -> tensor<4096x1024xbf16> loc(#loc221)
    %222 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc222)
    %223 = "tpu.MatMul"(%220, %221, %222, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x4096xbf16>, tensor<4096x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc223)
    %224 = "tpu.Add"(%211, %223) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<2304x1024xbf16>, tensor<2304x1024xbf16>) -> tensor<2304x1024xbf16> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc225)
    %226 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc226)
    %227 = "tpu.LayerNorm"(%224, %225, %226, %0, %0) {axis = 1 : si32, eps = 9.9999999999999995E-7 : f64, normalized_shape = [1024]} : (tensor<2304x1024xbf16>, tensor<1x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc227)
    %228 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc228)
    %229 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc229)
    %230 = "tpu.MatMul"(%227, %228, %229, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1024xbf16>, tensor<1024x1024xbf16>, tensor<1x1024xbf16>, none, none) -> tensor<2304x1024xbf16> loc(#loc230)
    %231 = "top.Weight"() : () -> tensor<1024x1024xbf16> loc(#loc231)
    %232 = "top.Weight"() : () -> tensor<1x1024xbf16> loc(#loc232)
