#loc = loc(unknown)
#loc1 = loc("input_states")
#loc2 = loc("position_ids")
#loc3 = loc("pos_idx")
#loc4 = loc("pos_weight")
module @vit attributes {module.FLOPs = 1953274134528 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.inputs = ["input_states", "position_ids", "pos_idx", "pos_weight"], module.mode = "BF16", module.outputs = ["model.visual.merger.linear_fc2"], module.platform = "LLM_QUANTIZED", module.q_group_size = 0 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "vit_tpu_addressed_bm1684x_bf16_weight.npz"} {
  module @vit attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 663429120 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 0 : i64, module.neuron_addr = 4958396416 : i64, module.neuron_size = 95645696 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<2304x1536xf32> loc(unknown), %arg1: tensor<2304x2xsi32> loc(unknown), %arg2: tensor<2304x4xsi32> loc(unknown), %arg3: tensor<2304x4x1xf32> loc(unknown)) -> tensor<576x2048xbf16, 4958396416 : i64> {
      %0 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<2304x1536xf32>) -> tensor<2304x1536xf32, 5033893888 : i64> loc(#loc1)
      %1 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<2304x2xsi32>) -> tensor<2304x2xsi32, 5054021632 : i64> loc(#loc2)
      %2 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<2304x4xsi32>) -> tensor<2304x4xsi32, 5053984768 : i64> loc(#loc3)
      %3 = "top.Input"(%arg3) {do_preprocess = false} : (tensor<2304x4x1xf32>) -> tensor<2304x4x1xf32, 5053947904 : i64> loc(#loc4)
      %4 = call @subfunc_0(%0, %1, %2, %3) : (tensor<2304x1536xf32, 5033893888 : i64>, tensor<2304x2xsi32, 5054021632 : i64>, tensor<2304x4xsi32, 5053984768 : i64>, tensor<2304x4x1xf32, 5053947904 : i64>) -> tensor<576x2048xbf16, 4958396416 : i64> loc(#loc)
      return %4 : tensor<576x2048xbf16, 4958396416 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<2304x1536xf32, 5033893888 : i64> loc("input_states"), %arg1: tensor<2304x2xsi32, 5054021632 : i64> loc("position_ids"), %arg2: tensor<2304x4xsi32, 5053984768 : i64> loc("pos_idx"), %arg3: tensor<2304x4x1xf32, 5053947904 : i64> loc("pos_weight")) -> tensor<576x2048xbf16, 4958396416 : i64> attributes {id = 0 : i64, mode = #tpu<run_mode TPU_DYNAMIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4294967296 : i64> loc(#loc5)
      %2 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4294971392 : i64> loc(#loc6)
      %3 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4297068544 : i64> loc(#loc7)
      %4 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4297072640 : i64> loc(#loc8)
      %5 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4299169792 : i64> loc(#loc9)
      %6 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4299173888 : i64> loc(#loc10)
      %7 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4301271040 : i64> loc(#loc11)
      %8 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4301275136 : i64> loc(#loc12)
      %9 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4303372288 : i64> loc(#loc13)
      %10 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4303380480 : i64> loc(#loc14)
      %11 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4311769088 : i64> loc(#loc15)
      %12 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4311773184 : i64> loc(#loc16)
      %13 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4320161792 : i64> loc(#loc17)
      %14 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4320165888 : i64> loc(#loc18)
      %15 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4320169984 : i64> loc(#loc19)
      %16 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4320174080 : i64> loc(#loc20)
      %17 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4320178176 : i64> loc(#loc21)
      %18 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4320182272 : i64> loc(#loc22)
      %19 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4322279424 : i64> loc(#loc23)
      %20 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4322283520 : i64> loc(#loc24)
      %21 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4324380672 : i64> loc(#loc25)
      %22 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4324384768 : i64> loc(#loc26)
      %23 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4326481920 : i64> loc(#loc27)
      %24 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4326486016 : i64> loc(#loc28)
      %25 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4328583168 : i64> loc(#loc29)
      %26 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4328591360 : i64> loc(#loc30)
      %27 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4336979968 : i64> loc(#loc31)
      %28 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4336984064 : i64> loc(#loc32)
      %29 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4345372672 : i64> loc(#loc33)
      %30 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4345376768 : i64> loc(#loc34)
      %31 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4345380864 : i64> loc(#loc35)
      %32 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4345384960 : i64> loc(#loc36)
      %33 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4345389056 : i64> loc(#loc37)
      %34 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4345393152 : i64> loc(#loc38)
      %35 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4347490304 : i64> loc(#loc39)
      %36 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4347494400 : i64> loc(#loc40)
      %37 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4349591552 : i64> loc(#loc41)
      %38 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4349595648 : i64> loc(#loc42)
      %39 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4351692800 : i64> loc(#loc43)
      %40 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4351696896 : i64> loc(#loc44)
      %41 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4353794048 : i64> loc(#loc45)
      %42 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4353802240 : i64> loc(#loc46)
      %43 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4362190848 : i64> loc(#loc47)
      %44 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4362194944 : i64> loc(#loc48)
      %45 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4370583552 : i64> loc(#loc49)
      %46 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4370587648 : i64> loc(#loc50)
      %47 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4370591744 : i64> loc(#loc51)
      %48 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4370595840 : i64> loc(#loc52)
      %49 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4370599936 : i64> loc(#loc53)
      %50 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4370604032 : i64> loc(#loc54)
      %51 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4372701184 : i64> loc(#loc55)
      %52 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4372705280 : i64> loc(#loc56)
      %53 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4374802432 : i64> loc(#loc57)
      %54 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4374806528 : i64> loc(#loc58)
      %55 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4376903680 : i64> loc(#loc59)
      %56 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4376907776 : i64> loc(#loc60)
      %57 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4379004928 : i64> loc(#loc61)
      %58 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4379013120 : i64> loc(#loc62)
      %59 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4387401728 : i64> loc(#loc63)
      %60 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4387405824 : i64> loc(#loc64)
      %61 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4395794432 : i64> loc(#loc65)
      %62 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4395798528 : i64> loc(#loc66)
      %63 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4395802624 : i64> loc(#loc67)
      %64 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4395806720 : i64> loc(#loc68)
      %65 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4395810816 : i64> loc(#loc69)
      %66 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4395814912 : i64> loc(#loc70)
      %67 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4397912064 : i64> loc(#loc71)
      %68 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4397916160 : i64> loc(#loc72)
      %69 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4400013312 : i64> loc(#loc73)
      %70 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4400017408 : i64> loc(#loc74)
      %71 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4402114560 : i64> loc(#loc75)
      %72 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4402118656 : i64> loc(#loc76)
      %73 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4404215808 : i64> loc(#loc77)
      %74 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4404224000 : i64> loc(#loc78)
      %75 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4412612608 : i64> loc(#loc79)
      %76 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4412616704 : i64> loc(#loc80)
      %77 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4421005312 : i64> loc(#loc81)
      %78 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4421009408 : i64> loc(#loc82)
      %79 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4421013504 : i64> loc(#loc83)
      %80 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4421017600 : i64> loc(#loc84)
      %81 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4421021696 : i64> loc(#loc85)
      %82 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4421025792 : i64> loc(#loc86)
      %83 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4423122944 : i64> loc(#loc87)
      %84 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4423127040 : i64> loc(#loc88)
      %85 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4425224192 : i64> loc(#loc89)
      %86 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4425228288 : i64> loc(#loc90)
      %87 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4427325440 : i64> loc(#loc91)
      %88 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4427329536 : i64> loc(#loc92)
      %89 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4429426688 : i64> loc(#loc93)
      %90 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4429434880 : i64> loc(#loc94)
      %91 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4437823488 : i64> loc(#loc95)
      %92 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4437827584 : i64> loc(#loc96)
      %93 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4446216192 : i64> loc(#loc97)
      %94 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4446220288 : i64> loc(#loc98)
      %95 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4446224384 : i64> loc(#loc99)
      %96 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4446228480 : i64> loc(#loc100)
      %97 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4446232576 : i64> loc(#loc101)
      %98 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4446236672 : i64> loc(#loc102)
      %99 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4448333824 : i64> loc(#loc103)
      %100 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4448337920 : i64> loc(#loc104)
      %101 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4450435072 : i64> loc(#loc105)
      %102 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4450439168 : i64> loc(#loc106)
      %103 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4452536320 : i64> loc(#loc107)
      %104 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4452540416 : i64> loc(#loc108)
      %105 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4454637568 : i64> loc(#loc109)
      %106 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4454645760 : i64> loc(#loc110)
      %107 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4463034368 : i64> loc(#loc111)
      %108 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4463038464 : i64> loc(#loc112)
      %109 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4471427072 : i64> loc(#loc113)
      %110 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4471431168 : i64> loc(#loc114)
      %111 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4471435264 : i64> loc(#loc115)
      %112 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4471439360 : i64> loc(#loc116)
      %113 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4471443456 : i64> loc(#loc117)
      %114 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4471447552 : i64> loc(#loc118)
      %115 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4473544704 : i64> loc(#loc119)
      %116 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4473548800 : i64> loc(#loc120)
      %117 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4475645952 : i64> loc(#loc121)
      %118 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4475650048 : i64> loc(#loc122)
      %119 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4477747200 : i64> loc(#loc123)
      %120 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4477751296 : i64> loc(#loc124)
      %121 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4479848448 : i64> loc(#loc125)
      %122 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4479856640 : i64> loc(#loc126)
      %123 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4488245248 : i64> loc(#loc127)
      %124 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4488249344 : i64> loc(#loc128)
      %125 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4496637952 : i64> loc(#loc129)
      %126 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4496642048 : i64> loc(#loc130)
      %127 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4496646144 : i64> loc(#loc131)
      %128 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4496650240 : i64> loc(#loc132)
      %129 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4496654336 : i64> loc(#loc133)
      %130 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4496658432 : i64> loc(#loc134)
      %131 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4498755584 : i64> loc(#loc135)
      %132 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4498759680 : i64> loc(#loc136)
      %133 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4500856832 : i64> loc(#loc137)
      %134 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4500860928 : i64> loc(#loc138)
      %135 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4502958080 : i64> loc(#loc139)
      %136 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4502962176 : i64> loc(#loc140)
      %137 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4505059328 : i64> loc(#loc141)
      %138 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4505067520 : i64> loc(#loc142)
      %139 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4513456128 : i64> loc(#loc143)
      %140 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4513460224 : i64> loc(#loc144)
      %141 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4521848832 : i64> loc(#loc145)
      %142 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4521852928 : i64> loc(#loc146)
      %143 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4521857024 : i64> loc(#loc147)
      %144 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4521861120 : i64> loc(#loc148)
      %145 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4521865216 : i64> loc(#loc149)
      %146 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4521869312 : i64> loc(#loc150)
      %147 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4523966464 : i64> loc(#loc151)
      %148 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4523970560 : i64> loc(#loc152)
      %149 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4526067712 : i64> loc(#loc153)
      %150 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4526071808 : i64> loc(#loc154)
      %151 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4528168960 : i64> loc(#loc155)
      %152 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4528173056 : i64> loc(#loc156)
      %153 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4530270208 : i64> loc(#loc157)
      %154 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4530278400 : i64> loc(#loc158)
      %155 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4538667008 : i64> loc(#loc159)
      %156 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4538671104 : i64> loc(#loc160)
      %157 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4547059712 : i64> loc(#loc161)
      %158 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4547063808 : i64> loc(#loc162)
      %159 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4547067904 : i64> loc(#loc163)
      %160 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4547072000 : i64> loc(#loc164)
      %161 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4547076096 : i64> loc(#loc165)
      %162 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4547080192 : i64> loc(#loc166)
      %163 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4549177344 : i64> loc(#loc167)
      %164 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4549181440 : i64> loc(#loc168)
      %165 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4551278592 : i64> loc(#loc169)
      %166 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4551282688 : i64> loc(#loc170)
      %167 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4553379840 : i64> loc(#loc171)
      %168 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4553383936 : i64> loc(#loc172)
      %169 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4555481088 : i64> loc(#loc173)
      %170 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4555489280 : i64> loc(#loc174)
      %171 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4563877888 : i64> loc(#loc175)
      %172 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4563881984 : i64> loc(#loc176)
      %173 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4572270592 : i64> loc(#loc177)
      %174 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4572274688 : i64> loc(#loc178)
      %175 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4572278784 : i64> loc(#loc179)
      %176 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4572282880 : i64> loc(#loc180)
      %177 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4572286976 : i64> loc(#loc181)
      %178 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4572291072 : i64> loc(#loc182)
      %179 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4574388224 : i64> loc(#loc183)
      %180 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4574392320 : i64> loc(#loc184)
      %181 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4576489472 : i64> loc(#loc185)
      %182 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4576493568 : i64> loc(#loc186)
      %183 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4578590720 : i64> loc(#loc187)
      %184 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4578594816 : i64> loc(#loc188)
      %185 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4580691968 : i64> loc(#loc189)
      %186 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4580700160 : i64> loc(#loc190)
      %187 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4589088768 : i64> loc(#loc191)
      %188 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4589092864 : i64> loc(#loc192)
      %189 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4597481472 : i64> loc(#loc193)
      %190 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4597485568 : i64> loc(#loc194)
      %191 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4597489664 : i64> loc(#loc195)
      %192 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4597493760 : i64> loc(#loc196)
      %193 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4597497856 : i64> loc(#loc197)
      %194 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4597501952 : i64> loc(#loc198)
      %195 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4599599104 : i64> loc(#loc199)
      %196 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4599603200 : i64> loc(#loc200)
      %197 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4601700352 : i64> loc(#loc201)
      %198 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4601704448 : i64> loc(#loc202)
      %199 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4603801600 : i64> loc(#loc203)
      %200 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4603805696 : i64> loc(#loc204)
      %201 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4605902848 : i64> loc(#loc205)
      %202 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4605911040 : i64> loc(#loc206)
      %203 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4614299648 : i64> loc(#loc207)
      %204 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4614303744 : i64> loc(#loc208)
      %205 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4622692352 : i64> loc(#loc209)
      %206 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4622696448 : i64> loc(#loc210)
      %207 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4622700544 : i64> loc(#loc211)
      %208 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4622704640 : i64> loc(#loc212)
      %209 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4622708736 : i64> loc(#loc213)
      %210 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4622712832 : i64> loc(#loc214)
      %211 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4624809984 : i64> loc(#loc215)
      %212 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4624814080 : i64> loc(#loc216)
      %213 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4626911232 : i64> loc(#loc217)
      %214 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4626915328 : i64> loc(#loc218)
      %215 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4629012480 : i64> loc(#loc219)
      %216 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4629016576 : i64> loc(#loc220)
      %217 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4631113728 : i64> loc(#loc221)
      %218 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4631121920 : i64> loc(#loc222)
      %219 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4639510528 : i64> loc(#loc223)
      %220 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4639514624 : i64> loc(#loc224)
      %221 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4647903232 : i64> loc(#loc225)
      %222 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4647907328 : i64> loc(#loc226)
      %223 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4647911424 : i64> loc(#loc227)
      %224 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4647915520 : i64> loc(#loc228)
      %225 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4647919616 : i64> loc(#loc229)
      %226 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4647923712 : i64> loc(#loc230)
      %227 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4650020864 : i64> loc(#loc231)
      %228 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4650024960 : i64> loc(#loc232)
      %229 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4652122112 : i64> loc(#loc233)
      %230 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4652126208 : i64> loc(#loc234)
      %231 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4654223360 : i64> loc(#loc235)
      %232 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4654227456 : i64> loc(#loc236)
      %233 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4656324608 : i64> loc(#loc237)
      %234 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4656332800 : i64> loc(#loc238)
      %235 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4664721408 : i64> loc(#loc239)
      %236 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4664725504 : i64> loc(#loc240)
      %237 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4673114112 : i64> loc(#loc241)
      %238 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4673118208 : i64> loc(#loc242)
      %239 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4673122304 : i64> loc(#loc243)
      %240 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4673126400 : i64> loc(#loc244)
      %241 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4673130496 : i64> loc(#loc245)
      %242 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4673134592 : i64> loc(#loc246)
      %243 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4675231744 : i64> loc(#loc247)
      %244 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4675235840 : i64> loc(#loc248)
      %245 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4677332992 : i64> loc(#loc249)
      %246 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4677337088 : i64> loc(#loc250)
      %247 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4679434240 : i64> loc(#loc251)
      %248 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4679438336 : i64> loc(#loc252)
      %249 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4681535488 : i64> loc(#loc253)
      %250 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4681543680 : i64> loc(#loc254)
      %251 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4689932288 : i64> loc(#loc255)
      %252 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4689936384 : i64> loc(#loc256)
      %253 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4698324992 : i64> loc(#loc257)
      %254 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4698329088 : i64> loc(#loc258)
      %255 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4698333184 : i64> loc(#loc259)
      %256 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4698337280 : i64> loc(#loc260)
      %257 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4698341376 : i64> loc(#loc261)
      %258 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4698345472 : i64> loc(#loc262)
      %259 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4700442624 : i64> loc(#loc263)
      %260 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4700446720 : i64> loc(#loc264)
      %261 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4702543872 : i64> loc(#loc265)
      %262 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4702547968 : i64> loc(#loc266)
      %263 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4704645120 : i64> loc(#loc267)
      %264 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4704649216 : i64> loc(#loc268)
      %265 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4706746368 : i64> loc(#loc269)
      %266 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4706754560 : i64> loc(#loc270)
      %267 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4715143168 : i64> loc(#loc271)
      %268 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4715147264 : i64> loc(#loc272)
      %269 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4723535872 : i64> loc(#loc273)
      %270 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4723539968 : i64> loc(#loc274)
      %271 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4723544064 : i64> loc(#loc275)
      %272 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4723548160 : i64> loc(#loc276)
      %273 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4723552256 : i64> loc(#loc277)
      %274 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4723556352 : i64> loc(#loc278)
      %275 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4725653504 : i64> loc(#loc279)
      %276 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4725657600 : i64> loc(#loc280)
      %277 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4727754752 : i64> loc(#loc281)
      %278 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4727758848 : i64> loc(#loc282)
      %279 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4729856000 : i64> loc(#loc283)
      %280 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4729860096 : i64> loc(#loc284)
      %281 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4731957248 : i64> loc(#loc285)
      %282 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4731965440 : i64> loc(#loc286)
      %283 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4740354048 : i64> loc(#loc287)
      %284 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4740358144 : i64> loc(#loc288)
      %285 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4748746752 : i64> loc(#loc289)
      %286 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4748750848 : i64> loc(#loc290)
      %287 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4748754944 : i64> loc(#loc291)
      %288 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4748759040 : i64> loc(#loc292)
      %289 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4748763136 : i64> loc(#loc293)
      %290 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4748767232 : i64> loc(#loc294)
      %291 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4750864384 : i64> loc(#loc295)
      %292 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4750868480 : i64> loc(#loc296)
      %293 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4752965632 : i64> loc(#loc297)
      %294 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4752969728 : i64> loc(#loc298)
      %295 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4755066880 : i64> loc(#loc299)
      %296 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4755070976 : i64> loc(#loc300)
      %297 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4757168128 : i64> loc(#loc301)
      %298 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4757176320 : i64> loc(#loc302)
      %299 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4765564928 : i64> loc(#loc303)
      %300 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4765569024 : i64> loc(#loc304)
      %301 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4773957632 : i64> loc(#loc305)
      %302 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4773961728 : i64> loc(#loc306)
      %303 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4773965824 : i64> loc(#loc307)
      %304 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4773969920 : i64> loc(#loc308)
      %305 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4773974016 : i64> loc(#loc309)
      %306 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4773978112 : i64> loc(#loc310)
      %307 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4776075264 : i64> loc(#loc311)
      %308 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4776079360 : i64> loc(#loc312)
      %309 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4778176512 : i64> loc(#loc313)
      %310 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4778180608 : i64> loc(#loc314)
      %311 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4780277760 : i64> loc(#loc315)
      %312 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4780281856 : i64> loc(#loc316)
      %313 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4782379008 : i64> loc(#loc317)
      %314 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4782387200 : i64> loc(#loc318)
      %315 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4790775808 : i64> loc(#loc319)
      %316 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4790779904 : i64> loc(#loc320)
      %317 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4799168512 : i64> loc(#loc321)
      %318 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4799172608 : i64> loc(#loc322)
      %319 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4799176704 : i64> loc(#loc323)
      %320 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4799180800 : i64> loc(#loc324)
      %321 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4799184896 : i64> loc(#loc325)
      %322 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4799188992 : i64> loc(#loc326)
      %323 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4801286144 : i64> loc(#loc327)
      %324 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4801290240 : i64> loc(#loc328)
      %325 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4803387392 : i64> loc(#loc329)
      %326 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4803391488 : i64> loc(#loc330)
      %327 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4805488640 : i64> loc(#loc331)
      %328 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4805492736 : i64> loc(#loc332)
      %329 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4807589888 : i64> loc(#loc333)
      %330 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4807598080 : i64> loc(#loc334)
      %331 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4815986688 : i64> loc(#loc335)
      %332 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4815990784 : i64> loc(#loc336)
      %333 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4824379392 : i64> loc(#loc337)
      %334 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4824383488 : i64> loc(#loc338)
      %335 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4824387584 : i64> loc(#loc339)
      %336 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4824391680 : i64> loc(#loc340)
      %337 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4824395776 : i64> loc(#loc341)
      %338 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4824399872 : i64> loc(#loc342)
      %339 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4826497024 : i64> loc(#loc343)
      %340 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4826501120 : i64> loc(#loc344)
      %341 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4828598272 : i64> loc(#loc345)
      %342 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4828602368 : i64> loc(#loc346)
      %343 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4830699520 : i64> loc(#loc347)
      %344 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4830703616 : i64> loc(#loc348)
      %345 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4832800768 : i64> loc(#loc349)
      %346 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4832808960 : i64> loc(#loc350)
      %347 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4841197568 : i64> loc(#loc351)
      %348 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4841201664 : i64> loc(#loc352)
      %349 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4849590272 : i64> loc(#loc353)
      %350 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4849594368 : i64> loc(#loc354)
      %351 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4849598464 : i64> loc(#loc355)
      %352 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4849602560 : i64> loc(#loc356)
      %353 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4849606656 : i64> loc(#loc357)
      %354 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4849610752 : i64> loc(#loc358)
      %355 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4851707904 : i64> loc(#loc359)
      %356 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4851712000 : i64> loc(#loc360)
      %357 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4853809152 : i64> loc(#loc361)
      %358 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4853813248 : i64> loc(#loc362)
      %359 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4855910400 : i64> loc(#loc363)
      %360 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4855914496 : i64> loc(#loc364)
      %361 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4858011648 : i64> loc(#loc365)
      %362 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4858019840 : i64> loc(#loc366)
      %363 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4866408448 : i64> loc(#loc367)
      %364 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4866412544 : i64> loc(#loc368)
      %365 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4874801152 : i64> loc(#loc369)
      %366 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4874805248 : i64> loc(#loc370)
      %367 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4874809344 : i64> loc(#loc371)
      %368 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4874813440 : i64> loc(#loc372)
      %369 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4874817536 : i64> loc(#loc373)
      %370 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4874821632 : i64> loc(#loc374)
      %371 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4876918784 : i64> loc(#loc375)
      %372 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4876922880 : i64> loc(#loc376)
      %373 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4879020032 : i64> loc(#loc377)
      %374 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4879024128 : i64> loc(#loc378)
      %375 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4881121280 : i64> loc(#loc379)
      %376 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x1024xbf16, 4881125376 : i64> loc(#loc380)
      %377 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4883222528 : i64> loc(#loc381)
      %378 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1024x4096xbf16, 4883230720 : i64> loc(#loc382)
      %379 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4891619328 : i64> loc(#loc383)
      %380 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x1024xbf16, 4891623424 : i64> loc(#loc384)
      %381 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4900012032 : i64> loc(#loc385)
      %382 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4900016128 : i64> loc(#loc386)
      %383 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4900020224 : i64> loc(#loc387)
      %384 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4900024320 : i64> loc(#loc388)
      %385 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x4096xbf16, 4900028416 : i64> loc(#loc389)
      %386 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x4096xbf16, 4900036608 : i64> loc(#loc390)
      %387 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x2048xbf16, 4933591040 : i64> loc(#loc391)
      %388 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<4096x2048xbf16, 4933595136 : i64> loc(#loc392)
      %389 = "top.Weight"() {path = "tpu.LayerNorm.bias"} : () -> tensor<1x1024xbf16, 4950372352 : i64> loc(#loc393)
      %390 = "top.Weight"() {path = "tpu.LayerNorm.weight"} : () -> tensor<1x1024xbf16, 4950376448 : i64> loc(#loc394)
      %391 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1024xbf16, 4950380544 : i64> loc(#loc395)
      %392 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1536x1024xbf16, 4950384640 : i64> loc(#loc396)
      %393 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2304x1024xbf16, 4953530368 : i64> loc(#loc397)
      %394 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2304x16xbf16, 4958248960 : i64> loc(#loc398)
      %395 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2304x16xbf16, 4958322688 : i64> loc(#loc399)
      %396 = "tpu.Cast"(%arg0) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x1536xf32, 5033893888 : i64>) -> tensor<2304x1536xbf16, 4958396416 : i64> loc(#loc400)
      %397 = "tpu.Cast"(%arg3) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<2304x4x1xf32, 5053947904 : i64>) -> tensor<2304x4x1xbf16, 5048049664 : i64> loc(#loc401)
      %398 = "tpu.MatMul"(%396, %392, %391, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 0 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<2304x1536xbf16, 4958396416 : i64>, tensor<1536x1024xbf16, 4950384640 : i64>, tensor<1x1024xbf16, 4950380544 : i64>, none, none) -> tensor<2304x1024xbf16, 4996145152 : i64> loc(#loc402)
      %399 = "tpu.Gather"(%393, %arg2, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2304x1024xbf16, 4953530368 : i64>, tensor<2304x4xsi32, 5053984768 : i64>, none) -> tensor<2304x4x1024xbf16, 4977270784 : i64> loc(#loc403)
