#loc = loc(unknown)
#loc1 = loc("input_states")
#loc2 = loc("position_ids")
#loc3 = loc("attention_mask")
#loc4 = loc("history_k")
#loc5 = loc("history_v")
module @block_cache_23 attributes {module.FLOPs = 121722880 : i64, module.addr_mode = "io_alone", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.inputs = ["input_states", "position_ids", "attention_mask", "history_k", "history_v"], module.mode = "W4BF16", module.outputs = ["output_states", "k_cache", "v_cache"], module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "block_cache_23_tpu_addressed_bm1684x_w4bf16_weight.npz"} {
  module @block_cache_23 attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 27734016 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 27734016 : i64, module.io_addr = 4322701312 : i64, module.io_size = 4222976 : i64, module.neuron_addr = 4326924288 : i64, module.neuron_size = 57344 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x1x2048xf32> loc(unknown), %arg1: tensor<3x1xsi32> loc(unknown), %arg2: tensor<1x1x1x2049xf32> loc(unknown), %arg3: tensor<1x2048x2x256xf32> loc(unknown), %arg4: tensor<1x2048x2x256xf32> loc(unknown)) -> (tensor<1x1x2048xbf16, 4326920192 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64>) {
      %0 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16, 4322701312 : i64> loc(#loc1)
      %1 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1xsi32>) -> tensor<3x1xsi32, 4322705408 : i64> loc(#loc2)
      %2 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1x2049xf32>) -> tensor<1x1x1x2049xbf16, 4322709504 : i64> loc(#loc3)
      %3 = "top.Input"(%arg3) {do_preprocess = false} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xbf16, 4322717696 : i64> loc(#loc4)
      %4 = "top.Input"(%arg4) {do_preprocess = false} : (tensor<1x2048x2x256xf32>) -> tensor<1x2048x2x256xbf16, 4324818944 : i64> loc(#loc5)
      %5:3 = call @subfunc_0(%0, %1, %2, %3, %4) : (tensor<1x1x2048xbf16, 4322701312 : i64>, tensor<3x1xsi32, 4322705408 : i64>, tensor<1x1x1x2049xbf16, 4322709504 : i64>, tensor<1x2048x2x256xbf16, 4322717696 : i64>, tensor<1x2048x2x256xbf16, 4324818944 : i64>) -> (tensor<1x1x2048xbf16, 4326920192 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64>) loc(#loc)
      return %5#0, %5#1, %5#2 : tensor<1x1x2048xbf16, 4326920192 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x1x2048xbf16, 4322701312 : i64> loc("input_states"), %arg1: tensor<3x1xsi32, 4322705408 : i64> loc("position_ids"), %arg2: tensor<1x1x1x2049xbf16, 4322709504 : i64> loc("attention_mask"), %arg3: tensor<1x2048x2x256xbf16, 4322717696 : i64> loc("history_k"), %arg4: tensor<1x2048x2x256xbf16, 4324818944 : i64> loc("history_v")) -> (tensor<1x1x2048xbf16, 4326920192 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4294967296 : i64> loc(#loc6)
      %2 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x48xui8, 4294971392 : i64> loc(#loc7)
      %3 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x48xbf16, 4295069696 : i64> loc(#loc8)
      %4 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x3072xui8, 4295266304 : i64> loc(#loc9)
      %5 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4301557760 : i64> loc(#loc10)
      %6 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4301656064 : i64> loc(#loc11)
      %7 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4301852672 : i64> loc(#loc12)
      %8 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4308144128 : i64> loc(#loc13)
      %9 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4308242432 : i64> loc(#loc14)
      %10 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4308439040 : i64> loc(#loc15)
      %11 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4314730496 : i64> loc(#loc16)
      %12 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x256xbf16, 4314734592 : i64> loc(#loc17)
      %13 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x8x16xui8, 4314738688 : i64> loc(#loc18)
      %14 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x8x16xbf16, 4314746880 : i64> loc(#loc19)
      %15 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<512x1024xui8, 4314763264 : i64> loc(#loc20)
      %16 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4315287552 : i64> loc(#loc21)
      %17 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4315320320 : i64> loc(#loc22)
      %18 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4315385856 : i64> loc(#loc23)
      %19 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x256xbf16, 4317483008 : i64> loc(#loc24)
      %20 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x64x16xui8, 4317487104 : i64> loc(#loc25)
      %21 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x64x16xbf16, 4317552640 : i64> loc(#loc26)
      %22 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<4096x1024xui8, 4317683712 : i64> loc(#loc27)
      %23 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x8x16xui8, 4321878016 : i64> loc(#loc28)
      %24 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x8x16xbf16, 4321886208 : i64> loc(#loc29)
      %25 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<512x1024xui8, 4321902592 : i64> loc(#loc30)
      %26 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4322426880 : i64> loc(#loc31)
      %27 = "top.Weight"() {path = "tpu.Gather.index"} : () -> tensor<1x64xi32, 4322430976 : i64> loc(#loc32)
      %28 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2048x1x32xbf16, 4322435072 : i64> loc(#loc33)
      %29 = "top.Weight"() {path = "tpu.Gather.index"} : () -> tensor<1x64xi32, 4322566144 : i64> loc(#loc34)
      %30 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2048x1x32xbf16, 4322570240 : i64> loc(#loc35)
      %31 = "tpu.RMSNorm"(%arg0, %1) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xbf16, 4322701312 : i64>, tensor<1x1x2048xbf16, 4294967296 : i64>) -> tensor<1x1x2048xbf16, 4326924288 : i64> loc(#loc36)
      %32 = "tpu.A16MatMul"(%31, %22, %21, %20, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>, tensor<4096x1024xui8, 4317683712 : i64>, tensor<64x64x16xbf16, 4317552640 : i64>, tensor<64x64x16xui8, 4317487104 : i64>, none) -> tensor<1x1x4096xbf16, 4326928384 : i64> loc(#loc37)
      %33 = "tpu.Reshape"(%32) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1x4096xbf16, 4326928384 : i64>) -> tensor<1x1x8x512xbf16, 4326928384 : i64> loc(#loc38)
      %34:2 = "tpu.Group"(%33) ({
        %65 = "tpu.Load"(%33) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [512], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x8x512xbf16, 4326928384 : i64>) -> tensor<1x1x8x512xbf16> loc(#loc41)
        %66 = "tpu.Slice"(%65, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 256], ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 1, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x8x512xbf16>, none, none, none, none) -> tensor<1x1x8x256xbf16> loc(#loc39)
        %67 = "tpu.Store"(%66, %0) {ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 2, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x1x8x256xbf16>, none) -> tensor<1x1x8x256xbf16, 4326936576 : i64> loc(#loc39)
        %68 = "tpu.Slice"(%65, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 512], ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1x8x512xbf16>, none, none, none, none) -> tensor<1x1x8x256xbf16> loc(#loc42)
        %69 = "tpu.Cast"(%68) {ginfo = #tpu.lg<out_addr = 16384, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 4, stage = 1, slice_idx = 0, group_type = 0>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x8x256xbf16>) -> tensor<1x1x8x256xf32> loc(#loc40)
        %70 = "tpu.Store"(%69, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 5, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x1x8x256xf32>, none) -> tensor<1x1x8x256xf32, 4326940672 : i64> loc(#loc40)
        "tpu.Yield"(%67, %70) : (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x1x8x256xf32, 4326940672 : i64>) -> () loc(#loc100)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, 5, -2, 3, 2, -3, 4, 0], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x8x512xbf16, 4326928384 : i64>) -> (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x1x8x256xf32, 4326940672 : i64>) loc(#loc100)
      %35 = "tpu.Active"(%34#1) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1x8x256xf32, 4326940672 : i64>) -> tensor<1x1x8x256xf32, 4326928384 : i64> loc(#loc43)
      %36 = "tpu.A16MatMul"(%31, %15, %14, %13, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>, tensor<512x1024xui8, 4314763264 : i64>, tensor<64x8x16xbf16, 4314746880 : i64>, tensor<64x8x16xui8, 4314738688 : i64>, none) -> tensor<1x1x512xbf16, 4326940672 : i64> loc(#loc44)
      %37 = "tpu.A16MatMul"(%31, %25, %24, %23, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>, tensor<512x1024xui8, 4321902592 : i64>, tensor<64x8x16xbf16, 4321886208 : i64>, tensor<64x8x16xui8, 4321878016 : i64>, none) -> tensor<1x1x512xbf16, 4326916096 : i64> loc(#loc45)
      %38 = "tpu.Reshape"(%36) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x512xbf16, 4326940672 : i64>) -> tensor<1x1x2x256xbf16, 4326940672 : i64> loc(#loc46)
      %39 = "tpu.Reshape"(%37) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x1x512xbf16, 4326916096 : i64>) -> tensor<1x1x2x256xbf16, 4326916096 : i64> loc(#loc47)
      %40:2 = "tpu.Group"(%34#0, %38) ({
        %65 = "tpu.Load"(%34#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [8], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 2>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x8x256xbf16, 4326936576 : i64>) -> tensor<1x1x8x256xbf16> loc(#loc50)
        %66 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 1, stage = 0, slice_idx = 0, group_type = 2>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xbf16, 4317483008 : i64>) -> tensor<1x1x1x256xbf16> loc(#loc51)
        %67 = "tpu.Load"(%38) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [2], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 2>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2x256xbf16, 4326940672 : i64>) -> tensor<1x1x2x256xbf16> loc(#loc52)
        %68 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 2>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xbf16, 4314734592 : i64>) -> tensor<1x1x1x256xbf16> loc(#loc53)
        %69 = "tpu.RMSNorm"(%65, %66) {eps = 9.9999999999999995E-7 : f64, ginfo = #tpu.lg<out_addr = 0, out_size = 512, buffer_addr = 81920, buffer_size = 2112, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [8], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 2>, weight_keep_f32 = false} : (tensor<1x1x8x256xbf16>, tensor<1x1x1x256xbf16>) -> tensor<1x1x8x256xbf16> loc(#loc48)
        %70 = "tpu.Store"(%69, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [8], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 2>, support_compress = true} : (tensor<1x1x8x256xbf16>, none) -> tensor<1x1x8x256xbf16, 4326924288 : i64> loc(#loc48)
        %71 = "tpu.RMSNorm"(%67, %68) {eps = 9.9999999999999995E-7 : f64, ginfo = #tpu.lg<out_addr = 98304, out_size = 512, buffer_addr = 81920, buffer_size = 2112, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [2], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 6, stage = 1, slice_idx = 0, group_type = 2>, weight_keep_f32 = false} : (tensor<1x1x2x256xbf16>, tensor<1x1x1x256xbf16>) -> tensor<1x1x2x256xbf16> loc(#loc49)
        %72 = "tpu.Store"(%71, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [2], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [256], w_idx = [0], w_slice = [1], id = 7, stage = 2, slice_idx = 0, group_type = 2>, support_compress = true} : (tensor<1x1x2x256xbf16>, none) -> tensor<1x1x2x256xbf16, 4326944768 : i64> loc(#loc49)
        "tpu.Yield"(%70, %72) : (tensor<1x1x8x256xbf16, 4326924288 : i64>, tensor<1x1x2x256xbf16, 4326944768 : i64>) -> () loc(#loc101)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 2, 3, 7, -2, 6, 5, 0, 1], group_type = 2 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x1x2x256xbf16, 4326940672 : i64>) -> (tensor<1x1x8x256xbf16, 4326924288 : i64>, tensor<1x1x2x256xbf16, 4326944768 : i64>) loc(#loc101)
      %41 = "tpu.Gather"(%28, %arg1, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16, 4322435072 : i64>, tensor<3x1xsi32, 4322705408 : i64>, none) -> tensor<3x1x1x32xbf16, 4326936576 : i64> loc(#loc54)
      %42 = "tpu.Reshape"(%41) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x1x1x32xbf16, 4326936576 : i64>) -> tensor<96x1x1xbf16, 4326936576 : i64> loc(#loc55)
      %43 = "tpu.Gather"(%42, %27, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1xbf16, 4326936576 : i64>, tensor<1x64xi32, 4322430976 : i64>, none) -> tensor<1x64x1x1xbf16, 4326940672 : i64> loc(#loc56)
      %44 = "tpu.Reshape"(%43, %0) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x64x1x1xbf16, 4326940672 : i64>, none) -> tensor<1x1x1x64xbf16, 4326940672 : i64> loc(#loc57)
      %45 = "tpu.Gather"(%30, %arg1, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16, 4322570240 : i64>, tensor<3x1xsi32, 4322705408 : i64>, none) -> tensor<3x1x1x32xbf16, 4326936576 : i64> loc(#loc58)
      %46 = "tpu.Reshape"(%45) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x1x1x32xbf16, 4326936576 : i64>) -> tensor<96x1x1xbf16, 4326936576 : i64> loc(#loc59)
      %47 = "tpu.Gather"(%46, %29, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1xbf16, 4326936576 : i64>, tensor<1x64xi32, 4322566144 : i64>, none) -> tensor<1x64x1x1xbf16, 4326948864 : i64> loc(#loc60)
      %48 = "tpu.Reshape"(%47, %0) {flatten_start_dim = -1 : i64, shape = []} : (tensor<1x64x1x1xbf16, 4326948864 : i64>, none) -> tensor<1x1x1x64xbf16, 4326948864 : i64> loc(#loc61)
      %49:2 = "tpu.Group"(%40#0, %48, %44, %40#1) ({
        %65 = "tpu.Load"(%40#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 0, stage = 0, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x8x256xbf16, 4326924288 : i64>) -> tensor<1x1x8x256xbf16> loc(#loc64)
        %66 = "tpu.Slice"(%65, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 64], ginfo = #tpu.lg<out_addr = 19456, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [64], id = 1, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x8x256xbf16>, none, none, none, none) -> tensor<1x1x8x64xbf16> loc(#loc65)
        %67 = "tpu.Load"(%48) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 2, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x64xbf16, 4326948864 : i64>) -> tensor<1x1x1x64xbf16> loc(#loc66)
        %68 = "tpu.Load"(%44) {do_bcast = false, ginfo = #tpu.lg<out_addr = 81920, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x64xbf16, 4326940672 : i64>) -> tensor<1x1x1x64xbf16> loc(#loc67)
        %69 = "tpu.Slice"(%65, %0, %0, %0, %0) {axes = [], ends = [1, 1, 8, 256], ginfo = #tpu.lg<out_addr = 16384, out_size = 3072, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [192], id = 4, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1x8x256xbf16>, none, none, none, none) -> tensor<1x1x8x192xbf16> loc(#loc68)
        %70 = "tpu.Rope"(%66, %67, %68) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 1024, buffer_addr = 0, buffer_size = 2048, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [64], id = 5, stage = 1, slice_idx = 0, group_type = 0>, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1x8x64xbf16>, tensor<1x1x1x64xbf16>, tensor<1x1x1x64xbf16>) -> tensor<1x1x8x64xbf16> loc(#loc69)
        %71 = "tpu.Load"(%40#1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [256], id = 6, stage = 1, slice_idx = 0, group_type = 0>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2x256xbf16, 4326944768 : i64>) -> tensor<1x1x2x256xbf16> loc(#loc70)
        %72 = "tpu.Concat"(%70, %69) {axis = 3 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 7, stage = 1, slice_idx = 0, group_type = 0>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x8x64xbf16>, tensor<1x1x8x192xbf16>) -> tensor<1x1x8x256xbf16> loc(#loc62)
        %73 = "tpu.Slice"(%71, %0, %0, %0, %0) {axes = [], ends = [1, 1, 2, 64], ginfo = #tpu.lg<out_addr = 17152, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [64], id = 8, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1x2x256xbf16>, none, none, none, none) -> tensor<1x1x2x64xbf16> loc(#loc71)
        %74 = "tpu.Store"(%72, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 9, stage = 1, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x1x8x256xbf16>, none) -> tensor<1x1x8x256xbf16, 4326936576 : i64> loc(#loc62)
        %75 = "tpu.Slice"(%71, %0, %0, %0, %0) {axes = [], ends = [1, 1, 2, 256], ginfo = #tpu.lg<out_addr = 16384, out_size = 768, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [192], id = 10, stage = 1, slice_idx = 0, group_type = 0>, hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1x2x256xbf16>, none, none, none, none) -> tensor<1x1x2x192xbf16> loc(#loc72)
        %76 = "tpu.Rope"(%73, %67, %68) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 256, buffer_addr = 33792, buffer_size = 512, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [64], id = 11, stage = 1, slice_idx = 0, group_type = 0>, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1x2x64xbf16>, tensor<1x1x1x64xbf16>, tensor<1x1x1x64xbf16>) -> tensor<1x1x2x64xbf16> loc(#loc73)
        %77 = "tpu.Concat"(%76, %75) {axis = 3 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [256], id = 12, stage = 1, slice_idx = 0, group_type = 0>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2x64xbf16>, tensor<1x1x2x192xbf16>) -> tensor<1x1x2x256xbf16> loc(#loc63)
        %78 = "tpu.Store"(%77, %0) {ginfo = #tpu.lg<out_addr = 32768, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [256], id = 13, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x1x2x256xbf16>, none) -> tensor<1x1x2x256xbf16, 4324814848 : i64> loc(#loc63)
        "tpu.Yield"(%74, %78) : (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>) -> () loc(#loc102)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, -2, 4, 2, 3, -3, 5, 13, -4, 7, 6, -5, 8, -6, 10, 11, 9, -7, 12, 0], group_type = 0 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x8x256xbf16, 4326924288 : i64>, tensor<1x1x1x64xbf16, 4326948864 : i64>, tensor<1x1x1x64xbf16, 4326940672 : i64>, tensor<1x1x2x256xbf16, 4326944768 : i64>) -> (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>) loc(#loc102)
      %50 = "tpu.Concat"(%arg3, %49#1) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x2048x2x256xbf16, 4322717696 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>) -> tensor<1x2049x2x256xbf16, 4322717696 : i64> loc(#loc74)
      %51 = "tpu.Concat"(%arg4, %39) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x2048x2x256xbf16, 4324818944 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64>) -> tensor<1x2049x2x256xbf16, 4324818944 : i64> loc(#loc75)
      %52 = "tpu.FAttention"(%49#0, %50, %51, %arg2, %0) {batch = 1 : i64, dim = 256 : i64, keep_dims = false, kv_head = 2 : i64, mk = 2049 : i64, mq = 1 : i64, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1x8x256xbf16, 4326936576 : i64>, tensor<1x2049x2x256xbf16, 4322717696 : i64>, tensor<1x2049x2x256xbf16, 4324818944 : i64>, tensor<1x1x1x2049xbf16, 4322709504 : i64>, none) -> tensor<1x1x2048xbf16, 4326924288 : i64> loc(#loc76)
      %53 = "tpu.Reshape"(%35) {flatten_start_dim = -1 : i64, shape = [1, 1, 2048]} : (tensor<1x1x8x256xf32, 4326928384 : i64>) -> tensor<1x1x2048xf32, 4326928384 : i64> loc(#loc77)
      %54 = "tpu.Group"(%53, %52) ({
        %65 = "tpu.Load"(%53) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8192, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xf32, 4326928384 : i64>) -> tensor<1x1x2048xf32> loc(#loc79)
        %66 = "tpu.Load"(%52) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>) -> tensor<1x1x2048xbf16> loc(#loc80)
        %67 = "tpu.Cast"(%65) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xbf16> loc(#loc81)
        %68 = "tpu.Mul"(%66, %67) {do_relu = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc78)
        %69 = "tpu.Store"(%68, %0) {ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 4, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326936576 : i64> loc(#loc78)
        "tpu.Yield"(%69) : (tensor<1x1x2048xbf16, 4326936576 : i64>) -> () loc(#loc78)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 2, 1, 4, -2, 3, 0], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xf32, 4326928384 : i64>, tensor<1x1x2048xbf16, 4326924288 : i64>) -> tensor<1x1x2048xbf16, 4326936576 : i64> loc(#loc78)
      %55 = "tpu.A16MatMul"(%54, %18, %17, %16, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326936576 : i64>, tensor<2048x1024xui8, 4315385856 : i64>, tensor<64x32x16xbf16, 4315320320 : i64>, tensor<64x32x16xui8, 4315287552 : i64>, none) -> tensor<1x1x2048xbf16, 4326924288 : i64> loc(#loc82)
      %56:2 = "tpu.Group"(%arg0, %55) ({
        %65 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4322701312 : i64>) -> tensor<1x1x2048xbf16> loc(#loc85)
        %66 = "tpu.Load"(%55) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>) -> tensor<1x1x2048xbf16> loc(#loc86)
        %67 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4314730496 : i64>) -> tensor<1x1x2048xbf16> loc(#loc87)
        %68 = "tpu.Add"(%65, %66) {do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc83)
        %69 = "tpu.Store"(%68, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326948864 : i64> loc(#loc83)
        %70 = "tpu.RMSNorm"(%68, %67) {eps = 9.9999999999999995E-7 : f64, ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 65536, buffer_size = 16448, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 4>, weight_keep_f32 = false} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc84)
        %71 = "tpu.Store"(%70, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 6, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326952960 : i64> loc(#loc84)
        "tpu.Yield"(%69, %71) : (tensor<1x1x2048xbf16, 4326948864 : i64>, tensor<1x1x2048xbf16, 4326952960 : i64>) -> () loc(#loc103)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 6, -2, 5, 4, 0, 1], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xbf16, 4322701312 : i64>, tensor<1x1x2048xbf16, 4326924288 : i64>) -> (tensor<1x1x2048xbf16, 4326948864 : i64>, tensor<1x1x2048xbf16, 4326952960 : i64>) loc(#loc103)
      %57 = "tpu.A16MatMul"(%56#1, %7, %6, %5, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326952960 : i64>, tensor<6144x1024xui8, 4301852672 : i64>, tensor<64x96x16xbf16, 4301656064 : i64>, tensor<64x96x16xui8, 4301557760 : i64>, none) -> tensor<1x1x6144xbf16, 4326924288 : i64> loc(#loc88)
      %58 = "tpu.Cast"(%57) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xbf16, 4326924288 : i64>) -> tensor<1x1x6144xf32, 4326957056 : i64> loc(#loc89)
      %59 = "tpu.Active"(%58) {mode = #tpu<active_mode SILU>} : (tensor<1x1x6144xf32, 4326957056 : i64>) -> tensor<1x1x6144xf32, 4326924288 : i64> loc(#loc90)
      %60 = "tpu.Cast"(%59) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1x6144xf32, 4326924288 : i64>) -> tensor<1x1x6144xbf16, 4326957056 : i64> loc(#loc91)
      %61 = "tpu.A16MatMul"(%56#1, %10, %9, %8, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xbf16, 4326952960 : i64>, tensor<6144x1024xui8, 4308439040 : i64>, tensor<64x96x16xbf16, 4308242432 : i64>, tensor<64x96x16xui8, 4308144128 : i64>, none) -> tensor<1x1x6144xbf16, 4326924288 : i64> loc(#loc92)
      %62 = "tpu.Mul"(%60, %61) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1x6144xbf16, 4326957056 : i64>, tensor<1x1x6144xbf16, 4326924288 : i64>) -> tensor<1x1x6144xbf16, 4326936576 : i64> loc(#loc93)
      %63 = "tpu.A16MatMul"(%62, %4, %3, %2, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x6144xbf16, 4326936576 : i64>, tensor<2048x3072xui8, 4295266304 : i64>, tensor<64x32x48xbf16, 4295069696 : i64>, tensor<64x32x48xui8, 4294971392 : i64>, none) -> tensor<1x1x2048xbf16, 4326924288 : i64> loc(#loc94)
      %64 = "tpu.Group"(%56#0, %63) ({
        %65 = "tpu.Load"(%56#0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326948864 : i64>) -> tensor<1x1x2048xbf16> loc(#loc96)
        %66 = "tpu.Load"(%63) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4326924288 : i64>) -> tensor<1x1x2048xbf16> loc(#loc97)
        %67 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x2048xbf16, 4322426880 : i64>) -> tensor<1x1x2048xbf16> loc(#loc98)
        %68 = "tpu.Add"(%65, %66) {do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc99)
        %69 = "tpu.RMSNorm"(%68, %67) {eps = 9.9999999999999995E-7 : f64, ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 65536, buffer_size = 16448, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, weight_keep_f32 = false} : (tensor<1x1x2048xbf16>, tensor<1x1x2048xbf16>) -> tensor<1x1x2048xbf16> loc(#loc95)
        %70 = "tpu.Store"(%69, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2048], w_idx = [0], w_slice = [1], id = 5, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1x2048xbf16>, none) -> tensor<1x1x2048xbf16, 4326920192 : i64> loc(#loc95)
        "tpu.Yield"(%70) : (tensor<1x1x2048xbf16, 4326920192 : i64>) -> () loc(#loc95)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 5, -2, 4, 0, 1], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1x2048xbf16, 4326948864 : i64>, tensor<1x1x2048xbf16, 4326924288 : i64>) -> tensor<1x1x2048xbf16, 4326920192 : i64> loc(#loc95)
      return %64, %49#1, %39 : tensor<1x1x2048xbf16, 4326920192 : i64>, tensor<1x1x2x256xbf16, 4324814848 : i64>, tensor<1x1x2x256xbf16, 4326916096 : i64> loc(#loc)
    } loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc6 = loc("model.language_model.layers.23.input_layernorm.weight_bf16")
#loc7 = loc("model.language_model.layers.23.mlp.down_proj_1_reordered")
#loc8 = loc("model.language_model.layers.23.mlp.down_proj_reordered")
#loc9 = loc("model.language_model.layers.23.mlp.down_proj_weight")
#loc10 = loc("model.language_model.layers.23.mlp.gate_proj_1_reordered")
#loc11 = loc("model.language_model.layers.23.mlp.gate_proj_reordered")
#loc12 = loc("model.language_model.layers.23.mlp.gate_proj_weight")
#loc13 = loc("model.language_model.layers.23.mlp.up_proj_1_reordered")
#loc14 = loc("model.language_model.layers.23.mlp.up_proj_reordered")
#loc15 = loc("model.language_model.layers.23.mlp.up_proj_weight")
#loc16 = loc("model.language_model.layers.23.post_attention_layernorm.weight_bf16")
#loc17 = loc("model.language_model.layers.23.self_attn.k_norm.weight_bf16")
#loc18 = loc("model.language_model.layers.23.self_attn.k_proj_1_reordered")
#loc19 = loc("model.language_model.layers.23.self_attn.k_proj_reordered")
#loc20 = loc("model.language_model.layers.23.self_attn.k_proj_weight")
#loc21 = loc("model.language_model.layers.23.self_attn.o_proj_1_reordered")
#loc22 = loc("model.language_model.layers.23.self_attn.o_proj_reordered")
#loc23 = loc("model.language_model.layers.23.self_attn.o_proj_weight")
#loc24 = loc("model.language_model.layers.23.self_attn.q_norm.weight_bf16")
#loc25 = loc("model.language_model.layers.23.self_attn.q_proj_1_reordered")
#loc26 = loc("model.language_model.layers.23.self_attn.q_proj_reordered")
#loc27 = loc("model.language_model.layers.23.self_attn.q_proj_weight")
#loc28 = loc("model.language_model.layers.23.self_attn.v_proj_1_reordered")
#loc29 = loc("model.language_model.layers.23.self_attn.v_proj_reordered")
#loc30 = loc("model.language_model.layers.23.self_attn.v_proj_weight")
#loc31 = loc("model.language_model.norm.weight_bf16")
#loc32 = loc("mrope_interleave_idx_int")
#loc33 = loc("rotary_cos.weight_bf16")
#loc34 = loc("rotary_sin.gathermrope_interleave_idx_int")
#loc35 = loc("rotary_sin.weight_bf16")
#loc36 = loc("model.language_model.layers.23.input_layernorm")
#loc37 = loc("model.language_model.layers.23.self_attn.q_proj")
#loc38 = loc("model.language_model.layers.23.self_attn.q_proj.reshape")
#loc39 = loc("model.language_model.layers.23.self_attn.q_proj.q_slice")
#loc40 = loc("model.language_model.layers.23.self_attn.q_proj.gate_slicemodel.language_model.layers.23.mlp.gate_proj.gate_sigmoid_f32")
#loc41 = loc("load_model.language_model.layers.23.self_attn.q_proj.reshape")
#loc42 = loc("model.language_model.layers.23.self_attn.q_proj.gate_slice")
#loc43 = loc("model.language_model.layers.23.mlp.gate_proj.gate_sigmoid")
#loc44 = loc("model.language_model.layers.23.self_attn.k_proj")
#loc45 = loc("model.language_model.layers.23.self_attn.v_proj")
#loc46 = loc("model.language_model.layers.23.self_attn.k_proj.reshape")
#loc47 = loc("v_cache")
#loc48 = loc("model.language_model.layers.23.self_attn.q_norm")
#loc49 = loc("model.language_model.layers.23.self_attn.k_norm")
#loc50 = loc("load_model.language_model.layers.23.self_attn.q_proj.q_slice")
#loc51 = loc("load_model.language_model.layers.23.self_attn.q_norm.weight_bf16")
#loc52 = loc("load_model.language_model.layers.23.self_attn.k_proj.reshape")
#loc53 = loc("load_model.language_model.layers.23.self_attn.k_norm.weight_bf16")
#loc54 = loc("rotary_cos")
#loc55 = loc("rotary_cos.reshape")
#loc56 = loc("rotary_cos.gather")
#loc57 = loc("rotary_cos.permute2")
#loc58 = loc("rotary_sin")
#loc59 = loc("rotary_sin.reshape")
#loc60 = loc("rotary_sin.gather")
#loc61 = loc("rotary_sin.permute2")
#loc62 = loc("q_proj")
#loc63 = loc("k_cache")
#loc64 = loc("load_model.language_model.layers.23.self_attn.q_norm")
#loc65 = loc("q_proj.slice")
#loc66 = loc("load_rotary_sin.permute2")
#loc67 = loc("load_rotary_cos.permute2")
#loc68 = loc("q_proj.slice2")
#loc69 = loc("q_proj.rope")
#loc70 = loc("load_model.language_model.layers.23.self_attn.k_norm")
#loc71 = loc("k_proj.slice")
#loc72 = loc("k_proj.slice2")
#loc73 = loc("k_proj.rope")
#loc74 = loc("model.language_model.layers.23.self_attn.k_proj.concat")
#loc75 = loc("model.language_model.layers.23.self_attn.v_proj.concat")
#loc76 = loc("model.language_model.layers.23.fattention")
#loc77 = loc("model.language_model.layers.23.mlp.gate_proj.gate_reshape")
#loc78 = loc("model.language_model.layers.23.mlp.gate_proj.gate_mul")
#loc79 = loc("load_model.language_model.layers.23.mlp.gate_proj.gate_reshape")
#loc80 = loc("load_model.language_model.layers.23.fattention")
#loc81 = loc("model.language_model.layers.23.mlp.gate_proj.gate_reshapemodel.language_model.layers.23.mlp.gate_proj.gate_mul_bf16")
#loc82 = loc("model.language_model.layers.23.self_attn.o_proj")
#loc83 = loc("model.language_model.layers.23.self_attn.o_proj.add")
#loc84 = loc("model.language_model.layers.23.post_attention_layernorm")
#loc85 = loc("load_0")
#loc86 = loc("load_model.language_model.layers.23.self_attn.o_proj")
#loc87 = loc("load_model.language_model.layers.23.post_attention_layernorm.weight_bf16")
#loc88 = loc("model.language_model.layers.23.mlp.gate_proj")
#loc89 = loc("model.language_model.layers.23.mlp.gate_projmodel.language_model.layers.23.mlp.gate_proj.silu_f32")
#loc90 = loc("model.language_model.layers.23.mlp.gate_proj.silu")
#loc91 = loc("model.language_model.layers.23.mlp.gate_proj.silumodel.language_model.layers.23.mlp.up_proj.mul_bf16")
#loc92 = loc("model.language_model.layers.23.mlp.up_proj")
#loc93 = loc("model.language_model.layers.23.mlp.up_proj.mul")
#loc94 = loc("model.language_model.layers.23.mlp.down_proj")
