#loc = loc(unknown)
module @block_21 attributes {module.chip = "ALL", module.platform = "LLM_QUANTIZED", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "../block_21_top_weights.npz"} {
  func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1024x2048xf32>, tensor<1x6144x4xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc1)
    %2 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xf32> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc3)
    %4 = "top.RMSNorm"(%1, %3) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc4)
    %5 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc7)
    %8 = "top.A16MatMul"(%4, %5, %6, %7, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xf32> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc11)
    %12 = "top.A16MatMul"(%4, %9, %10, %11, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<2048x1024xui8>, tensor<2048x16xf32>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xf32> loc(#loc12)
    %13 = "top.SiLU"(%12) : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc14)
    %15 = "top.MatMul"(%4, %14, %0) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x1024x2048xf32>, tensor<2048x16xf32>, none) -> tensor<1x1024x16xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<1x1x16xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc17)
    %18 = "top.MatMul"(%4, %17, %16) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x1024x2048xf32>, tensor<2048x16xf32>, tensor<1x1x16xf32>) -> tensor<1x1024x16xf32> loc(#loc18)
    %19 = "top.Permute"(%8) {order = [0, 2, 1]} : (tensor<1x1024x6144xf32>) -> tensor<1x6144x1024xf32> loc(#loc19)
    %20 = "top.Slice"(%19, %0, %0, %0) {axes = [], ends = [1, 6144, 1024], hasparamConvert_axes = [], offset = [0, 0, -4], steps = [1, 1, 1]} : (tensor<1x6144x1024xf32>, none, none, none) -> tensor<1x6144x4xf32> loc(#loc20)
    %21 = "top.Reshape"(%19) {flatten_start_dim = -1 : i64, shape = [1, 6144, 1, -1]} : (tensor<1x6144x1024xf32>) -> tensor<1x6144x1x1024xf32> loc(#loc21)
    %22 = "top.Weight"() : () -> tensor<6144x1x1x4xf32> loc(#loc22)
    %23 = "top.Conv"(%21, %22, %0) {do_relu = false, dynweight_reorderd = false, group = 6144 : i64, kernel_shape = [1, 4], pads = [0, 3, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x6144x1x1024xf32>, tensor<6144x1x1x4xf32>, none) -> tensor<1x6144x1x1024xf32> loc(#loc23)
    %24 = "top.SiLU"(%23) : (tensor<1x6144x1x1024xf32>) -> tensor<1x6144x1x1024xf32> loc(#loc24)
    %25 = "top.Reshape"(%24) {flatten_start_dim = -1 : i64, shape = [1, 48, 128, -1]} : (tensor<1x6144x1x1024xf32>) -> tensor<1x48x128x1024xf32> loc(#loc25)
    %26 = "top.Slice"(%25, %0, %0, %0) {axes = [], ends = [1, 16, 128, 1024], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xf32>, none, none, none) -> tensor<1x16x128x1024xf32> loc(#loc26)
    %27 = "top.Slice"(%25, %0, %0, %0) {axes = [], ends = [1, 32, 128, 1024], hasparamConvert_axes = [], offset = [0, 16, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xf32>, none, none, none) -> tensor<1x16x128x1024xf32> loc(#loc27)
    %28 = "top.Slice"(%25, %0, %0, %0) {axes = [], ends = [1, 48, 128, 1024], hasparamConvert_axes = [], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xf32>, none, none, none) -> tensor<1x16x128x1024xf32> loc(#loc28)
    %29 = "top.Permute"(%26) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xf32>) -> tensor<1x1024x16x128xf32> loc(#loc29)
    %30 = "top.Permute"(%27) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xf32>) -> tensor<1x1024x16x128xf32> loc(#loc30)
    %31 = "top.Permute"(%28) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xf32>) -> tensor<1x1024x16x128xf32> loc(#loc31)
    %32 = "top.Sigmoid"(%15) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xf32> loc(#loc32)
    %33 = "top.Softplus"(%18) : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xf32> loc(#loc33)
    %34 = "top.Weight"() : () -> tensor<1x1x16xf32> loc(#loc34)
    %35 = "top.Mul"(%33, %34) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x16xf32>, tensor<1x1x16xf32>) -> tensor<1x1024x16xf32> loc(#loc35)
    %36 = "top.Weight"() : () -> tensor<64x64xf32> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<64x64xf32> loc(#loc37)
    %38 = "top.Weight"() : () -> tensor<64x64xf32> loc(#loc38)
    %39 = "top.Weight"() : () -> tensor<64x64xf32> loc(#loc39)
    %40 = "top.ChunkGatedDeltaRule"(%29, %30, %31, %35, %32, %2, %36, %37, %38, %39) {chunk_size = 64 : i64, d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x1024x16x128xf32>, tensor<1x1024x16x128xf32>, tensor<1x1024x16x128xf32>, tensor<1x1024x16xf32>, tensor<1x1024x16xf32>, tensor<1x16x128x128xf32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>, tensor<64x64xf32>) -> tensor<1x1024x16x128xf32> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<1x1x1x128xf32> loc(#loc41)
    %42 = "top.RMSNorm"(%40, %41) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x16x128xf32>, tensor<1x1x1x128xf32>) -> tensor<1x1024x16x128xf32> loc(#loc42)
    %43 = "top.Reshape"(%42) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x16x128xf32>) -> tensor<1x1024x2048xf32> loc(#loc43)
    %44 = "top.Mul"(%43, %13) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc45)
    %46 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc47)
    %48 = "top.A16MatMul"(%44, %45, %46, %47, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<2048x1024xui8>, tensor<2048x16xf32>, tensor<2048x16xui8>, none) -> tensor<1x1024x2048xf32> loc(#loc48)
    %49 = "top.Add"(%1, %48) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc50)
    %51 = "top.RMSNorm"(%49, %50) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc54)
    %55 = "top.A16MatMul"(%51, %52, %53, %54, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xf32> loc(#loc55)
    %56 = "top.SiLU"(%55) : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc59)
    %60 = "top.A16MatMul"(%51, %57, %58, %59, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1024x6144xf32> loc(#loc60)
    %61 = "top.Mul"(%56, %60) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x6144xf32>, tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<2048x48xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc64)
    %65 = "top.A16MatMul"(%61, %62, %63, %64, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xf32>, tensor<2048x3072xui8>, tensor<2048x48xf32>, tensor<2048x48xui8>, none) -> tensor<1x1024x2048xf32> loc(#loc65)
    %66 = "top.Add"(%49, %65) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xf32>, tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc66)
    return %66, %20 : tensor<1x1024x2048xf32>, tensor<1x6144x4xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("recurrent_states")
#loc3 = loc("model.language_model.layers.21.input_layernorm.weight")
#loc4 = loc("model.language_model.layers.21.input_layernorm")
#loc5 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.qweight")
#loc6 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.scales")
#loc7 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.qzeros")
#loc8 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv")
#loc9 = loc("model.language_model.layers.21.linear_attn.in_proj_z.qweight")
#loc10 = loc("model.language_model.layers.21.linear_attn.in_proj_z.scales")
#loc11 = loc("model.language_model.layers.21.linear_attn.in_proj_z.qzeros")
#loc12 = loc("model.language_model.layers.21.linear_attn.in_proj_z")
#loc13 = loc("model.language_model.layers.21.linear_attn.in_proj_z.silu")
#loc14 = loc("model.language_model.layers.21.linear_attn.in_proj_b.weight")
#loc15 = loc("model.language_model.layers.21.linear_attn.in_proj_b")
#loc16 = loc("model.language_model.layers.21.linear_attn.in_proj_a.bias")
#loc17 = loc("model.language_model.layers.21.linear_attn.in_proj_a.weight")
#loc18 = loc("model.language_model.layers.21.linear_attn.in_proj_a")
#loc19 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.permute")
#loc20 = loc("conv_states")
#loc21 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.reshape_to_conv2d")
#loc22 = loc("model.language_model.layers.21.linear_attn.conv1d.weight")
#loc23 = loc("model.language_model.layers.21.linear_attn.conv1d")
#loc24 = loc("model.language_model.layers.21.linear_attn.conv1d.silu")
#loc25 = loc("model.language_model.layers.21.linear_attn.conv1d.reshape_after_conv")
#loc26 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.q_slice_after_conv")
#loc27 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.k_slice_after_conv")
#loc28 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.v_slice_after_conv")
#loc29 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.q_permute_after_conv")
#loc30 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.k_permute_after_conv")
#loc31 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.v_permute_after_conv")
#loc32 = loc("model.language_model.layers.21.linear_attn.in_proj_b.sigmoid")
#loc33 = loc("model.language_model.layers.21.linear_attn.in_proj_a.softplus")
#loc34 = loc("model.language_model.layers.21.linear_attn.A_log.weight")
#loc35 = loc("model.language_model.layers.21.linear_attn.in_proj_a.mul")
#loc36 = loc("model.language_model.layers.21.linear_attn.triu_mask")
#loc37 = loc("model.language_model.layers.21.linear_attn.strict_triu_mask")
#loc38 = loc("model.language_model.layers.21.linear_attn.tril_mask")
#loc39 = loc("model.language_model.layers.21.linear_attn.eye")
#loc40 = loc("model.language_model.layers.21.chunk_gated_delta_rule")
#loc41 = loc("model.language_model.layers.21.linear_attn.norm.weight")
#loc42 = loc("model.language_model.layers.21.linear_attn.norm")
#loc43 = loc("model.language_model.layers.21.linear_attn.in_proj_qkv.core_attn_reshape")
#loc44 = loc("model.language_model.layers.21.linear_attn.in_proj_z.core_attn_mul")
#loc45 = loc("model.language_model.layers.21.linear_attn.out_proj.qweight")
#loc46 = loc("model.language_model.layers.21.linear_attn.out_proj.scales")
#loc47 = loc("model.language_model.layers.21.linear_attn.out_proj.qzeros")
#loc48 = loc("model.language_model.layers.21.linear_attn.out_proj")
#loc49 = loc("model.language_model.layers.21.linear_attn.out_proj.add")
#loc50 = loc("model.language_model.layers.21.post_attention_layernorm.weight")
#loc51 = loc("model.language_model.layers.21.post_attention_layernorm")
#loc52 = loc("model.language_model.layers.21.mlp.gate_proj.qweight")
#loc53 = loc("model.language_model.layers.21.mlp.gate_proj.scales")
#loc54 = loc("model.language_model.layers.21.mlp.gate_proj.qzeros")
#loc55 = loc("model.language_model.layers.21.mlp.gate_proj")
#loc56 = loc("model.language_model.layers.21.mlp.gate_proj.silu")
#loc57 = loc("model.language_model.layers.21.mlp.up_proj.qweight")
#loc58 = loc("model.language_model.layers.21.mlp.up_proj.scales")
#loc59 = loc("model.language_model.layers.21.mlp.up_proj.qzeros")
#loc60 = loc("model.language_model.layers.21.mlp.up_proj")
#loc61 = loc("model.language_model.layers.21.mlp.up_proj.mul")
#loc62 = loc("model.language_model.layers.21.mlp.down_proj.qweight")
#loc63 = loc("model.language_model.layers.21.mlp.down_proj.scales")
#loc64 = loc("model.language_model.layers.21.mlp.down_proj.qzeros")
#loc65 = loc("model.language_model.layers.21.mlp.down_proj")
#loc66 = loc("output_states")
