#loc = loc(unknown)
#loc1 = loc("input_states")
#loc2 = loc("recurrent_states")
module @block_6 attributes {module.FLOPs = 123501428736 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.inputs = ["input_states", "recurrent_states"], module.mode = "W4BF16", module.outputs = ["output_states", "conv_states"], module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "block_6_tpu_addressed_bm1684x_w4bf16_weight.npz"} {
  module @block_6 attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 30969856 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 0 : i64, module.neuron_addr = 4325937152 : i64, module.neuron_size = 71958528 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4388851712 : i64>) {
      %0 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16, 4393046016 : i64> loc(#loc1)
      %1 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xbf16, 4397240320 : i64> loc(#loc2)
      %2:2 = call @subfunc_0(%0, %1) : (tensor<1x1024x2048xbf16, 4393046016 : i64>, tensor<1x16x128x128xbf16, 4397240320 : i64>) -> (tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4388851712 : i64>) loc(#loc)
      return %2#0, %2#1 : tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4388851712 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x1024x2048xbf16, 4393046016 : i64> loc("input_states"), %arg1: tensor<1x16x128x128xbf16, 4397240320 : i64> loc("recurrent_states")) -> (tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4388851712 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_DYNAMIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4294967296 : i64> loc(#loc3)
      %2 = "top.Weight"() {allow_split = [1, 1, 1], path = "tpu.Mul.1"} : () -> tensor<1x1x16xbf16, 4294971392 : i64> loc(#loc4)
      %3 = "top.Weight"() {path = "tpu.Conv2D.weight"} : () -> tensor<1x6144x1x4xbf16, 4294975488 : i64> loc(#loc5)
      %4 = "top.Weight"() {path = "tpu.ChunkGatedDeltaRule.9"} : () -> tensor<64x64xbf16, 4295024640 : i64> loc(#loc6)
      %5 = "top.Weight"() {path = "tpu.MatMul.bias"} : () -> tensor<1x1x16xbf16, 4295032832 : i64> loc(#loc7)
      %6 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1x2048x16xbf16, 4295036928 : i64> loc(#loc8)
      %7 = "top.Weight"() {path = "tpu.MatMul.weight"} : () -> tensor<1x2048x16xbf16, 4295102464 : i64> loc(#loc9)
      %8 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4295168000 : i64> loc(#loc10)
      %9 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4295266304 : i64> loc(#loc11)
      %10 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4295462912 : i64> loc(#loc12)
      %11 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4301754368 : i64> loc(#loc13)
      %12 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4301787136 : i64> loc(#loc14)
      %13 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4301852672 : i64> loc(#loc15)
      %14 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x128xbf16, 4303949824 : i64> loc(#loc16)
      %15 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4303953920 : i64> loc(#loc17)
      %16 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4303986688 : i64> loc(#loc18)
      %17 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4304052224 : i64> loc(#loc19)
      %18 = "top.Weight"() {path = "tpu.ChunkGatedDeltaRule.7"} : () -> tensor<64x64xbf16, 4306149376 : i64> loc(#loc20)
      %19 = "top.Weight"() {path = "tpu.ChunkGatedDeltaRule.8"} : () -> tensor<64x64xbf16, 4306157568 : i64> loc(#loc21)
      %20 = "top.Weight"() {path = "tpu.ChunkGatedDeltaRule.6"} : () -> tensor<64x64xbf16, 4306165760 : i64> loc(#loc22)
      %21 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x48xui8, 4306173952 : i64> loc(#loc23)
      %22 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x48xbf16, 4306272256 : i64> loc(#loc24)
      %23 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x3072xui8, 4306468864 : i64> loc(#loc25)
      %24 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4312760320 : i64> loc(#loc26)
      %25 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4312858624 : i64> loc(#loc27)
      %26 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4313055232 : i64> loc(#loc28)
      %27 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4319346688 : i64> loc(#loc29)
      %28 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4319444992 : i64> loc(#loc30)
      %29 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4319641600 : i64> loc(#loc31)
      %30 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4325933056 : i64> loc(#loc32)
      %31 = "tpu.RMSNorm"(%arg0, %1) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16, 4393046016 : i64>, tensor<1x1x2048xbf16, 4294967296 : i64>) -> tensor<1x1024x2048xbf16, 4342714368 : i64> loc(#loc33)
      %32 = "tpu.A16MatMul"(%31, %10, %9, %8, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4342714368 : i64>, tensor<6144x1024xui8, 4295462912 : i64>, tensor<64x96x16xbf16, 4295266304 : i64>, tensor<64x96x16xui8, 4295168000 : i64>, none) -> tensor<1x1024x6144xbf16, 4325937152 : i64> loc(#loc34)
      %33 = "tpu.A16MatMul"(%31, %13, %12, %11, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4342714368 : i64>, tensor<2048x1024xui8, 4301852672 : i64>, tensor<64x32x16xbf16, 4301787136 : i64>, tensor<64x32x16xui8, 4301754368 : i64>, none) -> tensor<1x1024x2048xbf16, 4338520064 : i64> loc(#loc35)
      %34 = "tpu.Group"(%33) ({
        %69 = "tpu.Load"(%33) {do_bcast = false, ginfo = #tpu.lg<out_addr = 196608, out_size = 22528, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 683, 1366], h_slice = [683, 683, 682], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x2048xbf16, 4338520064 : i64>) -> tensor<1x1024x2048xbf16> loc(#loc37)
        %70 = "tpu.Cast"(%69) {ginfo = #tpu.lg<out_addr = 0, out_size = 44032, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 683, 1366], h_slice = [683, 683, 682], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xbf16>) -> tensor<1x1024x2048xf32> loc(#loc38)
        %71 = "tpu.Active"(%70) {ginfo = #tpu.lg<out_addr = 49152, out_size = 44032, buffer_addr = 98304, buffer_size = 88192, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 683, 1366], h_slice = [683, 683, 682], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, mode = #tpu<active_mode SILU>} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xf32> loc(#loc39)
        %72 = "tpu.Cast"(%71) {ginfo = #tpu.lg<out_addr = 219136, out_size = 22528, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 683, 1366], h_slice = [683, 683, 682], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16> loc(#loc36)
        %73 = "tpu.Store"(%72, %0) {ginfo = #tpu.lg<out_addr = 219136, out_size = 22528, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 683, 1366], h_slice = [683, 683, 682], w_idx = [0], w_slice = [1], id = 4, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x2048xbf16>, none) -> tensor<1x1024x2048xbf16, 4388851712 : i64> loc(#loc36)
        "tpu.Yield"(%73) : (tensor<1x1024x2048xbf16, 4388851712 : i64>) -> () loc(#loc36)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, -2, 2, 4, 0, -3, 3], group_type = 4 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x2048xbf16, 4338520064 : i64>) -> tensor<1x1024x2048xbf16, 4388851712 : i64> loc(#loc36)
      %35 = "tpu.MatMul"(%31, %7, %0, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1024x2048xbf16, 4342714368 : i64>, tensor<1x2048x16xbf16, 4295102464 : i64>, none, none, none) -> tensor<1x1024x16xbf16, 4397764608 : i64> loc(#loc40)
      %36 = "tpu.Cast"(%35) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xbf16, 4397764608 : i64>) -> tensor<1x1024x16xf32, 4397830144 : i64> loc(#loc41)
      %37 = "tpu.MatMul"(%31, %6, %5, %0, %0) {do_relu = false, dq_type = "NONE", fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, is_lora = false, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, q_group_size = 0 : i64, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x1024x2048xbf16, 4342714368 : i64>, tensor<1x2048x16xbf16, 4295036928 : i64>, tensor<1x1x16xbf16, 4295032832 : i64>, none, none) -> tensor<1x1024x16xbf16, 4338520064 : i64> loc(#loc42)
      %38 = "tpu.Cast"(%37) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xbf16, 4338520064 : i64>) -> tensor<1x1024x16xf32, 4397764608 : i64> loc(#loc43)
      %39 = "tpu.Permute"(%32, %0) {order = [0, 2, 1]} : (tensor<1x1024x6144xbf16, 4325937152 : i64>, none) -> tensor<1x6144x1024xbf16, 4376268800 : i64> loc(#loc44)
      %40 = "tpu.Reshape"(%39) {flatten_start_dim = -1 : i64, shape = [1, 6144, 1, -1]} : (tensor<1x6144x1024xbf16, 4376268800 : i64>) -> tensor<1x6144x1x1024xbf16, 4376268800 : i64> loc(#loc45)
      %41 = "tpu.Conv2D"(%40, %3, %0) {coeff_merged = false, do_relu = false, dynweight_reorderd = false, group = 6144 : i64, kernel_shape = [1, 4], kernel_zp = 0 : i64, pads = [0, 3, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = false} : (tensor<1x6144x1x1024xbf16, 4376268800 : i64>, tensor<1x6144x1x4xbf16, 4294975488 : i64>, none) -> tensor<1x6144x1x1024xbf16, 4325937152 : i64> loc(#loc46)
      %42 = "tpu.Cast"(%41) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x6144x1x1024xbf16, 4325937152 : i64>) -> tensor<1x6144x1x1024xf32, 4351102976 : i64> loc(#loc47)
      %43 = "tpu.Active"(%42) {mode = #tpu<active_mode SILU>} : (tensor<1x6144x1x1024xf32, 4351102976 : i64>) -> tensor<1x6144x1x1024xf32, 4325937152 : i64> loc(#loc48)
      %44 = "tpu.Reshape"(%43) {flatten_start_dim = -1 : i64, shape = [1, 48, 128, -1]} : (tensor<1x6144x1x1024xf32, 4325937152 : i64>) -> tensor<1x48x128x1024xf32, 4325937152 : i64> loc(#loc49)
      %45 = "tpu.Cast"(%44) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x48x128x1024xf32, 4325937152 : i64>) -> tensor<1x48x128x1024xbf16, 4351102976 : i64> loc(#loc50)
      %46 = "tpu.Slice"(%45, %0, %0, %0, %0) {axes = [], ends = [1, 16, 128, 1024], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16, 4351102976 : i64>, none, none, none, none) -> tensor<1x16x128x1024xbf16, 4334325760 : i64> loc(#loc51)
      %47 = "tpu.Slice"(%45, %0, %0, %0, %0) {axes = [], ends = [1, 32, 128, 1024], hasparamConvert_axes = [], offset = [0, 16, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16, 4351102976 : i64>, none, none, none, none) -> tensor<1x16x128x1024xbf16, 4330131456 : i64> loc(#loc52)
      %48 = "tpu.Slice"(%45, %0, %0, %0, %0) {axes = [], ends = [1, 48, 128, 1024], hasparamConvert_axes = [], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x48x128x1024xbf16, 4351102976 : i64>, none, none, none, none) -> tensor<1x16x128x1024xbf16, 4325937152 : i64> loc(#loc53)
      %49 = "tpu.Permute"(%46, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16, 4334325760 : i64>, none) -> tensor<1x1024x16x128xbf16, 4338520064 : i64> loc(#loc54)
      %50 = "tpu.Permute"(%47, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16, 4330131456 : i64>, none) -> tensor<1x1024x16x128xbf16, 4334325760 : i64> loc(#loc55)
      %51 = "tpu.Permute"(%48, %0) {order = [0, 3, 1, 2]} : (tensor<1x16x128x1024xbf16, 4325937152 : i64>, none) -> tensor<1x1024x16x128xbf16, 4330131456 : i64> loc(#loc56)
      %52 = "tpu.Active"(%36) {bias = 0.000000e+00 : f64, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1024x16xf32, 4397830144 : i64>) -> tensor<1x1024x16xf32, 4325937152 : i64> loc(#loc57)
      %53 = "tpu.Cast"(%52) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xf32, 4325937152 : i64>) -> tensor<1x1024x16xbf16, 4342747136 : i64> loc(#loc58)
      %54 = "tpu.Group"(%38) ({
        %69 = "tpu.Load"(%38) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x16xf32, 4397764608 : i64>) -> tensor<1x1024x16xf32> loc(#loc60)
        %70 = "tpu.Active"(%69) {ginfo = #tpu.lg<out_addr = 0, out_size = 1024, buffer_addr = 16384, buffer_size = 2240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, mode = #tpu<active_mode SOFT_PLUS>} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xf32> loc(#loc61)
        %71 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x16xbf16, 4294971392 : i64>) -> tensor<1x1x16xbf16> loc(#loc62)
        %72 = "tpu.Cast"(%70) {ginfo = #tpu.lg<out_addr = 16384, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x16xf32>) -> tensor<1x1024x16xbf16> loc(#loc63)
        %73 = "tpu.Mul"(%72, %71) {do_relu = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 4>, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x16xbf16>, tensor<1x1x16xbf16>) -> tensor<1x1024x16xbf16> loc(#loc59)
        %74 = "tpu.Store"(%73, %0) {ginfo = #tpu.lg<out_addr = 49152, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [16], w_idx = [0], w_slice = [1], id = 5, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x16xbf16>, none) -> tensor<1x1024x16xbf16, 4342714368 : i64> loc(#loc59)
        "tpu.Yield"(%74) : (tensor<1x1024x16xbf16, 4342714368 : i64>) -> () loc(#loc59)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, 5, -2, 3, 2, -3, 4, 0], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x16xf32, 4397764608 : i64>) -> tensor<1x1024x16xbf16, 4342714368 : i64> loc(#loc59)
      %55 = "tpu.ChunkGatedDeltaRule"(%49, %50, %51, %54, %53, %arg1, %20, %18, %19, %4) {chunk_size = 64 : i64, d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x1024x16x128xbf16, 4338520064 : i64>, tensor<1x1024x16x128xbf16, 4334325760 : i64>, tensor<1x1024x16x128xbf16, 4330131456 : i64>, tensor<1x1024x16xbf16, 4342714368 : i64>, tensor<1x1024x16xbf16, 4342747136 : i64>, tensor<1x16x128x128xbf16, 4397240320 : i64>, tensor<64x64xbf16, 4306165760 : i64>, tensor<64x64xbf16, 4306149376 : i64>, tensor<64x64xbf16, 4306157568 : i64>, tensor<64x64xbf16, 4295024640 : i64>) -> tensor<1x1024x16x128xbf16, 4325937152 : i64> loc(#loc64)
      %56 = "tpu.RMSNorm"(%55, %14) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x16x128xbf16, 4325937152 : i64>, tensor<1x1x1x128xbf16, 4303949824 : i64>) -> tensor<1x1024x16x128xbf16, 4330131456 : i64> loc(#loc65)
      %57 = "tpu.Reshape"(%56) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x16x128xbf16, 4330131456 : i64>) -> tensor<1x1024x2048xbf16, 4330131456 : i64> loc(#loc66)
      %58 = "tpu.Mul"(%57, %34) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x2048xbf16, 4330131456 : i64>, tensor<1x1024x2048xbf16, 4388851712 : i64>) -> tensor<1x1024x2048xbf16, 4325937152 : i64> loc(#loc67)
      %59 = "tpu.A16MatMul"(%58, %17, %16, %15, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<2048x1024xui8, 4304052224 : i64>, tensor<64x32x16xbf16, 4303986688 : i64>, tensor<64x32x16xui8, 4303953920 : i64>, none) -> tensor<1x1024x2048xbf16, 4372074496 : i64> loc(#loc68)
      %60 = "tpu.Add"(%arg0, %59) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16, 4393046016 : i64>, tensor<1x1024x2048xbf16, 4372074496 : i64>) -> tensor<1x1024x2048xbf16, 4367880192 : i64> loc(#loc69)
      %61 = "tpu.RMSNorm"(%60, %30) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16, 4367880192 : i64>, tensor<1x1x2048xbf16, 4325933056 : i64>) -> tensor<1x1024x2048xbf16, 4363685888 : i64> loc(#loc70)
      %62 = "tpu.A16MatMul"(%61, %26, %25, %24, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4363685888 : i64>, tensor<6144x1024xui8, 4313055232 : i64>, tensor<64x96x16xbf16, 4312858624 : i64>, tensor<64x96x16xui8, 4312760320 : i64>, none) -> tensor<1x1024x6144xbf16, 4325937152 : i64> loc(#loc71)
      %63 = "tpu.Group"(%62) ({
        %69 = "tpu.Load"(%62) {do_bcast = false, ginfo = #tpu.lg<out_addr = 131072, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x6144xbf16, 4325937152 : i64>) -> tensor<1x1024x6144xbf16> loc(#loc73)
        %70 = "tpu.Cast"(%69) {ginfo = #tpu.lg<out_addr = 0, out_size = 49152, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xf32> loc(#loc74)
        %71 = "tpu.Active"(%70) {ginfo = #tpu.lg<out_addr = 49152, out_size = 49152, buffer_addr = 131072, buffer_size = 98432, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, mode = #tpu<active_mode SILU>} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc75)
        %72 = "tpu.Cast"(%71) {ginfo = #tpu.lg<out_addr = 98304, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xbf16> loc(#loc72)
        %73 = "tpu.Store"(%72, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 4, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x6144xbf16>, none) -> tensor<1x1024x6144xbf16, 4351102976 : i64> loc(#loc72)
        "tpu.Yield"(%73) : (tensor<1x1024x6144xbf16, 4351102976 : i64>) -> () loc(#loc72)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, -2, 2, 4, -3, 3, 0], group_type = 4 : i64, hsecs = 8 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x6144xbf16, 4325937152 : i64>) -> tensor<1x1024x6144xbf16, 4351102976 : i64> loc(#loc72)
      %64 = "tpu.A16MatMul"(%61, %29, %28, %27, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4363685888 : i64>, tensor<6144x1024xui8, 4319641600 : i64>, tensor<64x96x16xbf16, 4319444992 : i64>, tensor<64x96x16xui8, 4319346688 : i64>, none) -> tensor<1x1024x6144xbf16, 4338520064 : i64> loc(#loc76)
      %65 = "tpu.Mul"(%63, %64) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x6144xbf16, 4351102976 : i64>, tensor<1x1024x6144xbf16, 4338520064 : i64>) -> tensor<1x1024x6144xbf16, 4325937152 : i64> loc(#loc77)
      %66 = "tpu.A16MatMul"(%65, %23, %22, %21, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xbf16, 4325937152 : i64>, tensor<2048x3072xui8, 4306468864 : i64>, tensor<64x32x48xbf16, 4306272256 : i64>, tensor<64x32x48xui8, 4306173952 : i64>, none) -> tensor<1x1024x2048xbf16, 4338520064 : i64> loc(#loc78)
      %67 = "tpu.Add"(%60, %66) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16, 4367880192 : i64>, tensor<1x1024x2048xbf16, 4338520064 : i64>) -> tensor<1x1024x2048xbf16, 4325937152 : i64> loc(#loc79)
      %68 = "tpu.Slice"(%39, %0, %0, %0, %0) {axes = [], ends = [1, 6144, 1024], hasparamConvert_axes = [], offset = [0, 0, -4], steps = [1, 1, 1]} : (tensor<1x6144x1024xbf16, 4376268800 : i64>, none, none, none, none) -> tensor<1x6144x4xbf16, 4388851712 : i64> loc(#loc80)
      return %67, %68 : tensor<1x1024x2048xbf16, 4325937152 : i64>, tensor<1x6144x4xbf16, 4388851712 : i64> loc(#loc)
    } loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc3 = loc("model.language_model.layers.6.input_layernorm.weight_bf16")
#loc4 = loc("model.language_model.layers.6.linear_attn.A_log.weight_bf16")
#loc5 = loc("model.language_model.layers.6.linear_attn.conv1d.weight_bf16")
#loc6 = loc("model.language_model.layers.6.linear_attn.eye_bf16")
#loc7 = loc("model.language_model.layers.6.linear_attn.in_proj_a.bias_bf16")
#loc8 = loc("model.language_model.layers.6.linear_attn.in_proj_a.weight_bf16")
#loc9 = loc("model.language_model.layers.6.linear_attn.in_proj_b.weight_bf16")
#loc10 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv_1_reordered")
#loc11 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv_reordered")
#loc12 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv_weight")
#loc13 = loc("model.language_model.layers.6.linear_attn.in_proj_z_1_reordered")
#loc14 = loc("model.language_model.layers.6.linear_attn.in_proj_z_reordered")
#loc15 = loc("model.language_model.layers.6.linear_attn.in_proj_z_weight")
#loc16 = loc("model.language_model.layers.6.linear_attn.norm.weight_bf16")
#loc17 = loc("model.language_model.layers.6.linear_attn.out_proj_1_reordered")
#loc18 = loc("model.language_model.layers.6.linear_attn.out_proj_reordered")
#loc19 = loc("model.language_model.layers.6.linear_attn.out_proj_weight")
#loc20 = loc("model.language_model.layers.6.linear_attn.strict_triu_mask_bf16")
#loc21 = loc("model.language_model.layers.6.linear_attn.tril_mask_bf16")
#loc22 = loc("model.language_model.layers.6.linear_attn.triu_mask_bf16")
#loc23 = loc("model.language_model.layers.6.mlp.down_proj_1_reordered")
#loc24 = loc("model.language_model.layers.6.mlp.down_proj_reordered")
#loc25 = loc("model.language_model.layers.6.mlp.down_proj_weight")
#loc26 = loc("model.language_model.layers.6.mlp.gate_proj_1_reordered")
#loc27 = loc("model.language_model.layers.6.mlp.gate_proj_reordered")
#loc28 = loc("model.language_model.layers.6.mlp.gate_proj_weight")
#loc29 = loc("model.language_model.layers.6.mlp.up_proj_1_reordered")
#loc30 = loc("model.language_model.layers.6.mlp.up_proj_reordered")
#loc31 = loc("model.language_model.layers.6.mlp.up_proj_weight")
#loc32 = loc("model.language_model.layers.6.post_attention_layernorm.weight_bf16")
#loc33 = loc("model.language_model.layers.6.input_layernorm")
#loc34 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv")
#loc35 = loc("model.language_model.layers.6.linear_attn.in_proj_z")
#loc36 = loc("model.language_model.layers.6.linear_attn.in_proj_z.silumodel.language_model.layers.6.linear_attn.in_proj_z.core_attn_mul_bf16")
#loc37 = loc("load_model.language_model.layers.6.linear_attn.in_proj_z")
#loc38 = loc("model.language_model.layers.6.linear_attn.in_proj_zmodel.language_model.layers.6.linear_attn.in_proj_z.silu_f32")
#loc39 = loc("model.language_model.layers.6.linear_attn.in_proj_z.silu")
#loc40 = loc("model.language_model.layers.6.linear_attn.in_proj_b")
#loc41 = loc("model.language_model.layers.6.linear_attn.in_proj_bmodel.language_model.layers.6.linear_attn.in_proj_b.sigmoid_f32")
#loc42 = loc("model.language_model.layers.6.linear_attn.in_proj_a")
#loc43 = loc("model.language_model.layers.6.linear_attn.in_proj_amodel.language_model.layers.6.linear_attn.in_proj_a.softplus_f32")
#loc44 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.permute")
#loc45 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.reshape_to_conv2d")
#loc46 = loc("model.language_model.layers.6.linear_attn.conv1d")
#loc47 = loc("model.language_model.layers.6.linear_attn.conv1dmodel.language_model.layers.6.linear_attn.conv1d.silu_f32")
#loc48 = loc("model.language_model.layers.6.linear_attn.conv1d.silu")
#loc49 = loc("model.language_model.layers.6.linear_attn.conv1d.reshape_after_conv")
#loc50 = loc("model.language_model.layers.6.linear_attn.conv1d.reshape_after_convmodel.language_model.layers.6.linear_attn.in_proj_qkv.q_slice_after_conv_bf16")
#loc51 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.q_slice_after_conv")
#loc52 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.k_slice_after_conv")
#loc53 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.v_slice_after_conv")
#loc54 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.q_permute_after_conv")
#loc55 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.k_permute_after_conv")
#loc56 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.v_permute_after_conv")
#loc57 = loc("model.language_model.layers.6.linear_attn.in_proj_b.sigmoid")
#loc58 = loc("model.language_model.layers.6.linear_attn.in_proj_b.sigmoidmodel.language_model.layers.6.chunk_gated_delta_rule_bf16")
#loc59 = loc("model.language_model.layers.6.linear_attn.in_proj_a.mul")
#loc60 = loc("load_model.language_model.layers.6.linear_attn.in_proj_amodel.language_model.layers.6.linear_attn.in_proj_a.softplus_f32")
#loc61 = loc("model.language_model.layers.6.linear_attn.in_proj_a.softplus")
#loc62 = loc("load_model.language_model.layers.6.linear_attn.A_log.weight_bf16")
#loc63 = loc("model.language_model.layers.6.linear_attn.in_proj_a.softplusmodel.language_model.layers.6.linear_attn.in_proj_a.mul_bf16")
#loc64 = loc("model.language_model.layers.6.chunk_gated_delta_rule")
#loc65 = loc("model.language_model.layers.6.linear_attn.norm")
#loc66 = loc("model.language_model.layers.6.linear_attn.in_proj_qkv.core_attn_reshape")
#loc67 = loc("model.language_model.layers.6.linear_attn.in_proj_z.core_attn_mul")
#loc68 = loc("model.language_model.layers.6.linear_attn.out_proj")
#loc69 = loc("model.language_model.layers.6.linear_attn.out_proj.add")
#loc70 = loc("model.language_model.layers.6.post_attention_layernorm")
#loc71 = loc("model.language_model.layers.6.mlp.gate_proj")
#loc72 = loc("model.language_model.layers.6.mlp.gate_proj.silumodel.language_model.layers.6.mlp.up_proj.mul_bf16")
#loc73 = loc("load_model.language_model.layers.6.mlp.gate_proj")
#loc74 = loc("model.language_model.layers.6.mlp.gate_projmodel.language_model.layers.6.mlp.gate_proj.silu_f32")
#loc75 = loc("model.language_model.layers.6.mlp.gate_proj.silu")
#loc76 = loc("model.language_model.layers.6.mlp.up_proj")
#loc77 = loc("model.language_model.layers.6.mlp.up_proj.mul")
#loc78 = loc("model.language_model.layers.6.mlp.down_proj")
#loc79 = loc("output_states")
#loc80 = loc("conv_states")

