#loc = loc(unknown)
module @lm_head attributes {module.chip = "ALL", module.platform = "LLM_QUANTIZED", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "../lm_head_top_weights.npz"} {
  func.func @main(%arg0: tensor<1x2048xf32> loc(unknown)) -> tensor<1x1xf32> {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x2048xf32>) -> tensor<1x2048xf32> loc(#loc1)
    %2 = "top.Weight"() : () -> tensor<248320x2048xf32> loc(#loc2)
    %3 = "top.MatMul"(%2, %1, %0) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = true} : (tensor<248320x2048xf32>, tensor<1x2048xf32>, none) -> tensor<248320x1xf32> loc(#loc3)
    %4 = "top.Reshape"(%3) {flatten_start_dim = -1 : i64} : (tensor<248320x1xf32>) -> tensor<1x248320xf32> loc(#loc4)
    %values, %indices = "top.TopK"(%4) {K = 1 : i64, axis = 1 : i64, largest = true, replace_topk_indices = false, sorted = true} : (tensor<1x248320xf32>) -> (tensor<1x1xf32>, tensor<1x1xf32>) loc(#loc7)
    return %indices : tensor<1x1xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("hidden_states")
#loc2 = loc("lm_head.weight")
#loc3 = loc("lm_head")
#loc4 = loc("lm_head.reshape")
#loc5 = loc("token_value")
#loc6 = loc("token_id")
#loc7 = loc(fused[#loc5, #loc6])
