#loc = loc(unknown)
module @block_cache_0 attributes {module.chip = "ALL", module.platform = "LLM_QUANTIZED", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "../block_0_top_weights.npz"} {
  func.func @main(%arg0: tensor<1x1x2048xf32> loc(unknown), %arg1: tensor<1x6144x4xf32> loc(unknown), %arg2: tensor<1x16x128x128xf32> loc(unknown)) -> (tensor<1x1x2048xf32>, tensor<1x6144x4xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc1)
    %2 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<1x6144x4xf32>) -> tensor<1x6144x4xf32> loc(#loc2)
    %3 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x16x128x128xf32>) -> tensor<1x16x128x128xf32> loc(#loc3)
    %4 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xf32> loc(#loc4)
    %5 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xf32> loc(#loc5)
    %6 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xf32> loc(#loc6)
    %7 = "top.Weight"() {placeholder = true} : () -> tensor<64x64xf32> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc8)
    %9 = "top.RMSNorm"(%1, %8) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc12)
    %13 = "top.A16MatMul"(%9, %10, %11, %12, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xf32>, tensor<2048x1024xui8>, tensor<2048x16xf32>, tensor<2048x16xui8>, none) -> tensor<1x1x2048xf32> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<1x1x16xf32> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc15)
    %16 = "top.MatMul"(%9, %15, %14) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x1x2048xf32>, tensor<2048x16xf32>, tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc17)
    %18 = "top.MatMul"(%9, %17, %0) {do_relu = false, dq_type = "NONE", hdim_is_batch = false, is_lora = false, keep_dims = true, left_transpose = false, output_transpose = false, q_group_size = 0 : i64, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x1x2048xf32>, tensor<2048x16xf32>, none) -> tensor<1x1x16xf32> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc21)
    %22 = "top.A16MatMul"(%9, %19, %20, %21, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xf32> loc(#loc22)
    %23 = "top.Reshape"(%22) {flatten_start_dim = -1 : i64} : (tensor<1x1x6144xf32>) -> tensor<1x6144x1xf32> loc(#loc23)
    %24 = "top.ConcatSlice"(%2, %23) {axis = 2 : i64} : (tensor<1x6144x4xf32>, tensor<1x6144x1xf32>) -> tensor<1x6144x4xf32> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<1x6144x4xf32> loc(#loc25)
    %26 = "top.Mul"(%24, %25) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x6144x4xf32>, tensor<1x6144x4xf32>) -> tensor<1x6144x4xf32> loc(#loc26)
    %27 = "top.Reduce"(%26) {axes = [2], is_scalar = false, keepdims = false, mode = "ReduceSum"} : (tensor<1x6144x4xf32>) -> tensor<1x6144xf32> loc(#loc27)
    %28 = "top.Sigmoid"(%18) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc28)
    %29 = "top.Softplus"(%16) : (tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<1x1x16xf32> loc(#loc30)
    %31 = "top.Mul"(%29, %30) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x16xf32>, tensor<1x1x16xf32>) -> tensor<1x1x16xf32> loc(#loc31)
    %32 = "top.SiLU"(%27) : (tensor<1x6144xf32>) -> tensor<1x6144xf32> loc(#loc32)
    %33 = "top.Slice"(%32, %0, %0, %0) {axes = [], ends = [1, 2048], hasparamConvert_axes = [], offset = [0, 0], steps = [1, 1]} : (tensor<1x6144xf32>, none, none, none) -> tensor<1x2048xf32> loc(#loc33)
    %34 = "top.Slice"(%32, %0, %0, %0) {axes = [], ends = [1, 4096], hasparamConvert_axes = [], offset = [0, 2048], steps = [1, 1]} : (tensor<1x6144xf32>, none, none, none) -> tensor<1x2048xf32> loc(#loc34)
    %35 = "top.Slice"(%32, %0, %0, %0) {axes = [], ends = [1, 6144], hasparamConvert_axes = [], offset = [0, 4096], steps = [1, 1]} : (tensor<1x6144xf32>, none, none, none) -> tensor<1x2048xf32> loc(#loc35)
    %36 = "top.RecurrentGatedDeltaRule"(%33, %34, %35, %31, %28, %3) {d = 128 : i64, num_k_heads = 16 : i64, num_v_heads = 16 : i64, scale = 0.088388347648318433 : f64, use_qk_l2norm = true} : (tensor<1x2048xf32>, tensor<1x2048xf32>, tensor<1x2048xf32>, tensor<1x1x16xf32>, tensor<1x1x16xf32>, tensor<1x16x128x128xf32>) -> tensor<1x1x16x128xf32> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<1x1x1x128xf32> loc(#loc37)
    %38 = "top.RMSNorm"(%36, %37) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x16x128xf32>, tensor<1x1x1x128xf32>) -> tensor<1x1x16x128xf32> loc(#loc38)
    %39 = "top.Reshape"(%38) {flatten_start_dim = -1 : i64} : (tensor<1x1x16x128xf32>) -> tensor<1x1x2048xf32> loc(#loc39)
    %40 = "top.SiLU"(%13) : (tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc40)
    %41 = "top.Mul"(%39, %40) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc41)
    %42 = "top.Weight"() : () -> tensor<2048x1024xui8> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<2048x16xf32> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<2048x16xui8> loc(#loc44)
    %45 = "top.A16MatMul"(%41, %42, %43, %44, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xf32>, tensor<2048x1024xui8>, tensor<2048x16xf32>, tensor<2048x16xui8>, none) -> tensor<1x1x2048xf32> loc(#loc45)
    %46 = "top.Add"(%1, %45) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<1x1x2048xf32> loc(#loc47)
    %48 = "top.RMSNorm"(%46, %47) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc50)
    %51 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc51)
    %52 = "top.A16MatMul"(%48, %49, %50, %51, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xf32> loc(#loc52)
    %53 = "top.SiLU"(%52) : (tensor<1x1x6144xf32>) -> tensor<1x1x6144xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<6144x1024xui8> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<6144x16xf32> loc(#loc55)
    %56 = "top.Weight"() : () -> tensor<6144x16xui8> loc(#loc56)
    %57 = "top.A16MatMul"(%48, %54, %55, %56, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x2048xf32>, tensor<6144x1024xui8>, tensor<6144x16xf32>, tensor<6144x16xui8>, none) -> tensor<1x1x6144xf32> loc(#loc57)
    %58 = "top.Mul"(%53, %57) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x6144xf32>, tensor<1x1x6144xf32>) -> tensor<1x1x6144xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<2048x3072xui8> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<2048x48xf32> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<2048x48xui8> loc(#loc61)
    %62 = "top.A16MatMul"(%58, %59, %60, %61, %0) {dq_type = "NONE", q_group_size = 128 : i64, right_transpose = true, weight_bits = 4 : i64} : (tensor<1x1x6144xf32>, tensor<2048x3072xui8>, tensor<2048x48xf32>, tensor<2048x48xui8>, none) -> tensor<1x1x2048xf32> loc(#loc62)
    %63 = "top.Add"(%46, %62) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1x2048xf32>, tensor<1x1x2048xf32>) -> tensor<1x1x2048xf32> loc(#loc63)
    return %63, %24 : tensor<1x1x2048xf32>, tensor<1x6144x4xf32> loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc1 = loc("input_states")
#loc2 = loc("conv_state")
#loc3 = loc("recurrent_state")
#loc4 = loc("model.language_model.layers.0.linear_attn.triu_mask")
#loc5 = loc("model.language_model.layers.0.linear_attn.strict_triu_mask")
#loc6 = loc("model.language_model.layers.0.linear_attn.tril_mask")
#loc7 = loc("model.language_model.layers.0.linear_attn.eye")
#loc8 = loc("model.language_model.layers.0.input_layernorm.weight")
#loc9 = loc("model.language_model.layers.0.input_layernorm")
#loc10 = loc("model.language_model.layers.0.linear_attn.in_proj_z.qweight")
#loc11 = loc("model.language_model.layers.0.linear_attn.in_proj_z.scales")
#loc12 = loc("model.language_model.layers.0.linear_attn.in_proj_z.qzeros")
#loc13 = loc("model.language_model.layers.0.linear_attn.in_proj_z")
#loc14 = loc("model.language_model.layers.0.linear_attn.in_proj_a.bias")
#loc15 = loc("model.language_model.layers.0.linear_attn.in_proj_a.weight")
#loc16 = loc("model.language_model.layers.0.linear_attn.in_proj_a")
#loc17 = loc("model.language_model.layers.0.linear_attn.in_proj_b.weight")
#loc18 = loc("model.language_model.layers.0.linear_attn.in_proj_b")
#loc19 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.qweight")
#loc20 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.scales")
#loc21 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.qzeros")
#loc22 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv")
#loc23 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.reshape")
#loc24 = loc("model.language_model.layers.0.linear_attn.conv1d.concat")
#loc25 = loc("model.language_model.layers.0.linear_attn.conv1d.weight")
#loc26 = loc("model.language_model.layers.0.linear_attn.conv1d.mul")
#loc27 = loc("model.language_model.layers.0.linear_attn.conv1d.reduce_sum")
#loc28 = loc("model.language_model.layers.0.linear_attn.in_proj_b.sigmoid")
#loc29 = loc("model.language_model.layers.0.linear_attn.in_proj_a.softplus")
#loc30 = loc("model.language_model.layers.0.linear_attn.A_log.weight")
#loc31 = loc("model.language_model.layers.0.linear_attn.in_proj_a.mul")
#loc32 = loc("model.language_model.layers.0.linear_attn.conv1d.silu")
#loc33 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.q_slice")
#loc34 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.k_slice")
#loc35 = loc("model.language_model.layers.0.linear_attn.in_proj_qkv.v_slice")
#loc36 = loc("model.language_model.layers.0.recurrent_gated_delta_rule")
#loc37 = loc("model.language_model.layers.0.linear_attn.norm.weight")
#loc38 = loc("model.language_model.layers.0.linear_attn.norm")
#loc39 = loc("model.language_model.layers.0..core_attn_reshape")
#loc40 = loc("model.language_model.layers.0.linear_attn.in_proj_z.silu")
#loc41 = loc("model.language_model.layers.0..core_attn_mul")
#loc42 = loc("model.language_model.layers.0.linear_attn.out_proj.qweight")
#loc43 = loc("model.language_model.layers.0.linear_attn.out_proj.scales")
#loc44 = loc("model.language_model.layers.0.linear_attn.out_proj.qzeros")
#loc45 = loc("model.language_model.layers.0.linear_attn.out_proj")
#loc46 = loc("model.language_model.layers.0.linear_attn.out_proj.add")
#loc47 = loc("model.language_model.layers.0.post_attention_layernorm.weight")
#loc48 = loc("model.language_model.layers.0.post_attention_layernorm")
#loc49 = loc("model.language_model.layers.0.mlp.gate_proj.qweight")
#loc50 = loc("model.language_model.layers.0.mlp.gate_proj.scales")
#loc51 = loc("model.language_model.layers.0.mlp.gate_proj.qzeros")
#loc52 = loc("model.language_model.layers.0.mlp.gate_proj")
#loc53 = loc("model.language_model.layers.0.mlp.gate_proj.silu")
#loc54 = loc("model.language_model.layers.0.mlp.up_proj.qweight")
#loc55 = loc("model.language_model.layers.0.mlp.up_proj.scales")
#loc56 = loc("model.language_model.layers.0.mlp.up_proj.qzeros")
#loc57 = loc("model.language_model.layers.0.mlp.up_proj")
#loc58 = loc("model.language_model.layers.0.mlp.up_proj.mul")
#loc59 = loc("model.language_model.layers.0.mlp.down_proj.qweight")
#loc60 = loc("model.language_model.layers.0.mlp.down_proj.scales")
#loc61 = loc("model.language_model.layers.0.mlp.down_proj.qzeros")
#loc62 = loc("model.language_model.layers.0.mlp.down_proj")
#loc63 = loc("output_states")
