#loc = loc(unknown)
#loc1 = loc("input_states")
#loc2 = loc("position_ids")
#loc3 = loc("attention_mask")
module @block_3 attributes {module.FLOPs = 116039614464 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "bm1684x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = true, module.inputs = ["input_states", "position_ids", "attention_mask"], module.mode = "W4BF16", module.outputs = ["output_states", "k_cache", "v_cache"], module.platform = "LLM_QUANTIZED", module.q_group_size = 128 : i64, module.q_symmetric = false, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "block_3_tpu_addressed_bm1684x_w4bf16_weight.npz"} {
  module @block_3 attributes {module.coeff_addr = 4294967296 : i64, module.coeff_size = 27729920 : i64, module.device_id = 0 : i64, module.dynamic_coeff_offset = 0 : i64, module.neuron_addr = 4322697216 : i64, module.neuron_size = 50343936 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x1024x2048xf32> loc(unknown), %arg1: tensor<3x1024xsi32> loc(unknown), %arg2: tensor<1x1x1024x1024xf32> loc(unknown)) -> (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64>) {
      %0 = "top.Input"(%arg0) {do_preprocess = false} : (tensor<1x1024x2048xf32>) -> tensor<1x1024x2048xbf16, 4324806656 : i64> loc(#loc1)
      %1 = "top.Input"(%arg1) {do_preprocess = false} : (tensor<3x1024xsi32>) -> tensor<3x1024xsi32, 4324794368 : i64> loc(#loc2)
      %2 = "top.Input"(%arg2) {do_preprocess = false} : (tensor<1x1x1024x1024xf32>) -> tensor<1x1x1024x1024xbf16, 4322697216 : i64> loc(#loc3)
      %3:3 = call @subfunc_0(%0, %1, %2) : (tensor<1x1024x2048xbf16, 4324806656 : i64>, tensor<3x1024xsi32, 4324794368 : i64>, tensor<1x1x1024x1024xbf16, 4322697216 : i64>) -> (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64>) loc(#loc)
      return %3#0, %3#1, %3#2 : tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x1024x2048xbf16, 4324806656 : i64> loc("input_states"), %arg1: tensor<3x1024xsi32, 4324794368 : i64> loc("position_ids"), %arg2: tensor<1x1x1024x1024xbf16, 4322697216 : i64> loc("attention_mask")) -> (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_DYNAMIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4294967296 : i64> loc(#loc4)
      %2 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x48xui8, 4294971392 : i64> loc(#loc5)
      %3 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x48xbf16, 4295069696 : i64> loc(#loc6)
      %4 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x3072xui8, 4295266304 : i64> loc(#loc7)
      %5 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4301557760 : i64> loc(#loc8)
      %6 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4301656064 : i64> loc(#loc9)
      %7 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4301852672 : i64> loc(#loc10)
      %8 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x96x16xui8, 4308144128 : i64> loc(#loc11)
      %9 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x96x16xbf16, 4308242432 : i64> loc(#loc12)
      %10 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<6144x1024xui8, 4308439040 : i64> loc(#loc13)
      %11 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x2048xbf16, 4314730496 : i64> loc(#loc14)
      %12 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x256xbf16, 4314734592 : i64> loc(#loc15)
      %13 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x8x16xui8, 4314738688 : i64> loc(#loc16)
      %14 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x8x16xbf16, 4314746880 : i64> loc(#loc17)
      %15 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<512x1024xui8, 4314763264 : i64> loc(#loc18)
      %16 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x32x16xui8, 4315287552 : i64> loc(#loc19)
      %17 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x32x16xbf16, 4315320320 : i64> loc(#loc20)
      %18 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<2048x1024xui8, 4315385856 : i64> loc(#loc21)
      %19 = "top.Weight"() {path = "tpu.RMSNorm.gamma"} : () -> tensor<1x1x1x256xbf16, 4317483008 : i64> loc(#loc22)
      %20 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x64x16xui8, 4317487104 : i64> loc(#loc23)
      %21 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x64x16xbf16, 4317552640 : i64> loc(#loc24)
      %22 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<4096x1024xui8, 4317683712 : i64> loc(#loc25)
      %23 = "top.Weight"() {path = "tpu.A16MatMul.zp"} : () -> tensor<64x8x16xui8, 4321878016 : i64> loc(#loc26)
      %24 = "top.Weight"() {path = "tpu.A16MatMul.scale"} : () -> tensor<64x8x16xbf16, 4321886208 : i64> loc(#loc27)
      %25 = "top.Weight"() {path = "tpu.A16MatMul.weight"} : () -> tensor<512x1024xui8, 4321902592 : i64> loc(#loc28)
      %26 = "top.Weight"() {path = "tpu.Gather.index"} : () -> tensor<1x64xi32, 4322426880 : i64> loc(#loc29)
      %27 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2048x1x32xbf16, 4322430976 : i64> loc(#loc30)
      %28 = "top.Weight"() {path = "tpu.Gather.index"} : () -> tensor<1x64xi32, 4322562048 : i64> loc(#loc31)
      %29 = "top.Weight"() {path = "tpu.Gather.source"} : () -> tensor<2048x1x32xbf16, 4322566144 : i64> loc(#loc32)
      %30 = "tpu.RMSNorm"(%arg0, %1) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16, 4324806656 : i64>, tensor<1x1x2048xbf16, 4294967296 : i64>) -> tensor<1x1024x2048xbf16, 4329000960 : i64> loc(#loc33)
      %31 = "tpu.A16MatMul"(%30, %22, %21, %20, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4329000960 : i64>, tensor<4096x1024xui8, 4317683712 : i64>, tensor<64x64x16xbf16, 4317552640 : i64>, tensor<64x64x16xui8, 4317487104 : i64>, none) -> tensor<1x1024x4096xbf16, 4333195264 : i64> loc(#loc34)
      %32 = "tpu.Reshape"(%31) {flatten_start_dim = -1 : i64, shape = [1, -1, 8, 512]} : (tensor<1x1024x4096xbf16, 4333195264 : i64>) -> tensor<1x1024x8x512xbf16, 4333195264 : i64> loc(#loc35)
      %33 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xbf16, 4333195264 : i64>, none, none, none, none) -> tensor<1x1024x8x256xbf16, 4341583872 : i64> loc(#loc36)
      %34 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 512], hasparamConvert_axes = [], offset = [0, 0, 0, 256], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x512xbf16, 4333195264 : i64>, none, none, none, none) -> tensor<1x1024x8x256xbf16, 4345778176 : i64> loc(#loc37)
      %35 = "tpu.Group"(%34) ({
        %71 = "tpu.Load"(%34) {do_bcast = false, ginfo = #tpu.lg<out_addr = 212992, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6], h_slice = [3, 3, 2], w_idx = [0], w_slice = [256], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x8x256xbf16, 4345778176 : i64>) -> tensor<1x1024x8x256xbf16> loc(#loc39)
        %72 = "tpu.Cast"(%71) {ginfo = #tpu.lg<out_addr = 0, out_size = 49152, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6], h_slice = [3, 3, 2], w_idx = [0], w_slice = [256], id = 1, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x8x256xbf16>) -> tensor<1x1024x8x256xf32> loc(#loc40)
        %73 = "tpu.Active"(%72) {bias = 0.000000e+00 : f64, ginfo = #tpu.lg<out_addr = 49152, out_size = 49152, buffer_addr = 98304, buffer_size = 98432, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6], h_slice = [3, 3, 2], w_idx = [0], w_slice = [256], id = 2, stage = 1, slice_idx = 0, group_type = 4>, log = false, mode = #tpu<active_mode SIGMOID>, scale = 1.000000e+00 : f64} : (tensor<1x1024x8x256xf32>) -> tensor<1x1024x8x256xf32> loc(#loc38)
        %74 = "tpu.Store"(%73, %0) {ginfo = #tpu.lg<out_addr = 49152, out_size = 49152, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 3, 6], h_slice = [3, 3, 2], w_idx = [0], w_slice = [256], id = 3, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x8x256xf32>, none) -> tensor<1x1024x8x256xf32, 4333195264 : i64> loc(#loc38)
        "tpu.Yield"(%74) : (tensor<1x1024x8x256xf32, 4333195264 : i64>) -> () loc(#loc38)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, 3, -2, 2, 0], group_type = 4 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x8x256xbf16, 4345778176 : i64>) -> tensor<1x1024x8x256xf32, 4333195264 : i64> loc(#loc38)
      %36 = "tpu.A16MatMul"(%30, %15, %14, %13, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4329000960 : i64>, tensor<512x1024xui8, 4314763264 : i64>, tensor<64x8x16xbf16, 4314746880 : i64>, tensor<64x8x16xui8, 4314738688 : i64>, none) -> tensor<1x1024x512xbf16, 4345778176 : i64> loc(#loc41)
      %37 = "tpu.A16MatMul"(%30, %25, %24, %23, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4329000960 : i64>, tensor<512x1024xui8, 4321902592 : i64>, tensor<64x8x16xbf16, 4321886208 : i64>, tensor<64x8x16xui8, 4321878016 : i64>, none) -> tensor<1x1024x512xbf16, 4371992576 : i64> loc(#loc42)
      %38 = "tpu.Reshape"(%36) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xbf16, 4345778176 : i64>) -> tensor<1x1024x2x256xbf16, 4345778176 : i64> loc(#loc43)
      %39 = "tpu.Reshape"(%37) {flatten_start_dim = -1 : i64, shape = [1, -1, 2, 256]} : (tensor<1x1024x512xbf16, 4371992576 : i64>) -> tensor<1x1024x2x256xbf16, 4371992576 : i64> loc(#loc44)
      %40 = "tpu.RMSNorm"(%33, %19) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x8x256xbf16, 4341583872 : i64>, tensor<1x1x1x256xbf16, 4317483008 : i64>) -> tensor<1x1024x8x256xbf16, 4329000960 : i64> loc(#loc45)
      %41 = "tpu.RMSNorm"(%38, %12) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2x256xbf16, 4345778176 : i64>, tensor<1x1x1x256xbf16, 4314734592 : i64>) -> tensor<1x1024x2x256xbf16, 4341583872 : i64> loc(#loc46)
      %42 = "tpu.Gather"(%27, %arg1, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16, 4322430976 : i64>, tensor<3x1024xsi32, 4324794368 : i64>, none) -> tensor<3x1024x1x32xbf16, 4342632448 : i64> loc(#loc47)
      %43 = "tpu.Permute"(%42, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xbf16, 4342632448 : i64>, none) -> tensor<3x32x1x1024xbf16, 4342829056 : i64> loc(#loc48)
      %44 = "tpu.Reshape"(%43) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xbf16, 4342829056 : i64>) -> tensor<96x1x1024xbf16, 4342829056 : i64> loc(#loc49)
      %45 = "tpu.Gather"(%44, %26, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xbf16, 4342829056 : i64>, tensor<1x64xi32, 4322426880 : i64>, none) -> tensor<1x64x1x1024xbf16, 4343025664 : i64> loc(#loc50)
      %46 = "tpu.Permute"(%45, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xbf16, 4343025664 : i64>, none) -> tensor<1x1024x1x64xbf16, 4343156736 : i64> loc(#loc51)
      %47 = "tpu.Gather"(%29, %arg1, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<2048x1x32xbf16, 4322566144 : i64>, tensor<3x1024xsi32, 4324794368 : i64>, none) -> tensor<3x1024x1x32xbf16, 4343287808 : i64> loc(#loc52)
      %48 = "tpu.Permute"(%47, %0) {order = [0, 3, 2, 1]} : (tensor<3x1024x1x32xbf16, 4343287808 : i64>, none) -> tensor<3x32x1x1024xbf16, 4343484416 : i64> loc(#loc53)
      %49 = "tpu.Reshape"(%48) {flatten_start_dim = -1 : i64, shape = [96, 1, -1]} : (tensor<3x32x1x1024xbf16, 4343484416 : i64>) -> tensor<96x1x1024xbf16, 4343484416 : i64> loc(#loc54)
      %50 = "tpu.Gather"(%49, %28, %0) {axis = 0 : si32, if_neg_index = true, is_lora = false, is_scalar = false, keepdims = true} : (tensor<96x1x1024xbf16, 4343484416 : i64>, tensor<1x64xi32, 4322562048 : i64>, none) -> tensor<1x64x1x1024xbf16, 4343681024 : i64> loc(#loc55)
      %51 = "tpu.Permute"(%50, %0) {order = [0, 3, 2, 1]} : (tensor<1x64x1x1024xbf16, 4343681024 : i64>, none) -> tensor<1x1024x1x64xbf16, 4343812096 : i64> loc(#loc56)
      %52 = "tpu.Slice"(%40, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xbf16, 4329000960 : i64>, none, none, none, none) -> tensor<1x1024x8x64xbf16, 4343943168 : i64> loc(#loc57)
      %53 = "tpu.Slice"(%40, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 8, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x8x256xbf16, 4329000960 : i64>, none, none, none, none) -> tensor<1x1024x8x192xbf16, 4344991744 : i64> loc(#loc58)
      %54 = "tpu.Group"(%52, %51, %46, %53) ({
        %71 = "tpu.Load"(%52) {do_bcast = false, ginfo = #tpu.lg<out_addr = 131072, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x8x64xbf16, 4343943168 : i64>) -> tensor<1x1024x8x64xbf16> loc(#loc60)
        %72 = "tpu.Load"(%51) {do_bcast = false, ginfo = #tpu.lg<out_addr = 147456, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x1x64xbf16, 4343812096 : i64>) -> tensor<1x1024x1x64xbf16> loc(#loc61)
        %73 = "tpu.Load"(%46) {do_bcast = false, ginfo = #tpu.lg<out_addr = 196608, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 2, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x1x64xbf16, 4343156736 : i64>) -> tensor<1x1024x1x64xbf16> loc(#loc62)
        %74 = "tpu.Load"(%53) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 49152, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [192], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x8x192xbf16, 4344991744 : i64>) -> tensor<1x1024x8x192xbf16> loc(#loc63)
        %75 = "tpu.Rope"(%71, %72, %73) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, ginfo = #tpu.lg<out_addr = 114688, out_size = 16384, buffer_addr = 163840, buffer_size = 32768, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [64], id = 4, stage = 1, slice_idx = 0, group_type = 4>, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1024x8x64xbf16>, tensor<1x1024x1x64xbf16>, tensor<1x1024x1x64xbf16>) -> tensor<1x1024x8x64xbf16> loc(#loc64)
        %76 = "tpu.Concat"(%75, %74) {axis = 3 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 65536, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 5, stage = 1, slice_idx = 0, group_type = 4>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x8x64xbf16>, tensor<1x1024x8x192xbf16>) -> tensor<1x1024x8x256xbf16> loc(#loc59)
        %77 = "tpu.Store"(%76, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 65536, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [8], w_idx = [0], w_slice = [256], id = 6, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x8x256xbf16>, none) -> tensor<1x1024x8x256xbf16, 4329000960 : i64> loc(#loc59)
        "tpu.Yield"(%77) : (tensor<1x1024x8x256xbf16, 4329000960 : i64>) -> () loc(#loc59)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x8x64xbf16, 4343943168 : i64>, tensor<1x1024x1x64xbf16, 4343812096 : i64>, tensor<1x1024x1x64xbf16, 4343156736 : i64>, tensor<1x1024x8x192xbf16, 4344991744 : i64>) -> tensor<1x1024x8x256xbf16, 4329000960 : i64> loc(#loc59)
      %55 = "tpu.Slice"(%41, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 64], hasparamConvert_axes = [], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xbf16, 4341583872 : i64>, none, none, none, none) -> tensor<1x1024x2x64xbf16, 4343943168 : i64> loc(#loc65)
      %56 = "tpu.Slice"(%41, %0, %0, %0, %0) {axes = [], ends = [1, 1024, 2, 256], hasparamConvert_axes = [], offset = [0, 0, 0, 64], steps = [1, 1, 1, 1]} : (tensor<1x1024x2x256xbf16, 4341583872 : i64>, none, none, none, none) -> tensor<1x1024x2x192xbf16, 4344205312 : i64> loc(#loc66)
      %57 = "tpu.Group"(%55, %51, %46, %56) ({
        %71 = "tpu.Load"(%55) {do_bcast = false, ginfo = #tpu.lg<out_addr = 49152, out_size = 4096, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [64], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x2x64xbf16, 4343943168 : i64>) -> tensor<1x1024x2x64xbf16> loc(#loc68)
        %72 = "tpu.Load"(%51) {do_bcast = false, ginfo = #tpu.lg<out_addr = 65536, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 1, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x1x64xbf16, 4343812096 : i64>) -> tensor<1x1024x1x64xbf16> loc(#loc61)
        %73 = "tpu.Load"(%46) {do_bcast = false, ginfo = #tpu.lg<out_addr = 98304, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 2, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x1x64xbf16, 4343156736 : i64>) -> tensor<1x1024x1x64xbf16> loc(#loc62)
        %74 = "tpu.Load"(%56) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 12288, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [192], id = 3, stage = 1, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x2x192xbf16, 4344205312 : i64>) -> tensor<1x1024x2x192xbf16> loc(#loc69)
        %75 = "tpu.Rope"(%71, %72, %73) {add_round_mode = #tpu<round_mode HalfAwayFromZero>, add_saturation = true, add_shift = 0 : si32, force_f32 = false, ginfo = #tpu.lg<out_addr = 32768, out_size = 4096, buffer_addr = 81920, buffer_size = 8192, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [64], id = 4, stage = 1, slice_idx = 0, group_type = 4>, is_permute_optimize = false, mul1_round_mode = #tpu<round_mode HalfAwayFromZero>, mul1_saturation = true, mul1_shift = 0 : si32, mul2_round_mode = #tpu<round_mode HalfAwayFromZero>, mul2_saturation = true, mul2_shift = 0 : si32, rope_mode = #tpu<rope_mode contiguous_halves>} : (tensor<1x1024x2x64xbf16>, tensor<1x1024x1x64xbf16>, tensor<1x1024x1x64xbf16>) -> tensor<1x1024x2x64xbf16> loc(#loc70)
        %76 = "tpu.Concat"(%75, %74) {axis = 3 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [256], id = 5, stage = 1, slice_idx = 0, group_type = 4>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2x64xbf16>, tensor<1x1024x2x192xbf16>) -> tensor<1x1024x2x256xbf16> loc(#loc67)
        %77 = "tpu.Store"(%76, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 16384, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [2], w_idx = [0], w_slice = [256], id = 6, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x2x256xbf16>, none) -> tensor<1x1024x2x256xbf16, 4358361088 : i64> loc(#loc67)
        "tpu.Yield"(%77) : (tensor<1x1024x2x256xbf16, 4358361088 : i64>) -> () loc(#loc67)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 4 : i64, hsecs = 1 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x2x64xbf16, 4343943168 : i64>, tensor<1x1024x1x64xbf16, 4343812096 : i64>, tensor<1x1024x1x64xbf16, 4343156736 : i64>, tensor<1x1024x2x192xbf16, 4344205312 : i64>) -> tensor<1x1024x2x256xbf16, 4358361088 : i64> loc(#loc67)
      %58 = "tpu.FAttention"(%54, %57, %39, %arg2, %0) {batch = 1 : i64, dim = 256 : i64, keep_dims = false, kv_head = 2 : i64, mk = 1024 : i64, mq = 1024 : i64, q_head = 8 : i64, scale = 6.250000e-02 : f64} : (tensor<1x1024x8x256xbf16, 4329000960 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64>, tensor<1x1x1024x1024xbf16, 4322697216 : i64>, none) -> tensor<1x1024x2048xbf16, 4341583872 : i64> loc(#loc71)
      %59 = "tpu.Reshape"(%35) {flatten_start_dim = -1 : i64, shape = [1, -1, 2048]} : (tensor<1x1024x8x256xf32, 4333195264 : i64>) -> tensor<1x1024x2048xf32, 4333195264 : i64> loc(#loc72)
      %60 = "tpu.Cast"(%59) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x2048xf32, 4333195264 : i64>) -> tensor<1x1024x2048xbf16, 4329000960 : i64> loc(#loc73)
      %61 = "tpu.Mul"(%58, %60) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x2048xbf16, 4341583872 : i64>, tensor<1x1024x2048xbf16, 4329000960 : i64>) -> tensor<1x1024x2048xbf16, 4333195264 : i64> loc(#loc74)
      %62 = "tpu.A16MatMul"(%61, %18, %17, %16, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<2048x1024xui8, 4315385856 : i64>, tensor<64x32x16xbf16, 4315320320 : i64>, tensor<64x32x16xui8, 4315287552 : i64>, none) -> tensor<1x1024x2048xbf16, 4337389568 : i64> loc(#loc75)
      %63 = "tpu.Add"(%arg0, %62) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16, 4324806656 : i64>, tensor<1x1024x2048xbf16, 4337389568 : i64>) -> tensor<1x1024x2048xbf16, 4329000960 : i64> loc(#loc76)
      %64 = "tpu.RMSNorm"(%63, %11) {eps = 9.9999999999999995E-7 : f64, weight_keep_f32 = false} : (tensor<1x1024x2048xbf16, 4329000960 : i64>, tensor<1x1x2048xbf16, 4314730496 : i64>) -> tensor<1x1024x2048xbf16, 4333195264 : i64> loc(#loc77)
      %65 = "tpu.A16MatMul"(%64, %7, %6, %5, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<6144x1024xui8, 4301852672 : i64>, tensor<64x96x16xbf16, 4301656064 : i64>, tensor<64x96x16xui8, 4301557760 : i64>, none) -> tensor<1x1024x6144xbf16, 4337389568 : i64> loc(#loc78)
      %66 = "tpu.Group"(%65) ({
        %71 = "tpu.Load"(%65) {do_bcast = false, ginfo = #tpu.lg<out_addr = 131072, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 0, stage = 0, slice_idx = 0, group_type = 4>, is_idx_weight = false, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1024x6144xbf16, 4337389568 : i64>) -> tensor<1x1024x6144xbf16> loc(#loc80)
        %72 = "tpu.Cast"(%71) {ginfo = #tpu.lg<out_addr = 0, out_size = 49152, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 1, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xbf16>) -> tensor<1x1024x6144xf32> loc(#loc81)
        %73 = "tpu.Active"(%72) {ginfo = #tpu.lg<out_addr = 49152, out_size = 49152, buffer_addr = 131072, buffer_size = 98432, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 2, stage = 1, slice_idx = 0, group_type = 4>, mode = #tpu<active_mode SILU>} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xf32> loc(#loc82)
        %74 = "tpu.Cast"(%73) {ginfo = #tpu.lg<out_addr = 98304, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 3, stage = 1, slice_idx = 0, group_type = 4>, round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x1024x6144xf32>) -> tensor<1x1024x6144xbf16> loc(#loc79)
        %75 = "tpu.Store"(%74, %0) {ginfo = #tpu.lg<out_addr = 98304, out_size = 24576, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1024], d_idx = [0], d_slice = [1], h_idx = [0, 768, 1536, 2304, 3072, 3840, 4608, 5376], h_slice = [768, 768, 768, 768, 768, 768, 768, 768], w_idx = [0], w_slice = [1], id = 4, stage = 2, slice_idx = 0, group_type = 4>, support_compress = true} : (tensor<1x1024x6144xbf16>, none) -> tensor<1x1024x6144xbf16, 4359409664 : i64> loc(#loc79)
        "tpu.Yield"(%75) : (tensor<1x1024x6144xbf16, 4359409664 : i64>) -> () loc(#loc79)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 1, -2, 2, 4, -3, 3, 0], group_type = 4 : i64, hsecs = 8 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x1024x6144xbf16, 4337389568 : i64>) -> tensor<1x1024x6144xbf16, 4359409664 : i64> loc(#loc79)
      %67 = "tpu.A16MatMul"(%64, %10, %9, %8, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<6144x1024xui8, 4308439040 : i64>, tensor<64x96x16xbf16, 4308242432 : i64>, tensor<64x96x16xui8, 4308144128 : i64>, none) -> tensor<1x1024x6144xbf16, 4345778176 : i64> loc(#loc83)
      %68 = "tpu.Mul"(%66, %67) {do_relu = false, is_scalar = false, multiplier = 1 : si32, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, rshift = 0 : si32} : (tensor<1x1024x6144xbf16, 4359409664 : i64>, tensor<1x1024x6144xbf16, 4345778176 : i64>) -> tensor<1x1024x6144xbf16, 4333195264 : i64> loc(#loc84)
      %69 = "tpu.A16MatMul"(%68, %4, %3, %2, %0) {dq_type = "NONE", q_group_size = 128 : i64, sign = true, w_transpose = true, weight_bits = 4 : i64} : (tensor<1x1024x6144xbf16, 4333195264 : i64>, tensor<2048x3072xui8, 4295266304 : i64>, tensor<64x32x48xbf16, 4295069696 : i64>, tensor<64x32x48xui8, 4294971392 : i64>, none) -> tensor<1x1024x2048xbf16, 4345778176 : i64> loc(#loc85)
      %70 = "tpu.Add"(%63, %69) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x1024x2048xbf16, 4329000960 : i64>, tensor<1x1024x2048xbf16, 4345778176 : i64>) -> tensor<1x1024x2048xbf16, 4333195264 : i64> loc(#loc86)
      return %70, %57, %39 : tensor<1x1024x2048xbf16, 4333195264 : i64>, tensor<1x1024x2x256xbf16, 4358361088 : i64>, tensor<1x1024x2x256xbf16, 4371992576 : i64> loc(#loc)
    } loc(#loc)
  } loc(#loc)
} loc(#loc)
#loc4 = loc("model.language_model.layers.3.input_layernorm.weight_bf16")
#loc5 = loc("model.language_model.layers.3.mlp.down_proj_1_reordered")
#loc6 = loc("model.language_model.layers.3.mlp.down_proj_reordered")
#loc7 = loc("model.language_model.layers.3.mlp.down_proj_weight")
#loc8 = loc("model.language_model.layers.3.mlp.gate_proj_1_reordered")
#loc9 = loc("model.language_model.layers.3.mlp.gate_proj_reordered")
#loc10 = loc("model.language_model.layers.3.mlp.gate_proj_weight")
#loc11 = loc("model.language_model.layers.3.mlp.up_proj_1_reordered")
#loc12 = loc("model.language_model.layers.3.mlp.up_proj_reordered")
#loc13 = loc("model.language_model.layers.3.mlp.up_proj_weight")
#loc14 = loc("model.language_model.layers.3.post_attention_layernorm.weight_bf16")
#loc15 = loc("model.language_model.layers.3.self_attn.k_norm.weight_bf16")
#loc16 = loc("model.language_model.layers.3.self_attn.k_proj_1_reordered")
#loc17 = loc("model.language_model.layers.3.self_attn.k_proj_reordered")
#loc18 = loc("model.language_model.layers.3.self_attn.k_proj_weight")
#loc19 = loc("model.language_model.layers.3.self_attn.o_proj_1_reordered")
#loc20 = loc("model.language_model.layers.3.self_attn.o_proj_reordered")
#loc21 = loc("model.language_model.layers.3.self_attn.o_proj_weight")
#loc22 = loc("model.language_model.layers.3.self_attn.q_norm.weight_bf16")
#loc23 = loc("model.language_model.layers.3.self_attn.q_proj_1_reordered")
#loc24 = loc("model.language_model.layers.3.self_attn.q_proj_reordered")
#loc25 = loc("model.language_model.layers.3.self_attn.q_proj_weight")
#loc26 = loc("model.language_model.layers.3.self_attn.v_proj_1_reordered")
#loc27 = loc("model.language_model.layers.3.self_attn.v_proj_reordered")
#loc28 = loc("model.language_model.layers.3.self_attn.v_proj_weight")
#loc29 = loc("mrope_interleave_idx_int")
#loc30 = loc("rotary_cos.weight_bf16")
#loc31 = loc("rotary_sin.gathermrope_interleave_idx_int")
#loc32 = loc("rotary_sin.weight_bf16")
#loc33 = loc("model.language_model.layers.3.input_layernorm")
#loc34 = loc("model.language_model.layers.3.self_attn.q_proj")
#loc35 = loc("model.language_model.layers.3.self_attn.q_proj.reshape")
#loc36 = loc("model.language_model.layers.3.self_attn.q_proj.q_slice")
#loc37 = loc("model.language_model.layers.3.self_attn.q_proj.gate_slice")
#loc38 = loc("model.language_model.layers.3.mlp.gate_proj.gate_sigmoid")
#loc39 = loc("load_model.language_model.layers.3.self_attn.q_proj.gate_slice")
#loc40 = loc("model.language_model.layers.3.self_attn.q_proj.gate_slicemodel.language_model.layers.3.mlp.gate_proj.gate_sigmoid_f32")
#loc41 = loc("model.language_model.layers.3.self_attn.k_proj")
#loc42 = loc("model.language_model.layers.3.self_attn.v_proj")
#loc43 = loc("model.language_model.layers.3.self_attn.k_proj.reshape")
#loc44 = loc("v_cache")
#loc45 = loc("model.language_model.layers.3.self_attn.q_norm")
#loc46 = loc("model.language_model.layers.3.self_attn.k_norm")
#loc47 = loc("rotary_cos")
#loc48 = loc("rotary_cos.permute")
#loc49 = loc("rotary_cos.reshape")
#loc50 = loc("rotary_cos.gather")
#loc51 = loc("rotary_cos.permute2")
#loc52 = loc("rotary_sin")
#loc53 = loc("rotary_sin.permute")
#loc54 = loc("rotary_sin.reshape")
#loc55 = loc("rotary_sin.gather")
#loc56 = loc("rotary_sin.permute2")
#loc57 = loc("q_proj.slice")
#loc58 = loc("q_proj.slice2")
#loc59 = loc("q_proj")
#loc60 = loc("load_q_proj.slice")
#loc61 = loc("load_rotary_sin.permute2")
#loc62 = loc("load_rotary_cos.permute2")
#loc63 = loc("load_q_proj.slice2")
#loc64 = loc("q_proj.rope")
#loc65 = loc("k_proj.slice")
#loc66 = loc("k_proj.slice2")
#loc67 = loc("k_cache")
#loc68 = loc("load_k_proj.slice")
#loc69 = loc("load_k_proj.slice2")
#loc70 = loc("k_proj.rope")
#loc71 = loc("model.language_model.layers.3.fattention")
#loc72 = loc("model.language_model.layers.3.mlp.gate_proj.gate_reshape")
#loc73 = loc("model.language_model.layers.3.mlp.gate_proj.gate_reshapemodel.language_model.layers.3.mlp.gate_proj.gate_mul_bf16")
#loc74 = loc("model.language_model.layers.3.mlp.gate_proj.gate_mul")
#loc75 = loc("model.language_model.layers.3.self_attn.o_proj")
#loc76 = loc("model.language_model.layers.3.self_attn.o_proj.add")
#loc77 = loc("model.language_model.layers.3.post_attention_layernorm")
#loc78 = loc("model.language_model.layers.3.mlp.gate_proj")
#loc79 = loc("model.language_model.layers.3.mlp.gate_proj.silumodel.language_model.layers.3.mlp.up_proj.mul_bf16")
#loc80 = loc("load_model.language_model.layers.3.mlp.gate_proj")
#loc81 = loc("model.language_model.layers.3.mlp.gate_projmodel.language_model.layers.3.mlp.gate_proj.silu_f32")
#loc82 = loc("model.language_model.layers.3.mlp.gate_proj.silu")
#loc83 = loc("model.language_model.layers.3.mlp.up_proj")
#loc84 = loc("model.language_model.layers.3.mlp.up_proj.mul")
#loc85 = loc("model.language_model.layers.3.mlp.down_proj")
#loc86 = loc("output_states")

